Repository: junaidabduljabbar/arches7-internationalization
Catalog: translated_out.po
Languages: ur

source: In the example below, a search is made within a single resource type for any name <strong>like</strong> "church" <strong>or</strong> any name <strong>like</strong> "gate".
ur: ذیل کی مثال میں، کسی بھی نام <strong>جیسے</strong> "church" <strong>یا</strong> کسی بھی نام <strong>like</strong> "gate" کے لیے ایک واحد وسائل کی قسم میں تلاش کی جاتی ہے۔

source: search for multiple words in names - click to view
ur: ناموں میں متعدد الفاظ تلاش کریں - دیکھنے کے لیے کلک کریں۔

source: Related
ur: متعلقہ

source: For each resource listed in the search results you can view its related resources with the "Related Resources" link under the description. By viewing Related Resources, you get a new view of the database: not how resources are related geographically nor chronologically, but qualitatively.
ur: تلاش کے نتائج میں درج ہر وسائل کے لیے آپ تفصیل کے نیچے "متعلقہ وسائل" کے لنک کے ساتھ اس کے متعلقہ وسائل دیکھ سکتے ہیں۔ متعلقہ وسائل کو دیکھ کر، آپ کو ڈیٹا بیس کا ایک نیا منظر ملتا ہے: یہ نہیں کہ وسائل کا تعلق جغرافیائی طور پر اور نہ ہی تاریخ کے لحاظ سے، بلکہ معیار کے لحاظ سے ہے۔

source: There two methods for viewing Related Resources: in a table where each related resource is a row, or in a graph where resources are shown as nodes in a graph, with relationships connecting them.
ur: متعلقہ وسائل کو دیکھنے کے دو طریقے ہیں: ایک جدول میں جہاں ہر متعلقہ وسیلہ ایک قطار ہے، یا ایک گراف میں جہاں وسائل کو ایک گراف میں نوڈس کے طور پر دکھایا گیا ہے، ان سے منسلک تعلقات کے ساتھ۔

source: <p>A number of global settings can be defined or altered here.</p>
ur: <p>یہاں متعدد عالمی ترتیبات کی وضاحت یا تبدیلی کی جا سکتی ہے۔</p>

source: Default Application Settings
ur: پہلے سے طے شدہ درخواست کی ترتیبات

source: <strong>Application Name</strong> - Name of your Arches app, to be displayed in the browser title bar and elsewhere.<br> <strong>Default Data Import/Export User</strong> - Name to associate with data that is imported into the system.<br>
ur: <strong>درخواست کا نام</strong> - آپ کے آرچز ایپ کا نام، براؤزر کے ٹائٹل بار اور دیگر جگہوں پر ظاہر ہونا۔<br> <strong>ڈیفالٹ ڈیٹا درآمد/برآمد صارف</strong> - سسٹم میں درآمد کردہ ڈیٹا سے وابستہ کرنے کا نام۔<br>

source: Web Analytics
ur: ویب تجزیات

source: <strong>Google Analytics Key</strong> - If you have made a Google Analytics Key to track your app's traffic, enter it here.<br>
ur: <strong>Google Analytics کلید</strong> - اگر آپ نے اپنی ایپ کے ٹریفک کو ٹریک کرنے کے لیے Google Analytics کلید بنائی ہے، تو اسے یہاں درج کریں۔<br>

source: Thesaurus Service Providers
ur: تھیسورس سروس فراہم کرنے والے

source: <strong>Thesaurus SPARQL Endpoint</strong> - Advanced users may create more SPARQL endpoints and register them here. These endpoints will be available in the RDM and allow you to import thesaurus entries from external sources.<br>
ur: <strong>Thesaurus SPARQL اینڈ پوائنٹ</strong> - اعلی درجے کے صارفین مزید SPARQL اینڈ پوائنٹس بنا سکتے ہیں اور انہیں یہاں رجسٹر کر سکتے ہیں۔ یہ اختتامی نکات RDM میں دستیاب ہوں گے اور آپ کو بیرونی ذرائع سے تھیسورس اندراجات درآمد کرنے کی اجازت دیں گے۔<br>

source: Map Settings
ur: نقشے کی سیٹنگز

source: Mapbox API
ur: میپ باکس API

source: Arches uses the Mapbox mapping library for map display and data creation. Arches also supports Mapbox basemaps and other services.
ur: آرچز نقشہ کی نمائش اور ڈیٹا کی تخلیق کے لیے میپ باکس میپنگ لائبریری کا استعمال کرتا ہے۔ آرچز میپ باکس بیس میپس اور دیگر خدمات کو بھی سپورٹ کرتا ہے۔

source: <strong>Mapbox API Key (Optional)</strong> - By default, Arches uses some basemap web services from Mapbox. You will need to <a href='https://www.mapbox.com/help/create-api-access-token/' target="_blank">create a free API key</a> (or "access token") for these services to be activated. Alternatively, you could remove all of the default basemaps and add your own, non-Mapbox layers.
ur: <strong>Mapbox API کلید (اختیاری)</strong> - پہلے سے طے شدہ طور پر، Arches Mapbox سے کچھ بیس میپ ویب سروسز استعمال کرتا ہے۔ آپ کو <a href='https://www.mapbox.com/help/create-api-access-token/' target="_blank">ایک مفت API کلید بنانا ہوگا</a> (یا "ایکسیس ٹوکن) ") ان خدمات کو چالو کرنے کے لئے۔ متبادل طور پر، آپ تمام ڈیفالٹ بیس میپس کو ہٹا سکتے ہیں اور اپنی، غیر میپ باکس پرتیں شامل کر سکتے ہیں۔

source: <strong>Mapbox Sprites</strong> - Path to Mapbox sprites (use default).
ur: <strong>Mapbox Sprites</strong> - Mapbox sprites کا راستہ (پہلے سے طے شدہ استعمال کریں)۔

source: <strong>Mapbox Glyphs</strong> - Path to Mapbox glyphs (use default).
ur: <strong>Mapbox Glyphs</strong> - Mapbox glyphs کا راستہ (پہلے سے طے شدہ استعمال کریں)۔

source: Project Extent
ur: پروجیکٹ کی حد

source: Draw a polygon representing your project's extent. These bounds will serve as the default for the search result grid bounds, and map bounds in search, cards, and reports.
ur: اپنے پروجیکٹ کی حد کی نمائندگی کرنے والا ایک کثیرالاضلاع کھینچیں۔ یہ حدیں تلاش کے نتائج کے گرڈ باؤنڈز، اور تلاش، کارڈز اور رپورٹس میں نقشہ بندی کے لیے بطور ڈیفالٹ کام کریں گی۔

source: Map Zoom
ur: نقشہ زوم

source: You can define the zoom behavior of your map. Zoom level 0 shows the whole world (and is the absolute minimum zoom level) and zoom level 20 is the maximum level that most map services support.
ur: آپ اپنے نقشے کے زوم رویے کی وضاحت کر سکتے ہیں۔ زوم لیول 0 پوری دنیا کو دکھاتا ہے (اور مطلق کم از کم زوم لیول ہے) اور زوم لیول 20 وہ زیادہ سے زیادہ لیول ہے جس کی زیادہ تر میپ سروسز سپورٹ کرتی ہیں۔

source: <strong>Default Zoom</strong> - Set the zoom level that the map will be shown at by default.
ur: <strong>ڈیفالٹ زوم</strong> - زوم لیول سیٹ کریں جس پر نقشہ بطور ڈیفالٹ دکھایا جائے گا۔

source: <strong>Min Zoom</strong> - Minimum zoom level defines how far the user can zoom out when viewing the map.
ur: <strong>کم سے کم زوم</strong> - کم از کم زوم لیول اس بات کی وضاحت کرتا ہے کہ نقشہ دیکھتے وقت صارف کتنی دور زوم آؤٹ کر سکتا ہے۔

source: <strong>Max Zoom</strong> - Maximum zoom level defines how far the user can zoom in when viewing the map.
ur: <strong>زیادہ سے زیادہ زوم</strong> - زیادہ سے زیادہ زوم لیول اس بات کی وضاحت کرتا ہے کہ نقشہ دیکھتے وقت صارف کتنی دور زوم ان کر سکتا ہے۔

source: Search Results Grid
ur: تلاش کے نتائج کا گرڈ

source: Arches aggregates search results and displays them as hexagons. You will need to set default parameters for the hexagon size and precision.
ur: محراب تلاش کے نتائج کو جمع کرتا ہے اور انہیں مسدس کے طور پر دکھاتا ہے۔ آپ کو مسدس کے سائز اور درستگی کے لیے ڈیفالٹ پیرامیٹرز سیٹ کرنے کی ضرورت ہوگی۔

source: <strong>Hexagon Size (in km)</strong> - Set the actual size of the hex bins that will be shown on the map.
ur: <strong>مسدس کا سائز (کلومیٹر میں)</strong> - ہیکس بِنز کا اصل سائز سیٹ کریں جو نقشے پر دکھائے جائیں گے۔

source: <strong>Hexagon Grid Precision</strong> - Set the precision with which the contents of the hex bins will be calculated.
ur: <strong>Hexagon Grid Precision</strong> - وہ درستگی سیٹ کریں جس کے ساتھ ہیکس بِنز کے مواد کا حساب لگایا جائے گا۔

source: <strong>Warning:</strong> A large project area combined with a small hexagon size and/or high precision will take a very long time to load, and can crash your browser. We suggest changing these settings in small increments to find the best combination for your project.
ur: <strong>انتباہ:</strong> چھوٹے مسدس سائز اور/یا اعلی درستگی کے ساتھ مل کر ایک بڑا پروجیکٹ ایریا لوڈ ہونے میں بہت زیادہ وقت لے گا، اور آپ کے براؤزر کو کریش کر سکتا ہے۔ ہم آپ کے پروجیکٹ کے لیے بہترین امتزاج تلاش کرنے کے لیے ان ترتیبات کو چھوٹے اضافے میں تبدیل کرنے کا مشورہ دیتے ہیں۔

source: Basic Search Settings
ur: بنیادی تلاش کی ترتیبات

source: Set the default search results behavior.
ur: پہلے سے طے شدہ تلاش کے نتائج کا رویہ سیٹ کریں۔

source: <p> <strong>Number of search results per page</strong> - Set the number of search results shown per page. Note this also defines the number of search result markers that are shown on the map.<br> <strong>Number of search hints per dropdown</strong> - Set the number of search hints that will appear under the search bar as you type in search terms.<br> <strong>Max number of search results to export</strong> - Set the maximum number of resources to be exported from the search results. This value should generally be evenly divible by the SEARCH_RESULT_LIMIT setting in Arches (10,000 by default). </p>
ur: <p> <strong>فی صفحہ تلاش کے نتائج کی تعداد</strong> - فی صفحہ دکھائے گئے تلاش کے نتائج کی تعداد مقرر کریں۔ نوٹ کریں کہ یہ نقشے پر دکھائے گئے تلاش کے نتائج کے نشانات کی تعداد کی بھی وضاحت کرتا ہے۔<br> <strong>فی ڈراپ ڈاؤن تلاش کے اشارے کی تعداد</strong> - تلاش کے اشارے کی تعداد مقرر کریں جو آپ تلاش کے الفاظ میں ٹائپ کرتے وقت تلاش بار کے نیچے ظاہر ہوں گے۔<br> <strong>برآمد کرنے کے لیے تلاش کے نتائج کی زیادہ سے زیادہ تعداد</strong> - تلاش کے نتائج سے برآمد کیے جانے والے وسائل کی زیادہ سے زیادہ تعداد سیٹ کریں۔ یہ قدر عام طور پر محراب میں SEARCH_RESULT_LIMIT ترتیب کے ذریعہ یکساں طور پر تقسیم کی جانی چاہئے (10,000 بذریعہ ڈیفالٹ)۔ </p>

source: Temporal Search Settings
ur: وقتی تلاش کی ترتیبات

source: Arches creates a Time Wheel based on the resources in your database, to allow for quick temporal visualization and queries. A few aspects of this temporal search are defined here.
ur: آرچز آپ کے ڈیٹا بیس میں موجود وسائل کی بنیاد پر ایک ٹائم وہیل بناتا ہے، تاکہ فوری وقتی تصور اور سوالات کی اجازت دی جا سکے۔ اس وقتی تلاش کے چند پہلوؤں کی یہاں وضاحت کی گئی ہے۔

source: <strong>Color Ramp</strong> - <em>not currently implemented</em> The color ramp for the time wheel. For further reference, check out the <a href='https://github.com/d3/d3-3.x-api-reference/blob/master/Ordinal-Scales.md' target="_blank">d3 API reference</a>.
ur: <strong>رنگ ریمپ</strong> - <em>فی الحال لاگو نہیں ہوا</em> ٹائم وہیل کے لیے رنگین ریمپ۔ مزید حوالہ کے لیے، دیکھیں <a href='https://github.com/d3/d3-3.x-api-reference/blob/master/Ordinal-Scales.md' target="_blank">d3 API حوالہ</a>۔

source: <strong>Time wheel configuration</strong> - <em>not currently implemented</em>
ur: <strong>ٹائم وہیل کنفیگریشن</strong> - <em>فی الحال لاگو نہیں ہوا</em>

source: Saved Searches
ur: محفوظ شدہ تلاشیں۔

source: Arches allows you save a search and present it as convenience for your users. Saved Searches appear as search options in the main Search page. Creating a Saved Search is a three-step process.
ur: آرچز آپ کو تلاش کو محفوظ کرنے اور اسے اپنے صارفین کے لیے سہولت کے طور پر پیش کرنے کی اجازت دیتا ہے۔ محفوظ شدہ تلاشیں مرکزی تلاش کے صفحہ میں تلاش کے اختیارات کے طور پر ظاہر ہوتی ہیں۔ محفوظ کردہ تلاش بنانا ایک تین قدمی عمل ہے۔

source: <strong>1. Specify Search Criteria</strong> - Go to the Search page and enter all the criteria you would like to use to configure your Saved Search. You may notice that with the addition of each new search filter (either by using the term filter, map filtering tools, or temporal filters) the URL for the page will change.<br> <strong>2. Copy the URL</strong> - In your browser address bar, copy the <em>entire</em> URL. This will be a long string that defines each of the search filters created in step 1.<br> <strong>3. Create the Saved Search</strong> - Finally, head back to this page and fill out the settings that you see at left. You can also upload an image that will be shown along with your Search Search.
ur: <strong>1۔ تلاش کے معیار کی وضاحت کریں</strong> - تلاش کے صفحہ پر جائیں اور وہ تمام معیار درج کریں جنہیں آپ اپنی محفوظ کردہ تلاش کو ترتیب دینے کے لیے استعمال کرنا چاہتے ہیں۔ آپ محسوس کر سکتے ہیں کہ ہر نئے سرچ فلٹر کے اضافے کے ساتھ (یا تو اصطلاح فلٹر، میپ فلٹرنگ ٹولز، یا وقتی فلٹر استعمال کرتے ہوئے) صفحہ کا URL تبدیل ہو جائے گا۔<br> <strong>2۔ URL کاپی کریں</strong> - اپنے براؤزر کے ایڈریس بار میں، <em>پورا</em> URL کاپی کریں۔ یہ ایک لمبی سٹرنگ ہوگی جو قدم 1 میں بنائے گئے ہر سرچ فلٹر کی وضاحت کرتی ہے۔<br> <strong>3۔ محفوظ کردہ تلاش تخلیق کریں آپ ایک تصویر بھی اپ لوڈ کر سکتے ہیں جو آپ کی تلاش کی تلاش کے ساتھ دکھائی جائے گی۔

source: Arches | %(version)s
ur: محراب | %(ورژن)s

source: Arches Features
ur: محراب کی خصوصیات

source: Search Arches
ur: محراب تلاش کریں۔

source: Sign in
ur: سائن ان

source: Welcome,
ur: خوش آمدید،

source: Log off
ur: لاگ آف

source: Home
ur: ہوم

source: Fast
ur: تیز

source: Workflows
ur: ورک فلوز

source: Mobile
ur: موبائل

source: Arches %(version)s
ur: محراب %(ورژن)s

source: A web and mobile platform for
ur: کے لیے ایک ویب اور موبائل پلیٹ فارم

source: managing your most important resource information
ur: اپنی اہم ترین وسائل کی معلومات کا انتظام کرنا

source: Taktsang Palphug Monastery (also known as Paro Takstang or Tiger's Nest Monastery), Bhutan
ur: تاکتسانگ پالفگ خانقاہ (جسے پارو تکسٹانگ یا ٹائیگرز نیسٹ خانقاہ بھی کہا جاتا ہے)، بھوٹان

source: Deploy Applications Rapidly
ur: ایپلی کیشنز کو تیزی سے تعینات کریں۔

source: Design custom information management applications in hours. Build your databases with Arches Designer, then configure your interface all without having to write any code.
ur: اپنی مرضی کے مطابق انفارمیشن مینجمنٹ ایپلی کیشنز کو گھنٹوں میں ڈیزائن کریں۔ آرچز ڈیزائنر کے ساتھ اپنا ڈیٹا بیس بنائیں، پھر اپنے انٹرفیس کو بغیر کوئی کوڈ لکھے ترتیب دیں۔

source: Interface Manager
ur: انٹرفیس مینیجر

source: Arches automatically creates data entry forms based on your data models. Use Arches' Card Manager to configure the look and feel of your data entry UI.
ur: آرچز خود بخود آپ کے ڈیٹا ماڈلز کی بنیاد پر ڈیٹا انٹری فارم بناتا ہے۔ اپنے ڈیٹا انٹری UI کی شکل و صورت کو ترتیب دینے کے لیے آرچز کارڈ مینیجر کا استعمال کریں۔

source: Data Security
ur: ڈیٹا سیکیورٹی

source: Use Arches' Permissions Manager to set up data access rules for all your user groups and individual accounts. You can define read/write/delete and no-access permissions.
ur: اپنے تمام یوزر گروپس اور انفرادی اکاؤنٹس کے لیے ڈیٹا تک رسائی کے قوانین ترتیب دینے کے لیے آرچز پرمیشنز مینیجر کا استعمال کریں۔ آپ پڑھنے/لکھنے/حذف کرنے اور بغیر رسائی کی اجازتوں کی وضاحت کر سکتے ہیں۔

source: Orchestrate your data entry
ur: اپنے ڈیٹا کے اندراج کو ترتیب دیں

source: Design step-wise data management interfaces that simplify complex editing tasks. Ensure that everyone enters data completely and consistently
ur: مرحلہ وار ڈیٹا مینجمنٹ انٹرفیس ڈیزائن کریں جو پیچیدہ ترمیمی کاموں کو آسان بناتے ہیں۔ یقینی بنائیں کہ ہر کوئی ڈیٹا کو مکمل اور مستقل طور پر داخل کرتا ہے۔

source: Arches Search Tools
ur: محراب تلاش کے اوزار

source: Find what you're looking for
ur: آپ جو ڈھونڈ رہے ہیں اسے تلاش کریں

source: Arches comes with powerful built-in search tools. Quickly filter large databases with term, geospatial, and time-based search components
ur: محرابیں طاقتور بلٹ ان سرچ ٹولز کے ساتھ آتی ہیں۔ اصطلاح، جغرافیائی، اور وقت پر مبنی تلاش کے اجزاء کے ساتھ بڑے ڈیٹا بیس کو تیزی سے فلٹر کریں۔

source: Search Options
ur: تلاش کے اختیارات

source: Arches gives you many ways to find precisely the information you need, even if your Arches application contains 10's of millions of records. In addition to term, thesaurus, geospatial, and temporal filters, Arches provides you with advanced filtering options that support boolean logic, inverses, and many other filtering options.
ur: آرچز آپ کو اپنی مطلوبہ معلومات کو درست طریقے سے تلاش کرنے کے بہت سے طریقے فراہم کرتا ہے، چاہے آپ کی آرچز ایپلی کیشن میں 10 ملین ریکارڈز ہوں۔ اصطلاح، تھیسورس، جغرافیائی، اور وقتی فلٹرز کے علاوہ، آرچز آپ کو فلٹرنگ کے جدید اختیارات فراہم کرتا ہے جو بولین منطق، الٹا، اور بہت سے دوسرے فلٹرنگ آپشنز کو سپورٹ کرتے ہیں۔

source: Arches' search capabilities also provide for sophisticated data visualizations, including interactive displays of the connections between your data objects using a Force Directed Graph.
ur: آرچز کی تلاش کی صلاحیتیں نفیس ڈیٹا ویژولائزیشن کے لیے بھی فراہم کرتی ہیں، بشمول فورس ڈائریکٹڈ گراف کا استعمال کرتے ہوئے آپ کے ڈیٹا آبجیکٹ کے درمیان رابطوں کی انٹرایکٹو ڈسپلے۔

source: If you're a software developer, you can build on Arches modular search services and create your own filters, reports, and visualizations to best show off your particular dataset.
ur: اگر آپ ایک سافٹ ویئر ڈویلپر ہیں، تو آپ آرچز ماڈیولر سرچ سروسز بنا سکتے ہیں اور اپنے مخصوص ڈیٹاسیٹ کو بہترین طریقے سے دکھانے کے لیے اپنے فلٹرز، رپورٹس اور ویژولائزیشن بنا سکتے ہیں۔

source: Work on the go...
ur: چلتے پھرتے کام...

source: Arches Collector allows you to create new data and edit existing records when you're away from your computer. Don't worry if you're out of cell or Wi-Fi range. Create new records, update information, even add new map locations. Then synch your changes to your Arches application when you re-establish a network connection.
ur: آرچز کلیکٹر آپ کو نیا ڈیٹا بنانے اور موجودہ ریکارڈز میں ترمیم کرنے کی اجازت دیتا ہے جب آپ اپنے کمپیوٹر سے دور ہوتے ہیں۔ اگر آپ سیل یا Wi-Fi کی حد سے باہر ہیں تو پریشان نہ ہوں۔ نئے ریکارڈ بنائیں، معلومات کو اپ ڈیٹ کریں، یہاں تک کہ نئے نقشے کے مقامات شامل کریں۔ پھر جب آپ نیٹ ورک کنکشن دوبارہ قائم کرتے ہیں تو اپنی آرچز ایپلیکیشن میں اپنی تبدیلیوں کو ہم آہنگ کریں۔

source: Arches Collector is available for iOS and Android devices. Download the app from your favorite marketplace.
ur: آرچ کلیکٹر iOS اور اینڈرائیڈ ڈیوائسز کے لیے دستیاب ہے۔ اپنے پسندیدہ بازار سے ایپ ڈاؤن لوڈ کریں۔

source: Sample Institution Name
ur: نمونہ ادارے کا نام

source: Sample Address
ur: نمونہ پتہ

source: Getty Conservation Institute
ur: گیٹی کنزرویشن انسٹی ٹیوٹ

source: 1200 Getty Center Drive
ur: 1200 گیٹی سینٹر ڈرائیو

source: Los Angeles, CA 90049
ur: لاس اینجلس، CA 90049

source: Guides and Documentation
ur: گائیڈز اور دستاویزات

source: What is Arches
ur: محراب کیا ہے؟

source: Arches Collector
ur: آرچ کلیکٹر

source: Implementation Considerations
ur: نفاذ کے تحفظات

source: Information For Developers
ur: ڈویلپرز کے لیے معلومات

source: FAQ
ur: عمومی سوالات

source: Standards and Interoperability
ur: معیارات اور انٹرآپریبلٹی

source: Installation Guide
ur: انسٹالیشن گائیڈ

source: Arches Project Background
ur: محراب پروجیکٹ کا پس منظر

source: Arches Webinars/Presentations
ur: آرچ ویبینرز/پریزنٹیشنز

source: Terms & Conditions
ur: شرائط و ضوابط

source: Privacy Policy
ur: رازداری کی پالیسی

source: Powered by Arches
ur: آرچز کے ذریعہ تقویت یافتہ

source: Find an address...
ur: ایک پتہ تلاش کریں...

source: Edits pending...
ur: ترامیم زیر التواء...

source: You currently have edits pending, are you sure you would like to proceed (and discard any pending edits)?
ur: آپ کے پاس فی الحال ترامیم زیر التواء ہیں، کیا آپ واقعی آگے بڑھنا چاہیں گے (اور کسی بھی زیر التواء ترامیم کو رد کر دیں)؟

source: Delete Branch/Resource Model?
ur: برانچ/وسائل ماڈل کو ڈیلیٹ کریں؟

source: Deleting this branch/resource model will remove it (and all associated data) entirely. Are you sure you would like to proceed?
ur: اس برانچ/وسائل ماڈل کو حذف کرنے سے یہ (اور تمام متعلقہ ڈیٹا) مکمل طور پر ختم ہو جائے گا۔ کیا آپ واقعی آگے بڑھنا چاہیں گے؟

source: Delete All Resources Associated with this Graph?
ur: اس گراف سے وابستہ تمام وسائل کو حذف کریں؟

source: Deleting All Resources removes all associated data with this graph entirely. Are you sure you would like to proceed?
ur: تمام وسائل کو حذف کرنے سے اس گراف کے ساتھ تمام متعلقہ ڈیٹا مکمل طور پر ہٹ جاتا ہے۔ کیا آپ واقعی آگے بڑھنا چاہیں گے؟

source: Delete Resource?
ur: ڈیلیٹ ریسورس؟

source: Deleting this resource will remove it (and all associated data) entirely. Are you sure you would like to proceed?
ur: اس وسائل کو حذف کرنے سے یہ (اور تمام متعلقہ ڈیٹا) مکمل طور پر ختم ہو جائے گا۔ کیا آپ واقعی آگے بڑھنا چاہیں گے؟

source: Delete map layer?
ur: نقشہ کی پرت کو حذف کریں؟

source: Deleting this map layer will remove it entirely. You cannot undo this action. Are you sure you would like to proceed?
ur: اس نقشے کی پرت کو حذف کرنے سے یہ مکمل طور پر ختم ہو جائے گی۔ آپ اس کارروائی کو کالعدم نہیں کر سکتے۔ کیا آپ واقعی آگے بڑھنا چاہیں گے؟

source: Delete survey?
ur: سروے کو ڈیلیٹ کریں؟

source: Deleting this survey will remove it entirely. You cannot undo this action. Are you sure you would like to proceed?
ur: اس سروے کو حذف کرنے سے یہ مکمل طور پر ختم ہو جائے گا۔ آپ اس کارروائی کو کالعدم نہیں کر سکتے۔ کیا آپ واقعی آگے بڑھنا چاہیں گے؟

source: Graph import failed.
ur: گراف کی درآمد ناکام ہو گئی۔

source: Request Failed...
ur: درخواست ناکام ہو گئی...

source: Sorry! The request failed. Please try again. Contact your system administrator if the problem persists.
ur: معذرت! درخواست ناکام ہوگئی۔ دوبارہ کوشش کریں. اگر مسئلہ برقرار رہتا ہے تو اپنے سسٹم ایڈمنسٹریٹر سے رابطہ کریں۔

source: Resource Successfully Copied.
ur: ریسورس کامیابی کے ساتھ کاپی ہو گیا۔

source: Resource Copy Failed...
ur: ریسورس کی کاپی ناکام ہو گئی...

source: Sorry! The copy request failed. Please try again. Contact your system administrator if the problem persists.
ur: معذرت! کاپی کی درخواست ناکام ہوگئی۔ دوبارہ کوشش کریں. اگر مسئلہ برقرار رہتا ہے تو اپنے سسٹم ایڈمنسٹریٹر سے رابطہ کریں۔

source: You are deactivating an active survey
ur: آپ ایک فعال سروے کو غیر فعال کر رہے ہیں۔

source: Users will not be able to download this survey to their device
ur: صارفین اس سروے کو اپنے ڈیوائس پر ڈاؤن لوڈ نہیں کر سکیں گے۔

source: You are activating this survey
ur: آپ اس سروے کو فعال کر رہے ہیں۔

source: Users will immediately be able to download this survey and begin collecting data
ur: صارفین فوری طور پر اس سروے کو ڈاؤن لوڈ کر سکیں گے اور ڈیٹا اکٹھا کرنا شروع کر دیں گے۔

source: Add point
ur: پوائنٹ شامل کریں

source: Add line
ur: لائن شامل کریں

source: Add polygon
ur: پولیگون شامل کریں

source: Select drawing
ur: ڈرائنگ کا انتخاب کریں

source: Create a new ${graphName}
ur: ایک نیا ${graphName} بنائیں

source: Add new Relationship
ur: نیا رشتہ شامل کریں۔

source: Network response was not ok
ur: نیٹ ورک کا جواب ٹھیک نہیں تھا۔

source: You are about to delete ${val}.
ur: آپ ${val} کو حذف کرنے والے ہیں۔

source: Are you sure you want to continue?
ur: کیا آپ واقعی جاری رکھنا چاہتے ہیں؟

source: You are about to quit the workflow.
ur: آپ ورک فلو کو چھوڑنے والے ہیں۔

source: Term Matches
ur: ٹرم میچز

source: ${total} date values
ur: ${total} تاریخ کی ویلیوز

source: Select Widgets
ur: وجیٹس کو منتخب کریں۔

source: (This card data will define the resource description.)
ur: (یہ کارڈ ڈیٹا وسائل کی تفصیل کی وضاحت کرے گا۔)

source: (This card data will define the resource name.)
ur: (یہ کارڈ ڈیٹا وسائل کے نام کی وضاحت کرے گا۔)

source: Model Details
ur: ماڈل کی تفصیلات

source: Summary of how this model participates in the survey
ur: یہ ماڈل سروے میں کس طرح حصہ لیتا ہے اس کا خلاصہ

source: Settings Conflict: Remove this card from grouped card?
ur: ترتیبات کا تنازعہ: اس کارڈ کو گروپ کارڈ سے ہٹائیں؟

source: The cardinality of this card can\
ur: اس کارڈ کی اہمیت

source: Cancel drawing
ur: ڈرائنگ منسوخ کریں

source: Finish drawing
ur: ڈرائنگ ختم کریں

source: Finish
ur: ختم

source: Delete last point drawn
ur: تیار کردہ آخری نقطہ کو حذف کریں۔

source: Delete last point
ur: آخری پوائنٹ کو حذف کریں۔

source: Draw a polyline
ur: پولی لائن کھینچیں۔

source: Draw a polygon
ur: کثیرالاضلاع کھینچیں۔

source: Draw a rectangle
ur: ایک مستطیل کھینچیں۔

source: Draw a circle
ur: ایک دائرہ کھینچیں۔

source: Draw a marker
ur: مارکر ڈرا کریں

source: Click and drag to draw circle.
ur: دائرہ بنانے کے لیے کلک کریں اور گھسیٹیں۔

source: Radius
ur: رداس

source: Click map to place marker.
ur: مارکر لگانے کے لیے نقشے پر کلک کریں۔

source: Click to start drawing shape.
ur: شکل ڈرائنگ شروع کرنے کے لیے کلک کریں۔

source: Click to continue drawing shape.
ur: شکل ڈرائنگ جاری رکھنے کے لیے کلک کریں۔

source: Click first point to close this shape.
ur: اس شکل کو بند کرنے کے لیے پہلے پوائنٹ پر کلک کریں۔

source: <strong>Error:</strong> shape edges cannot cross!
ur: <strong>خرابی:</strong> شکل کے کنارے پار نہیں ہو سکتے!

source: Click to start drawing line.
ur: لائن ڈرائنگ شروع کرنے کے لیے کلک کریں۔

source: Click to continue drawing line.
ur: ڈرائنگ لائن جاری رکھنے کے لیے کلک کریں۔

source: Click last point to finish line.
ur: لائن ختم کرنے کے لیے آخری پوائنٹ پر کلک کریں۔

source: Click and drag to draw rectangle.
ur: مستطیل کھینچنے کے لیے کلک کریں اور گھسیٹیں۔
