Repository: junaidabduljabbar/arches7-internationalization
Catalog: translated_out.po
Languages: ur

source: The Arches site administrator
ur: آرچس سائٹ ایڈمنسٹریٹر

source: hasn't saved any searches yet.
ur: نے ابھی تک کوئی تلاش محفوظ نہیں کی ہے۔

source: Export Search Results
ur: تلاش کے نتائج برآمد کریں۔

source: 1. Format
ur: 1. فارمیٹ

source: Select the format you'd like for your export data. (tile excel and geojson formats require a resource type filter)
ur: وہ فارمیٹ منتخب کریں جو آپ اپنے برآمدی ڈیٹا کے لیے چاہتے ہیں۔ (ٹائل ایکسل اور جیوسن فارمیٹس کے لیے ریسورس ٹائپ فلٹر کی ضرورت ہوتی ہے)

source: shapefile
ur: شیپ فائل

source: tile excel
ur: ٹائل ایکسل

source: Copy to clipboard
ur: کلپ بورڈ پر کاپی کریں

source: 2. Coordinate Precision
ur: 2. درستگی کوآرڈینیٹ کریں۔

source: Tell us how many decimal places of precision you'd like for geo-data results
ur: ہمیں بتائیں کہ آپ جیو ڈیٹا کے نتائج کے لیے کتنے اعشاریہ درست جگہیں چاہیں گے۔

source: 3. Report Link
ur: 3. رپورٹ کا لنک

source: Only applicable to CSV and shapefile exports
ur: صرف CSV اور شکل فائل کی برآمدات پر لاگو ہوتا ہے۔

source: Include the report link in the export?
ur: رپورٹ کا لنک ایکسپورٹ میں شامل کریں؟

source: 4. Name this export
ur: 4. اس برآمد کو نام دیں۔

source: 5. Email Address
ur: 5. ای میل ایڈریس

source: This download may take some time. Tell us where to email a download link to your results
ur: اس ڈاؤن لوڈ میں کچھ وقت لگ سکتا ہے۔ ہمیں بتائیں کہ اپنے نتائج کا ڈاؤن لوڈ لنک کہاں ای میل کریں۔

source: Download
ur: ڈاؤن لوڈ

source: Resource Details
ur: ریسورس کی تفصیلات

source: Click the 'Details' link on a search result from the list on the left
ur: بائیں طرف کی فہرست سے تلاش کے نتائج پر 'تفصیلات' کے لنک پر کلک کریں۔

source: to view more information about a resource.
ur: وسائل کے بارے میں مزید معلومات دیکھنے کے لیے۔

source: Provisional
ur: عارضی

source: Details
ur: تفصیلات

source: Related Resources
ur: متعلقہ وسائل

source: Relate Resource
ur: وسائل سے متعلق

source: Cannot Be Related
ur: تعلق نہیں رکھا جا سکتا

source: Unsorted
ur: غیر ترتیب شدہ

source: Ascending
ur: صعودی

source: Descending
ur: نزول

source: Find a resource...
ur: ایک وسیلہ تلاش کریں...

source: Date Interval
ur: تاریخ کا وقفہ

source: Clear
ur: صاف

source: Type
ur: قسم

source: Search all dates
ur: تمام تاریخیں تلاش کریں۔

source: Within
ur: کے اندر

source: Custom date range
ur: حسب ضرورت تاریخ کی حد

source: Today
ur: آج

source: Last 7 days
ur: آخری 7 دن

source: Last 30 days
ur: آخری 30 دن

source: This week
ur: اس ہفتے

source: This month
ur: اس مہینے

source: This quarter
ur: اس سہ ماہی

source: This year
ur: اس سال

source: From
ur: سے

source: To
ur: تک

source: Time Wheel
ur: ٹائم وہیل

source: (Click on a block to set a filter, double-click to zoom in, double-click center to zoom out)
ur: (فلٹر سیٹ کرنے کے لیے بلاک پر کلک کریں، زوم ان کرنے کے لیے ڈبل کلک کریں، زوم آؤٹ کرنے کے لیے سینٹر پر ڈبل کلک کریں)

source: Loading time wheel...
ur: ٹائم وہیل لوڈ ہو رہا ہے...

source: None
ur: کوئی نہیں

source: No Date Entered
ur: کوئی تاریخ درج نہیں کی گئی۔

source: Minimum Date
ur: کم از کم تاریخ

source: Maximum Date
ur: زیادہ سے زیادہ تاریخ

source: View Mode
ur: موڈ دیکھیں

source: View Mode
ur: موڈ دیکھیں

source: EDTF Formats
ur: EDTF فارمیٹس

source: Extended Date/Time Formats (EDTF)
ur: توسیعی تاریخ/وقت فارمیٹس (EDTF)

source: The EDTF datatype allows you to describe dates (even uncertain dates). You can find a summary of the standard here:
ur: EDTF ڈیٹا ٹائپ آپ کو تاریخوں (یہاں تک کہ غیر یقینی تاریخیں بھی) بیان کرنے کی اجازت دیتا ہے۔ آپ کو معیار کا خلاصہ یہاں مل سکتا ہے:

source: EDTF Date Specfication (Library of Congress)
ur: EDTF تاریخ کی تفصیلات (لائبریری آف کانگریس)

source: Some common encodings:
ur: کچھ عام انکوڈنگز:

source: [year][“-”][month][“-”][day]
ur: [سال][“-”][مہینہ][“-”][دن]

source: Refers to the calendar date 2021 April 12th with day precision
ur: دن کی درستگی کے ساتھ کیلنڈر کی تاریخ 12 اپریل 2021 کا حوالہ دیتا ہے۔

source: [year][“-”][month]
ur: [سال] [“-”] [مہینہ]

source: Refers to the calendar month April 2021 with month precision
ur: مہینے کی درستگی کے ساتھ کیلنڈر مہینے اپریل 2021 کا حوالہ دیتا ہے۔

source: [year]
ur: [سال]

source: Refers to the year 2021 with year precision
ur: سال کی درستگی کے ساتھ سال 2021 کا حوالہ دیتا ہے۔

source: A time interval with calendar year precision, beginning sometime in 1964 and ending sometime in 2008
ur: کیلنڈر سال کی درستگی کے ساتھ وقت کا وقفہ، کسی وقت 1964 میں شروع ہوتا ہے اور کسی وقت 2008 میں ختم ہوتا ہے۔

source: A time interval with calendar month precision, beginning sometime in June 2004 and ending sometime in August of 2006
ur: کیلنڈر مہینے کی درستگی کے ساتھ وقت کا وقفہ، جون 2004 میں شروع ہوتا ہے اور اگست 2006 میں ختم ہوتا ہے۔

source: A time interval beginning sometime on February 1, 2004 and ending sometime in 2005. The start endpoint has calendar day precision and the end endpoint has calendar year precision.
ur: وقت کا وقفہ 1 فروری 2004 سے شروع ہوتا ہے اور 2005 میں کسی وقت ختم ہوتا ہے۔ آغاز کے اختتامی نقطہ میں کیلنڈر کے دن کی درستگی ہوتی ہے اور اختتامی نقطہ میں کیلنڈر سال کی درستگی ہوتی ہے۔

source: The year -100000. 'Y' may be used at the beginning of the date string to signify that the date is a year, when (and only when) the year exceeds four digits, i.e. for years later than 9999 or earlier than -9999.
ur: سال -100000۔ 'Y' تاریخ کے اسٹرنگ کے آغاز میں اس بات کی نشاندہی کرنے کے لیے استعمال کیا جا سکتا ہے کہ تاریخ ایک سال ہے، جب (اور صرف اس وقت) سال چار ہندسوں سے زیادہ ہو، یعنی 9999 کے بعد کے سالوں کے لیے یا -9999 سے پہلے کے لیے۔

source: Spring, 2001. The values 21, 22, 23, 24 may be used used to signify ' Spring', 'Summer', 'Autumn', 'Winter', respectively, in place of a month value (01 through 12) for a year-and-month format string
ur: بہار، 2001۔ قدریں 21، 22، 23، 24 بالترتیب 'بہار'، 'موسم گرما'، 'خزاں'، 'موسم سرما' کے لیے ایک ماہ کی قدر (01 سے 12) کی جگہ استعمال کی جا سکتی ہیں۔ سال اور مہینے کی شکل کی تار

source: Year uncertain (possibly the year 1984, but not definitely)
ur: سال غیر یقینی (ممکنہ طور پر سال 1984، لیکن یقینی طور پر نہیں)

source: Year-month approximate
ur: سال ماہ کا تخمینہ

source: Entire date (year-month-day) uncertain and approximate
ur: پوری تاریخ (سال مہینہ دن) غیر یقینی اور تخمینی

source: Upload Documents
ur: دستاویزات اپ لوڈ کریں

source: Drag & Drop your files onto this panel
ur: اپنی فائلوں کو اس پینل پر گھسیٹیں اور چھوڑیں۔

source: Adding documents to this record is
ur: اس ریکارڈ میں دستاویزات شامل کرنا ہے۔

source: You may upload as many documents as you wish, but the maximum size of any single file is
ur: آپ جتنے چاہیں دستاویزات اپ لوڈ کر سکتے ہیں، لیکن کسی ایک فائل کا زیادہ سے زیادہ سائز ہے۔

source: Allowed document formats:
ur: اجازت شدہ دستاویز کی شکلیں:

source: Uploaded Files
ur: اپ لوڈ کردہ فائلیں۔

source: find a file...
ur: فائل تلاش کریں...

source: file(s) uploaded
ur: فائل (فائلیں) اپ لوڈ کی گئیں۔

source: delete all files
ur: تمام فائلوں کو ڈیلیٹ کریں

source: add more files
ur: مزید فائلیں شامل کریں

source: error
ur: ایرر

source: Unsaved
ur: غیر محفوظ شدہ

source: Show first 5 files
ur: پہلی ۵ فائلیں دکھائیں

source: Show first 10 files
ur: پہلی ۱۰ فائلیں دکھائیں

source: Show first 25 files
ur: پہلی ۲۵ فائلیں دکھائیں

source: Show all files
ur: تمام فائلیں دکھائیں

source: Accepted File Types
ur: قبول شدہ فائل کی اقسام

source: example: .jpg, .png, .txt
ur: مثال: .jpg, .png, .txt

source: Max File Size (mb)
ur: زیادہ سے زیادہ فائل کا سائز (mb)

source: files uploaded
ur: فائلیں اپ لوڈ کیں۔

source: Default Manifest URL
ur: ڈیفالٹ مینی فیسٹ URL

source: annotation(s)
ur: تشریح

source: Available Geometry Types
ur: جیومیٹری کی دستیاب اقسام

source: Point
ur: نقطہ

source: Line
ur: لائن

source: Polygon
ur: کثیر الاضلاع

source: feature(s)
ur: خصوصیات)

source: Dropdown Format
ur: ڈراپ ڈاؤن فارمیٹ

source: Min
ur: کم سے کم

source: Max
ur: زیادہ سے زیادہ

source: Increment
ur: اضافہ

source: Increment size
ur: سائز میں اضافہ

source: Decimal Places
ur: اعشاریہ مقامات

source: Number of decimal places
ur: اعشاریہ مقامات کی تعداد

source: Prefix
ur: سابقہ

source: Field prefix
ur: فیلڈ کا سابقہ

source: Suffix
ur: لاحقہ

source: Field suffix
ur: قطعہ لاحقہ

source: Format
ur: فارمیٹ

source: (view valid formats)
ur: (درست فارمیٹس دیکھیں)

source: Disabled
ur: معذور

source: Disable Editing
ur: ترمیم کو غیر فعال کریں۔

source: Prevent users from editing value
ur: صارفین کو قدر میں ترمیم کرنے سے روکیں۔

source: filter...
ur: فلٹر...

source: Resource's relationship to
ur: وسائل کا تعلق

source: 's relationship to Resource
ur: کا وسائل سے تعلق

source: relationship(s)
ur: رشتہ

source: Related Resource Summary
ur: متعلقہ وسائل کا خلاصہ

source: Languages
ur: زبانیں

source: Language
ur: زبان

source: Direction
ur: سمت

source: rich text
ur: رچ ٹیکسٹ

source: Select default value
ur: ڈیفالٹ ویلیو منتخب کریں

source: Max Length
ur: زیادہ سے زیادہ طوالت

source: URL Placeholder
ur: URL پلیس ہولڈر

source: URL Label Placeholder
ur: URL لیبل پلیس ہولڈر

source: URL Link color
ur: URL لنک کا رنگ

source: Workflow Complete
ur: ورک فلو مکمل

source: Continue
ur: جاری رہے

source: Concept
ur: تصور

source: Delete this concept
ur: اس کانسپٹ کو ڈیلیٹ کریں

source: Delete this concept and all of it's sub concepts.
ur: اس تصور اور اس کے تمام ذیلی تصورات کو حذف کریں۔

source: Jump to this concept
ur: اس تصور پر جائیں

source: More Child Concept
ur: مزید بچے کا تصور

source: Search for a concept...
ur: ایک تصور تلاش کریں...

source: Recently Added Resources
ur: حال ہی میں شامل کردہ وسائل

source: Resource Id
ur: وسائل کی شناخت

source: Resource Name
ur: ریسورس کا نام

source: Edited
ur: ترمیم شدہ

source: Edit Type
ur: قسم میں ترمیم کریں۔

source: Editor
ur: ایڈیٹر

source: (Resource Deleted)
ur: ( ریسورس ڈیلیٹڈ )

source: View Report
ur: رپورٹ ملاحظہ کریں

source: Discard edits
ur: ترامیم کو مسترد کریں۔

source: Save edits
ur: ترامیم کو محفوظ کریں۔

source: Key of first node in card:
ur: کارڈ میں پہلے نوڈ کی کلید:

source: Value of first node in card
ur: کارڈ میں پہلے نوڈ کی ویلیو

source: Database Connection
ur: ڈیٹا بیس کنکشن

source: Put Card-Specific help text here. When panel is initiated from a controlled vocabulary, put thesaurus listing here instead.
ur: کارڈ کے لیے مخصوص مدد کا متن یہاں رکھیں۔ جب پینل کو کنٹرول شدہ الفاظ سے شروع کیا جاتا ہے، تو اس کے بجائے تھیسورس کی فہرست یہاں ڈالیں۔

source: You won't be able to undo this operation!
ur: آپ اس آپریشن کو کالعدم نہیں کر سکیں گے!

source: Are you sure you want to permanently delete this resource from Arches?
ur: کیا آپ واقعی اس وسائل کو آرچز سے مستقل طور پر حذف کرنا چاہتے ہیں؟

source: Edit History
ur: تاریخ میں ترمیم کریں۔

source: More
ur: مزید

source: Resource Record Created
ur: ریسورس ریکارڈ بن گیا

source: Record created by Arches with reference number
ur: حوالہ نمبر کے ساتھ آرچز کے ذریعہ بنایا گیا ریکارڈ

source: record updated
ur: ریکارڈ اپ ڈیٹ

source: Previous value:
ur: پچھلی ویلیو:

source: Updated value:
ur: اپ ڈیٹ ویلیو

source: record added
ur: ریکارڈ شامل کیا گیا۔

source: New value:
ur: نئی ویلیو

source: record deleted
ur: ریکارڈ ڈیلیٹڈ

source: Value:
ur: ویلیو:

source: Edited by:
ur: ترمیم شدہ:

source: LOAD MORE
ur: مزید لوڈ کریں

source: Graph Designer
ur: گراف ڈیزائنر

source: Branch
ur: شاخ

source: Find a Resource Model/Branch...
ur: ریسورس ماڈل/برانچ تلاش کریں...

source: Discard Card Edits
ur: کارڈ کی ترامیم کو مسترد کریں۔

source: Save Card Edits
ur: کارڈ کی ترامیم کو محفوظ کریں۔

source: Quit Designer
ur: ڈیزائنر چھوڑیں۔

source: Graph
ur: گراف

source: Cards
ur: کارڈز

source: Add a branch to your model from the library
ur: لائبریری سے اپنے ماڈل میں ایک برانچ شامل کریں۔

source: Card Designer
ur: کارڈ ڈیزائنر

source: Graphs
ur: گرافس

source: New Resource Model
ur: نیا ریسورس ماڈل

source: Import Branch/Resource Model
ur: برانچ/وسائل ماڈل درآمد کریں۔

source: Active
ur: فعال

source: Inactive
ur: غیر فعال

source: Card Container
ur: کارڈ کنٹینر

source: Card
ur: کارڈ

source: Widget
ur: ویجیٹ

source: Discard
ur: رد کر دیں

source: Function Manager
ur: فنکشن مینیجر

source: Selected Functions
ur: منتخب کردہ افعال

source: You haven't added any functions yet.
ur: آپ نے ابھی تک کوئی فنکشن شامل نہیں کیا ہے۔

source: Select functions from the library to add new capabilities to your resource.
ur: اپنے وسائل میں نئی ​​صلاحیتیں شامل کرنے کے لیے لائبریری سے فنکشنز منتخب کریں۔

source: Close Function Library
ur: فنکشن لائبریری بند کریں۔

source: Show Function Library
ur: فنکشن لائبریری دکھائیں۔

source: Library filter goes here
ur: لائبریری فلٹر یہاں جاتا ہے۔

source: Function Library
ur: فنکشن لائبریری

source: Function Name
ur: فنکشن کا نام

source: This Function doesn't require any configuration.
ur: اس فنکشن کو کسی ترتیب کی ضرورت نہیں ہے۔

source: Function Description
ur: فنکشن کی تفصیل

source: Select Function
ur: فنکشن کو منتخب کریں۔

source: Graph Manager
ur: گراف مینیجر

source: Because of ontology rules, there are no branches that can be appended.
ur: آنٹولوجی کے اصولوں کی وجہ سے، ایسی کوئی شاخیں نہیں ہیں جن کو جوڑا جا سکے۔

source: Choose a card component...
ur: کارڈ کا ایک جزو منتخب کریں...

source: Card name
ur: کارڈ کا نام

source: CSS Classes (Optional)
ur: CSS کلاسز (اختیاری)

source: Show this card by default
ur: یہ کارڈ بطور ڈیفالٹ دکھائیں۔

source: Allow multiple values
ur: متعدد ویلیوز کی اجازت دیں

source: Let users enter multiple values for this data entry card
ur: صارفین کو اس ڈیٹا انٹری کارڈ کے لیے متعدد اقدار درج کرنے دیں۔

source: Enable Card-level help
ur: کارڈ کی سطح کی مدد کو فعال کریں۔

source: Provide specific user guidance for this card
ur: اس کارڈ کے لیے صارف کی مخصوص رہنمائی فراہم کریں۔

source: Help Panel Title
ur: مدد پینل کا عنوان

source: Help title
ur: مدد کا عنوان

source: Content
ur: مواد

source: Unique Values
ur: منفرد ویلیوز

source: Select Nodes
ur: نوڈس کو منتخب کریں۔

source: Find a card...
ur: کارڈ تلاش کریں...

source: Expand
ur: پھیلائیں

source: Collapse
ur: گرنے

source: Select All
ur: تمام منتخب کریں

source: Clear All
ur: تمام کو صاف کریں

source: Show IDs
ur: آئی ڈیز دکھائیں

source: Hide IDs
ur: آئی ڈیز چھپائیں۔

source: (edit report)
ur: (رپورٹ میں ترمیم کریں)

source: Resource Model Identifiers
ur: ریسورس ماڈل شناخت کنندگان

source: Branch Identifiers
ur: برانچ شناخت کنندگان

source: No ontology
ur: کوئی آنٹولوجی نہیں۔

source: Choose a data type
ur: ڈیٹا کی قسم کا انتخاب کریں

source: Make card
ur: کارڈ بنائیں

source: Data from nodes not collected in other cards will be collected in the root card's form section
ur: دوسرے کارڈز میں جمع نہ ہونے والے نوڈس کا ڈیٹا روٹ کارڈ کے فارم سیکشن میں جمع کیا جائے گا۔

source: Resource models that may be related:
ur: وسائل کے ماڈل جو متعلقہ ہو سکتے ہیں:

source: Author name
ur: مصنف کا نام

source: Abstract/description
ur: خلاصہ/تفصیل

source: URI to a JSON-LD Context Object or a Raw Context Object or Array of Context Objects
ur: JSON-LD سیاق و سباق آبجیکٹ یا خام سیاق و سباق آبجیکٹ یا سیاق و سباق کی اشیاء کی صف سے URI

source: URI Slug for API Access
ur: API رسائی کے لیے URI سلگ

source: Slug
ur: سلگ

source: Map Feature Color
ur: نقشہ کی خصوصیت کا رنگ

source: Selected icon:
ur: منتخب کردہ آئیکن:

source: Find a node, datatype, card...
ur: ایک نوڈ، ڈیٹا ٹائپ، کارڈ تلاش کریں...

source: Node is exportable in search
ur: نوڈ تلاش میں قابل برآمد ہے۔

source: Add Child Node
ur: چائلڈ نوڈ شامل کریں

source: Add Branch
ur: برانچ شامل کریں۔

source: Delete Node
ur: نوڈ کو ڈیلیٹ کریں

source: Groups/Accounts
ur: گروپس/اکاؤنٹس

source: Unnamed node
ur: بے نام نوڈ

source: Enter node name here...
ur: یہاں نوڈ کا نام درج کریں...

source: node name
ur: نوڈ کا نام

source: Relationship to
ur: سے رشتہ

source: parent
ur: والدین

source: Choose a property
ur: ایک پراپرٹی کا انتخاب کریں۔

source: Choose a class
ur: ایک کلاس کا انتخاب کریں۔

source: Semantics
ur: سیمنٹکس

source: description
ur: تفصیل

source: Node Data Type and Configuration
ur: نوڈ ڈیٹا کی قسم اور کنفیگریشن

source: Node Settings
ur: نوڈ سیٹنگز

source: Activate to use this node in Advanced Search.
ur: اس نوڈ کو ایڈوانسڈ سرچ میں استعمال کرنے کے لیے ایکٹیویٹ کریں۔

source: Activate to require that data be collected for this node when a card value is edited
ur: کارڈ کی قدر میں ترمیم کرنے پر اس نوڈ کے لیے ڈیٹا اکٹھا کرنے کی ضرورت کے لیے فعال کریں۔

source: Export via Search Results
ur: تلاش کے نتائج کے ذریعے برآمد کریں۔

source: Provide a field name for shapefiles.
ur: شکل فائلوں کے لیے فیلڈ کا نام فراہم کریں۔

source: Limited to 10 characters to meet shapefile requirements.
ur: شکل فائل کی ضروریات کو پورا کرنے کے لیے 10 حروف تک محدود۔

source: shapefile fieldname
ur: شکل فائل فیلڈ کا نام

source: Data from this node and downstream nodes will be collected in a single form section
ur: اس نوڈ اور ڈاؤن اسٹریم نوڈس سے ڈیٹا ایک ہی فارم سیکشن میں اکٹھا کیا جائے گا۔

source: To set permissions:
ur: اجازتیں ترتیب دینے کے لیے:

source: <strong> 1. Select one or more cards </strong>from the card tree.
ur: <strong> 1. کارڈ ٹری سے ایک یا زیادہ کارڈز </strong>منتخب کریں۔

source: <strong> 2. Select a Group or User Account </strong>from the dropdown below.
ur: <strong> 2. نیچے ڈراپ ڈاؤن سے ایک گروپ یا صارف اکاؤنٹ </strong> منتخب کریں۔

source: <strong> 3. Apply Permissions </strong>to set your changes. You'll see your selections reflected by the icons in the card tree.
ur: <strong> 3. اپنی تبدیلیاں ترتیب دینے کے لیے اجازتوں کا اطلاق کریں </strong>۔ آپ اپنے انتخاب کو کارڈ ٹری میں موجود شبیہیں سے جھلکتے ہوئے دیکھیں گے۔

source: Set permissions for:
ur: اس کے لیے اجازتیں سیٹ کریں:

source: Select a Group/Account...
ur: ایک گروپ/اکاؤنٹ منتخب کریں...

source: Accounts
ur: اکاؤنٹس

source: Revert Permissions
ur: اجازتیں واپس کریں۔

source: Apply Permissions
ur: اجازتوں کا اطلاق کریں۔

source: Selected Cards
ur: منتخب کردہ کارڈز

source: No cards selected
ur: کوئی کارڈ منتخب نہیں کیا گیا۔

source: Widget Manager
ur: ویجیٹ مینیجر

source: Visibility
ur: مرئیت

source: Make Widget Visible
ur: ویجیٹ کو مرئی بنائیں

source: Show this widget by default
ur: اس ویجیٹ کو بطور ڈیفالٹ دکھائیں۔

source: Resource Model Settings
ur: ریسورس ماڈل سیٹنگز

source: Branch Settings
ur: برانچ سیٹنگز

source: Icons
ur: شبیہیں

source: Set the defaults for your resource model
ur: اپنے وسائل کے ماڈل کے لیے ڈیفالٹس سیٹ کریں۔

source: Set the defaults for your branch
ur: اپنی برانچ کے لیے ڈیفالٹس سیٹ کریں۔

source: Show Vocabulary
ur: ذخیرہ الفاظ دکھائیں۔

source: Pick an icon for your resource model
ur: اپنے وسائل کے ماڈل کے لیے ایک آئیکن چنیں۔

source: Pick an icon for your branch
ur: اپنی برانچ کے لیے ایک آئیکن چنیں۔

source: Define this resource's color when displayed in the search results chart
ur: تلاش کے نتائج کے چارٹ میں ظاہر ہونے پر اس وسائل کے رنگ کی وضاحت کریں۔

source: Define this resource model's status
ur: اس وسائل کے ماڈل کی حیثیت کی وضاحت کریں۔

source: Define this branch's status
ur: اس شاخ کی حیثیت کی وضاحت کریں۔

source: Describe this resource model
ur: اس وسائل کے ماڈل کی وضاحت کریں۔

source: Describe this branch
ur: اس شاخ کی وضاحت کریں۔

source: JSON-LD Context URI
ur: JSON-LD سیاق و سباق URI

source: Overlay
ur: چڑھانا

source: No overlays available
ur: کوئی اوورلیز دستیاب نہیں ہیں۔

source: Delete Layer
ur: پرت کو حذف کریں۔

source: Add to map by default:
ur: بطور ڈیفالٹ نقشے میں شامل کریں:

source: Default basemap:
ur: ڈیفالٹ بیس میپ:

source: Only show on search map:
ur: صرف تلاش کے نقشے پر دکھائیں:

source: Unnamed
ur: بے نام

source: Project Requirements: Complete
ur: پروجیکٹ کے تقاضے: مکمل

source: Project Status: Active
ur: پروجیکٹ کی حیثیت: فعال

source: Project Status: Inactive
ur: پروجیکٹ کی حیثیت: غیر فعال

source: This project is ready, and only requires <br> you to activate it to allow your field team to collect data.
ur: یہ پروجیکٹ تیار ہے، اور صرف <br> کی ضرورت ہے کہ آپ اپنی فیلڈ ٹیم کو ڈیٹا اکٹھا کرنے کی اجازت دینے کے لیے اسے فعال کریں۔

source: This project is now active! Mobile app users can download this project and begin <br> collecting and editing data using their mobile device.
ur: یہ منصوبہ اب فعال ہے! موبائل ایپ کے صارفین اس پروجیکٹ کو ڈاؤن لوڈ کر سکتے ہیں اور اپنے موبائل ڈیوائس کا استعمال کرتے ہوئے ڈیٹا اکٹھا کرنا اور اس میں ترمیم کرنا شروع کر سکتے ہیں۔

source: You are activating this project. Confirm your settings before you save: you won't be able <br> to change the models, cards, or groups after you save your project
ur: آپ اس پروجیکٹ کو چالو کر رہے ہیں۔ محفوظ کرنے سے پہلے اپنی ترتیبات کی تصدیق کریں: آپ اپنے پروجیکٹ کو محفوظ کرنے کے بعد ماڈلز، کارڈز، یا گروپس کو تبدیل کرنے کے قابل نہیں ہوں گے۔

source: You are deactivating this project. Users will be unable to download this project.
ur: آپ اس پروجیکٹ کو غیر فعال کر رہے ہیں۔ صارفین اس پروجیکٹ کو ڈاؤن لوڈ نہیں کر سکیں گے۔

source: Save to commit your changes
ur: اپنی تبدیلیاں کرنے کے لیے محفوظ کریں۔

source: Project Requirements: Incomplete
ur: پروجیکٹ کے تقاضے: نامکمل

source: Incomplete projects cannot be active.
ur: نامکمل منصوبوں کو فعال نہیں کیا جا سکتا۔

source: By saving an incomplete project it will be deactivated.
ur: ایک نامکمل پروجیکٹ کو محفوظ کرنے سے اسے غیر فعال کردیا جائے گا۔

source: You must complete the following before saving this project as active:
ur: اس پروجیکٹ کو فعال کے طور پر محفوظ کرنے سے پہلے آپ کو درج ذیل کو مکمل کرنا ہوگا۔

source: You won’t be able to activate this project until you have addressed the following items:
ur: آپ اس پروجیکٹ کو اس وقت تک فعال نہیں کر سکیں گے جب تک کہ آپ درج ذیل آئٹمز پر توجہ نہیں دیتے:

source: Select the Model(s) and associated data entry cards to include in the project
ur: پروجیکٹ میں شامل کرنے کے لیے ماڈل اور متعلقہ ڈیٹا انٹری کارڈز کو منتخب کریں۔

source: Select the People that you want to invite to the project
ur: ان لوگوں کو منتخب کریں جنہیں آپ پروجیکٹ میں مدعو کرنا چاہتے ہیں۔

source: Define the start and end dates of your project
ur: اپنے پروجیکٹ کے آغاز اور اختتامی تاریخوں کی وضاحت کریں۔

source: Define either an online or offline basemap source
ur: آن لائن یا آف لائن بیس میپ کے ذریعہ کی وضاحت کریں۔

source: Define a map extent
ur: نقشہ کی حد کی وضاحت کریں۔

source: End date must be after the current date
ur: آخری تاریخ موجودہ تاریخ کے بعد ہونی چاہیے۔

source: Activate Project
ur: پروجیکٹ کو چالو کریں۔

source: By activating the project you will send users an email with the information needed to begin data editing activitites.
ur: پروجیکٹ کو فعال کرنے سے آپ صارفین کو ڈیٹا ایڈیٹنگ کی سرگرمیاں شروع کرنے کے لیے درکار معلومات کے ساتھ ایک ای میل بھیجیں گے۔

source: Project Status Summary
ur: پروجیکٹ کی حیثیت کا خلاصہ

source: Not synced
ur: مطابقت پذیر نہیں ہے۔

source: Last Sync
ur: آخری مطابقت پذیری

source: Resources Edited
ur: وسائل میں ترمیم کی گئی۔

source: Editors
ur: ایڈیٹرز

source: Groups/Users
ur: گروپس/صارفین

source: Data download
ur: ڈیٹا ڈاؤن لوڈ

source: No data selected for download
ur: ڈاؤن لوڈ کے لیے کوئی ڈیٹا منتخب نہیں کیا گیا۔

source: Limit:
ur: حد:

source: Resource Types:
ur: وسائل کی اقسام:

source: Models and Data Entry Cards
ur: ماڈلز اور ڈیٹا انٹری کارڈز

source: No cards added
ur: کوئی کارڈ شامل نہیں کیا گیا۔

source: No models selected
ur: کوئی ماڈل منتخب نہیں کیا گیا۔

source: Project name
ur: پراجیکٹ کا نام

source: Pick a concise name that makes it easy for people to find your project
ur: ایک مختصر نام منتخب کریں جو لوگوں کے لیے آپ کے پروجیکٹ کو تلاش کرنا آسان بنا دے۔

source: Project start date
ur: پروجیکٹ شروع ہونے کی تاریخ

source: The project start and end dates are used to limit when people can add or edit data to your project. Use these dates to enfore the beginning and end of your field data collection effort
ur: پروجیکٹ کے آغاز اور اختتامی تاریخوں کا استعمال اس بات کو محدود کرنے کے لیے کیا جاتا ہے کہ لوگ کب آپ کے پروجیکٹ میں ڈیٹا شامل یا ترمیم کرسکتے ہیں۔ اپنی فیلڈ ڈیٹا اکٹھا کرنے کی کوشش کے آغاز اور اختتام کو پیش کرنے کے لیے ان تاریخوں کا استعمال کریں۔

source: Project end date
ur: پروجیکٹ کی آخری تاریخ

source: Project extent
ur: پروجیکٹ کی حد

source: Basemap location (MBTiles file url)
ur: بیس میپ لوکیشن (MBTiles فائل url)
