Repository: junaidabduljabbar/arches7-internationalization
Catalog: translated_out.po
Languages: ur

source: {0} error, {1} {2} - {3}. Unable to save.
ur: {0} ایرر، {1} {2} - {3}۔ محفوظ نہیں کر سکتے۔

source: Multiple provisional edits. Returning first edit
ur: متعدد عارضی ترامیم ۔ پہلی ترمیم میں واپسی

source: Tile has no authoritative or provisional data
ur: ٹائل میں کوئی مستند یا عارضی ڈیٹا نہیں ہے

source: The widget used to save this data appears to be incorrect for this datatype. Contact system admin to resolve
ur: اس ڈیٹا کو محفوظ کرنے کے لیے استعمال ہونے والا ویجیٹ اس ڈیٹا ٹائپ کے لیے غلط معلوم ہوتا ہے۔ حل کرنے کے لیے سسٹم ایڈمن سے رابطہ کریں۔

source: This is an invalid concept prefLabel, or an incomplete UUID
ur: یہ ایک غلط کانسپٹ پریف۔لیبل ہے، یا ایک نامکمل یو یو آئی ڈی ہے

source: This UUID is not an available concept value
ur: یہ یو یو آئی ڈی دستیاب کانسپٹ کی ویلیو نہیں ہے

source: This is not a string
ur: یہ سٹرنگ نہیں ہے

source: Not a properly formatted number
ur: صحیح طریقے سے فارمیٹ شدہ نمبر نہیں ہے

source: Not of type boolean
ur: بولین قسم کا نہیں

source: Incorrect format. Confirm format is in settings.DATE_FORMATS or set the format in settings.DATE_IMPORT_EXPORT_FORMAT.
ur: غلط فارمیٹ، فارمیٹ کی settings.DATE_FORMATS میں تصدیق کریں یا فارمیٹ کو settings.DATE_IMPORT_EXPORT_FORMAT میں سیٹ کریں۔

source: {value} is an invalid date format
ur: {value} تاریخ کا غلط فارمیٹ ہے

source: Incorrect Extended Date Time Format. See http://www.loc.gov/standards/datetime/ for supported formats.
ur: ایکسٹینڈڈ تاریخ وقت فارمیٹ غلط ہے۔ معاونت پذیر فارمیٹس کے لیے http://www.loc.gov/standards/datetime/ دیکھیں۔

source: Only dates that specify an exact year, month, and day can be used with the "=" operator
ur: "=" آپریٹر کے ساتھ صرف وہی تاریخیں استعمال کی جا سکتی ہیں جو یقینی سال، مہینے اور دن کی وضاحت کرتی ہیں۔

source: Only dates that specify an exact year, month, and day can be used with the ">", "<", ">=", and "<=" operators
ur: ">"، "<" ">="، اور "<=" آپریٹرز کے ساتھ صرف وہی تاریخیں جو یقینی سال، مہینہ اور دن بتاتی ہیں استعمال کی جا سکتی ہیں

source: Invalid date specified.
ur: غلط تاریخ درج کی گئی

source: Unable to serialize some geometry features
ur: کچھ جیومیٹریز کو سیریلائز کرنے سے قاصر

source: This node has a limit of {0} files. Please reduce files.
ur: اس نوڈ میں {0} فائلوں کی حد ہے۔ براہ کرم فائلیں کم کریں۔

source: This node has a file-size limit of {0}. Please reduce file size or contact your sysadmin.
ur: اس نوڈ کی فائل سائز کی حد {0} ہے۔ براہ کرم فائل کا سائز کم کریں یا اپنے سسٹم ایڈمن سے رابطہ کریں۔

source: datatype: {0}, value: {1} - {2} .
ur: ڈیٹا ٹائپ : {0}، ویلیو : {1} - {2}۔

source: File does not exist
ur: فائل موجود نہیں ہے

source: The file url is invalid
ur: فائل کا یو آر ایل غلط ہے

source: A file is not available for this tile
ur: اس ٹائل کے لیے فائل موجود نہیں ہے

source: This file's fileid is not a valid UUID
ur: اس فائل کی فائل آئی ڈی درست UUID نہیں ہے

source: Invalid domain id. Please check the node this value is mapped to for a list of valid domain ids.
ur: ڈومین کی غلط آئی ڈی۔ براہ کرم درست ڈومین آئی ڈیز کی فہرست کے لیے اُس نوڈ کی پڑتال کریں جس سے یہ ویلیو میپ کردہ ہے۔

source: The related resource with id '{0}' is not in the system.
ur: '{0}' آئی ڈی کے ساتھ متعلقہ ریسورس سسٹم میں نہیں ہے

source: Undefined
ur: غیر متعینہ

source: Only include values for include or exclude, but not both
ur: صرف شامل یا خارج کرنے کی ویلیوز شامل کریں، لیکن دونوں نہیں۔

source: Invalid subconcept definition: %s
ur: سب-کانسپٹ کی تعریف غلط ہے:%s

source: Invalid related concept definition: %s
ur: متعلقہ کانسپٹ کی تعریف غلط ہے:%s

source: Invalid value definition: %s
ur: ویلیو کی تعریف غلط ہے : %s

source: Need to include values when creating a collection
ur: کلیکشن بناتے وقت ویلیوز کو شامل کرنے کی ضرورت ہے۔

source: Index of label failed. Index type (scheme id) could not be derived from the label.
ur: لیبل کا انڈیکس ناکام ہو گیا۔ انڈیکس کی قسم (اسکیم آئی ڈی) لیبل سے ماخوز نہیں کی جا سکتی۔

source: A I18n_TextField object
ur: ایک I18n_TextField آبجیکٹ

source: A I18n_JSONField object
ur: ایک I18n_JSONField آبجیکٹ

source: New Node
ur: نیا نوڈ

source: Top Node
ur: ٹاپ نوڈ

source: Your resource model: {0}, already has instances saved. You cannot delete a Resource Model with instances.
ur: آپ کے ریسورس ماڈل : {0}، میں پہلے سے ہی انسٹانسز محفوظ ہیں۔ جس ریسورس ماڈل میں انسٹانسز محفوظ ہوں , ایسے ریسورس ماڈل کو ڈیلیٹ نہیں کرسکتے ہیں۔

source: Your resource model: {0}, already has instances saved. You cannot modify a Resource Model with instances.
ur: آپ کے ریسورس ماڈل : {0}، میں پہلے سے ہی انسٹانسز محفوظ ہیں۔ جس ریسورس ماڈل میں انسٹانسز محفوظ ہوں , ایسے ریسورس ماڈل میں ترمیم نہیں کرسکتے ہیں۔

source: Ontology rules don't allow this node to be appended
ur: آنٹولوجی کے اصول اس نوڈ کو شامل کرنے کی اجازت نہیں دیتے ہیں

source: Your resource model: {self.name}, already has instances saved. You cannot delete nodes from a Resource Model with instances.
ur: آپ کے ریسورس ماڈل : {self.name}، میں پہلے سے ہی انسٹانسز محفوظ ہیں۔ جس ریسورس ماڈل میں انسٹانسز محفوظ ہوں , ایسے ریسورس ماڈل سے نوڈز کو ڈیلیٹ نہیں کرسکتے ہیں۔

source: The graph you wish to append needs to define an ontology
ur: جس گراف پر آپ کام کرنا چاہتے ہیں اسے ایک آنٹولوجی کی وضاحت کرنے کی ضرورت ہے۔

source: Ontology rules don't allow this graph to be appended
ur: آنٹولوجی کے اصول اس گراف کو شامل کرنے کی اجازت نہیں دیتے ہیں

source: Your resource model: {self.name}, already has instances saved. You cannot modify a Resource Model with instances.
ur: آپ کے ریسورس ماڈل : {self.name}، میں پہلے سے ہی انسٹانسز محفوظ ہیں۔ جس ریسورس ماڈل میں انسٹانسز محفوظ ہوں , ایسے ریسورس ماڈل میں ترمیم نہیں کرسکتے ہیں۔

source: Duplicate node name: "{0}". All node names in a card must be unique.
ur: ڈپلیکیٹ نوڈ کا نام: "{0}"۔ کارڈ میں تمام نوڈ کے نام منفرد ہونے چاہئیں۔

source: Duplicate node name: "{0}". All sibling node names must be unique.
ur: ڈپلیکیٹ نوڈ کا نام: "{0}"۔ تمام سبلنگ نوڈز کے نام منفرد ہونے چاہئیں۔

source: The top node of your resource graph: {self.root.name} needs to be a collector. Hint: check that nodegroup_id of your resource node(s) are not null.
ur: آپ کے ریسورس گراف کی ٹاپ نوڈ: {self.root.name} کے لیے کلیکٹر ہونے کا تقاضہ ہے۔ اشارہ: پڑتال کریں کہ آپ کی ریسورس نوڈ(ز) کی nodegroup_id تو خالی نہیں ہیں۔

source: The top node of your resource graph must have a datatype of 'semantic'.
ur: آپ کے ریسورس گراف کا ٹاپ نوڈ سیمنٹک ڈیٹا ٹائپ کا ہونا ضروری ہے۔

source: If your graph contains more than one node and is not a resource the root must be a collector.
ur: اگر آپ کے گراف میں ایک سے زیادہ نوڈ ہیں اور وہ ریسورس نہیں ہے تو روٹ کو کلیکٹر ہونا چاہیے۔

source: Field name must not be blank.
ur: فیلڈ کا نام خالی نہیں ہونا چاہیے

source: Field name must contain only alpha-numeric characters or underscores.
ur: فیلڈ کا نام صرف الفا-نومیرک حروف یا انڈر سکور پر مشتمل ہونا چاہیے

source: Field name cannot begin with an underscore or number
ur: فیلڈ کا نام انڈر سکور یا نمبر سے شروع نہیں ہو سکتا

source: Field name must be unique to the graph; '{fieldname}' already exists.
ur: گراف کے لیے فیلڈ کا نام منفرد ہونا چاہیے ; '{fieldname}' پہلے سے موجود ہے

source: A valid {0} ontology class must be selected
ur: درست {0} آنٹولوجی کلاس کا انتخاب کرنا ضروری ہے

source: '{0}' is not a valid {1} ontology class
ur: '{0}' درست نہیں ہے {1} آنٹولوجی کلاس

source: You must specify an ontology property. Your graph isn't semantically valid. Entity domain '{edge.domainnode.ontologyclass}' and Entity range '{edge.rangenode.ontologyclass}' can not be related via Property '{edge.ontologyproperty}'.
ur: آپ کو لازماً ایک آنٹولوجی پراپرٹی واضح کرنی ہو گی۔ آپ کا گراف سیمینٹکلی درست نہیں ہے۔ اینٹٹی ڈومین '{edge.domainnode.ontologyclass}' اور اینٹٹی رینج '{edge.rangenode.ontologyclass}' پراپرٹی کے ذریعے رلیٹڈ نہیں ہو سکتیں '{edge.ontologyproperty}'۔

source: Your graph isn't semantically valid. Entity domain '{edge.domainnode.ontologyclass}' and Entity range '{edge.rangenode.ontologyclass}' cannot be related via Property '{edge.ontologyproperty}'.
ur: آپ کا گرام سیمینٹکلی درست نہیں ہے۔ اینٹٹی ڈومین '{edge.domainnode.ontologyclass}' اور اینٹٹی رینج '{edge.rangenode.ontologyclass}' پراپرٹی کے ذریعے رلیٹڈ نہیں ہو سکتیں '{edge.ontologyproperty}'۔

source: '{0}' is not found in the {1} ontology or is not a valid ontology property for Entity domain '{2}'.
ur: {1} اینٹولوجی میں '{0}' نہیں ملا یا اینٹٹی ڈومین '{2}' کے لیے انیٹولوجی پراپرٹی درست نہیں ہے۔

source: You have assigned ontology classes to your graph nodes but not assigned an ontology to your graph.
ur: آپ نے اپنے گراف نوڈز کو اینٹولوجی کلاسز تفویض کر دی ہیں لیکن اپنے گراف کو اینٹولوجی تفویض نہیں کی۔

source: The json-ld context you supplied wasn't formatted correctly.
ur: آپ کا فراہم کردہ json-ld کانٹیکسٹ درست طریقے سے فارمیٹ نہیں کیا گیا تھا۔

source: Another resource modal already uses the slug '{self.slug}'
ur: ایک اور ریسورس ماڈل پہلے ہی سلگ '{self.slug}' استعمال کرتا ہے

source: Graph Validation Error
ur: گراف ویلیڈیشن ایرر

source: Could not delete database in CouchDB
ur: CouchDB میں ڈیٹا بیس کو ڈیلیٹ نہیں کیا جا سکا

source: Celery appears not to be running, you need to have celery running in order to sync from Arches Collector.
ur: سیلیری چلتی ہوئی نظر نہیں آ رہی، آپ کو آرچز کلیکٹر سے سنک کرنے کے لیے سیلیری کو چلانا ہو گا۔

source: Sync Completed
ur: سنک مکمل

source: Pushing Edits to Arches
ur: ترامیم کو آرچز میں دھکیلیں

source: Only resource models may be edited - branches are not editable
ur: صرف ریسورس ماڈلز میں ترمیم کی جا سکتی ہے - برانچز میں ترمیم کی جا سکتی

source: This Model is Inactive and not available for editing
ur: یہ ماڈل ایکٹِو نہیں ہے اور ترمیم کے لیے دستیاب نہیں ہے

source: This model is not yet active; unable to save.
ur: یہ ماڈل ابھی تک ایکٹِو نہیں ہے۔ محفوظ نہیں کر سکتے۔

source: This model is not yet active; unable to delete.
ur: یہ ماڈل ابھی تک ایکٹِو نہیں ہے۔ ڈیلیٹ نہیں کر سکتے۔

source: Model Inactive Error
ur: ماڈل اِن ایکٹِو ایرر

source: Unable to save a tile to a card with cardinality 1 where a tile has previously been saved.
ur: کارڈینیلیٹی 1 والے کارڈ میں ٹائل کو محفوظ نہیں کر سکتے ہے جہاں ایک ٹائل پہلے سے محفوظ کی گئی ہے۔

source: Details: card: {0}, graph: {1}, resource: {2}, tile: {3}, nodegroup: {4}
ur: تفصیلات: کارڈ: {0}، گراف: {1}، ریسورس: {2}، ٹائل: {3}، نوڈ گروپ: {4}

source: This card violates a unique constraint. The following value is already saved:
ur: یہ کارڈ ایک انوکھی پابندی کی خلاف ورزی کرتا ہے۔ درج ذیل ویلیو پہلے ہی محفوظ ہے:

source: Error checking for missing node. Nodeid: {nodeid} with value: {value}, not in nodes. You may have a node in your business data that no longer exists in any graphs.
ur: غائب نوڈ کے لیے ایرر کی پڑتال کرنا۔ Nodeid: {nodeid} ویلیو کے ساتھ: {value}، نوڈز میں موجود نہیں۔ آپ کے بزنس ڈیٹا میں نوڈ موجود ہو سکتی ہے جو کہ مزید کسی گرافس میں موجود نہیں ہے۔

source: This card requires values for the following:
ur: اس کارڈ کو درج ذیل ویلیوز کی ضرورت ہے:

source: No associated functions or other TypeError raised by a function
ur: فنکشن کی جانب سے کوئی وابستہ فنکشنز یا دیگر TypeError نہیں بتائی گئیں

source: Tile Validation Error
ur: ٹائل ویلیڈیشن ایرر

source: Tile Cardinaltiy Error
ur: ٹائل کارڈِنلٹی ایرر

source: Search Index Error:
ur: سرچ انڈیکس ایرر:

source: Search Index Not Defined Error:
ur: سرچ انڈیکس کی وضاحت نہیں کی گئی ایرر:

source: The index "%s" is not defined in settings.ELASTICSEARCH_CUSTOM_INDEXES
ur: انڈیکس "%s" settings.ELASTICSEARCH_CUSTOM_INDEXES میں واضح نہیں ہے

source: Feature geometry is not defined
ur: فیچر جیومیٹری کی وضاحت نہیں کی گئی ہے۔

source: You need at least one of the following operators in a Range expression: gte, gt, lte, or lt
ur: آپ کو رینج ایکسپریشن میں مندرجہ ذیل آپریٹرز میں سے کم سے کم ایک کی ضرورت ہے: gte، gt، lte، یا lt

source: You can only use one of either: gte or gt
ur: آپ دونوں میں سے صرف ایک استعمال کر سکتے ہیں: gte یا gt

source: You can only use one of either: lte or lt
ur: آپ دونوں میں سے صرف ایک استعمال کر سکتے ہیں: lte یا lt

source: You need to specify either a "field" or a "script"
ur: آپ کو یا تو "فیلڈ" یا "اسکرپٹ" کی وضاحت کرنے کی ضرورت ہے

source: You need to specify a name for your aggregation
ur: آپ کو اپنے مجموعے کے لیے ایک نام واضح کرنا ہو گا

source: You need to specify an aggregation type
ur: آپ کو مجموعے کی قسم واضح کرنی ہو گی

source: You need to specify a path for your nested aggregation
ur: آپ کو اپنے نیسٹڈ مجموعے کا راستہ واضح کرنا ہو گا

source: Shapefile are fieldnames required for the following nodes: {0}
ur: شیپ فائل فیلڈ کے نام ہیں جو کہ مندرجہ نوڈز کے لیے درکار ہیں: {0}

source: files_deleted
ur: فائلز ڈیلیٹڈ

source: Your search {} is ready for download. You have 24 hours to access this file, after which we'll automatically remove it.
ur: آپ کی تلاش {} ڈاؤن لوڈ کے لیے تیار ہے۔ آپ کے پاس اس فائل تک رسائی کے لیے چوبیس گھنٹے ہیں، جس کے بعد ہم اسے خودکار طور پر ہٹا دیں گے۔

source: Hello, Your request to download a set of search results is now ready.
ur: ہیلو، آپ کی درخواست کے مطابق سرچ کے نتائج کا ایک سیٹ ڈاؤن لوڈ کرنے کے لیے اب تیار ہے۔

source: Download Now
ur: ڈاونلوڈ ناؤ

source: Thank you
ur: شکریہ

source: Resources have completed loading.
ur: ریسورسز لوڈنگ مکمل ہوگئی ہے

source: Hello, Your package has successfully loaded into your Arches project.
ur: ہیلو، آپ کا پیکیج کامیابی سے آپ کے آرچز پروجیکٹ میں لوڈ ہو گیا ہے۔

source: Log me in
ur: مجھے لاگ ان کریں

source: Cancel
ur: کینسل

source: OK
ur: اوکے

source: Manage
ur: مینیج

source: Login
ur: لاگ ان

source: Welcome
ur: خوش آمدید

source: Notifications
ur: نوٹیفیکیشنز

source: Search
ur: سرچ

source: My Recent Edits
ur: میری حالیہ ترامیم

source: Edit Resource
ur: ایڈٹ ریسورس

source: Print
ur: پرنٹ

source: Help
ur: مدد

source: Close
ur: بند کریں

source: My Edit History
ur: میری ترمیم کی تاریخ

source: Close Help
ur: مدد بند کریں

source: for more documentation, visit
ur: مزید دستاویزات کے لیے ملاحظہ کریں

source: Tools
ur: ٹولز

source: Manage System Settings
ur: مینیج سسٹم سیٹنگز

source: System Settings
ur: سسٹم سیٹنگز

source: System Settings Graph
ur: سسٹم سیٹنگز گراف

source: Add New Resource
ur: نیا ریسورس شامل کریں

source: Arches Designer
ur: آرچز ڈیزائنر

source: Resource Models
ur: ریسورس ماڈل

source: Branches
ur: برانچز

source: Map Layer Manager
ur: میپ لیئر مینیجر

source: Resource Layers
ur: ریسورس لیئرز

source: Basemaps
ur: بیس میپس

source: Overlays
ur: اورلیز

source: Arches Collector Manager
ur: آرچز کلیکٹر مینیجر

source: Recent Edits
ur: حالیہ ترامیم

source: Profile Manager
ur: پروفائل مینیجر

source: Modules
ur: ماڈیولز

source: Reference Data Manager
ur: ریفرنس ڈیٹا مینیجر

source: Change your password
ur: اپنا پاس ورڈ تبدیل کریں

source: Change Password
ur: پاس ورڈ تبدیل کریں

source: Your password must:
ur: آپ کا پاس ورڈ لازمی :

source: Arches
ur: ارچس

source: Oops!
ur: اوپس!

source: Page Not Found!
ur: پیج نہیں ملا !

source: Sorry, but the page you are looking for has not been found on our server.
ur: معذرت، لیکن آپ جو پیج تلاش کر رہے ہیں وہ ہمارے سرور پر نہیں ملا۔

source: Back to Homepage
ur: واپس ہوم پیج پر

source: Internal Server Error!
ur: اندرونی سرور ایرر

source: Something went wrong and we couldn't process your request.
ur: کچھ غلط ہو گیا اور ہم آپ کی درخواست پر کارروائی نہیں کر سکے۔

source: Overview
ur: اورویو

source: As a database administrator, you will use the Arches Collector Manager to create and manage the projects that data collection users will access through the <a href="https://arches.readthedocs.io/en/stable/using-arches-collector" target="_blank">Arches Collector</a> mobile app.
ur: ڈیٹا بیس کے منتظم کے طور پر، آپ ایسے پروجیکٹس کو تخلیق اور ان کا نظم کرنے کے لیے آرچز کلیکٹر مینیجر کا استعمال کریں گے جن تک ڈیٹا کلیکشن کے صارفین <a href="https://arches.readthedocs.io/en/stable/using-arches-collector" target="_blank">آرچز کلیکٹر</a> موبائل ایپ کے ذریعے رسائی حاصل کریں گے۔

source: When you begin creating a new project, you'll be brought to the project summary, which shows you how many users are participating, when data was last synced, and more.
ur: جب آپ نیا پروجیکٹ تخلیق کرنا شروع کریں گے، تو آپ کو پروجیکٹ سمری پر لے جایا جائے گا، جو آپ کو ڈیٹا کو آخری بار سنک کرنے سے اب تک، کتنے صارفین حصہ لے رہے ہیں اور مزید دکھائے گی۔

source: open in new tab
ur: نئے ٹیب میں کھولیں

source: Once you have finished setting all of the parameters for your project, you will return to the summary page to activate it for the first time.
ur: اپنے پروجیکٹ کے تمام پیرامیٹرز کی ترتیب مکمل کر لینے کے بعد، آپ اسے پہلی مرتبہ فعال کرنے کے لیے سمری پیج پر واپس جائیں گے۔

source: This initial activation saves the contents of your project to a staging database, from which Arches Collector users will download it and begin collecting data.
ur: ابتدائی فعالیت آپ کے پروجیکٹ کے مشمولات کو اسٹیجنگ ڈیٹا بیس میں محفوظ کرتی ہے، جہاں سے آرچز کلیکٹر کے صارفین اسے ڈاؤن لوڈ کریں گے اور ڈیٹا اکٹھا کرنا شروع کریں گے۔

source: IMPORTANT: In order for Arches Collector users to connect to this Arches instance a system admin must first <a href="https://arches.readthedocs.io/en/stable/api/#registering-an-application-with-arches" target="_blank">register an application</a>.
ur: اہم: آرچز کلیکٹر صارفین کو اس آرچز انسٹینس سے مربوط کرنے کے لیے سسٹم کے منتظم کو لازماً پہلے <a href="https://arches.readthedocs.io/en/stable/api/#registering-an-application-with-arches" target="_blank">ایک ایپلیکیشن رجسٹر کروانی</a> ہو گی۔

source: Managing Projects
ur: مینیجنگ پروجکٹس

source: Activation/Deactivation
ur: ایکٹیویشن / ڈی ایکٹیویشن

source: The first time you activate the project and click Save, all of the parameters are saved to an intermediate location, and cannot be updated. After this initial activation, you can deactivate/reactivate the project whenever you want. When a project is deactivated, users who have already downloaded it can still collect and sync their data, but new users cannot download it, even if they have the proper permissions.
ur: پہلی بار آپ کے پروجیکٹ کھولنے اور محفوظ کریں پر کلک کرنے پر، تمام پیرامیٹرز انٹرمیڈیٹ مقام پر محفوظ ہو جائیں گے، اور اپ ڈیٹ نہیں ہو پائیں گے۔ اس ابتدائی فعالیت کے بعد، آپ جب چاہیں پروجیکٹ کو غیر فعال/دوبارہ فعال کر سکتے ہیں۔ جب پروجیکٹ غیر فعال ہوتا ہے، تو جن صارفین نے اسے پہلے سے ڈاؤن لوڈ کیا ہوتا ہے وہ تب بھی اپنے ڈیٹا کو اکٹھا اور سنک کر سکتے ہیں، لیکن نئے صارفین اسے ڈاؤن لوڈ نہیں کر سکتے، یہاں تک کہ اگر ان کے پاس موزوں اجازت بھی ہو۔

source: Syncing
ur: سینکنگ

source: After you have activated a project, and users have begun downloading it and entering data, they can sync their changes at any time. The following takes place when a user syncs a project:
ur: آپ کے پروجیکٹ کو فعال کرنے، اور صارفین کے اسے ڈاؤن لوڈ کرنے اور ڈیٹا داخل کرنے کے بعد، وہ کسی بھی وقت اپنی تبدیلیوں کو سنک کر سکتے ہیں۔ جب صارف سنک کرتا ہے تو مندرجہ ذیل انجام پاتا ہے:

source: All changes from the user's mobile device will be pushed to this database.
ur: صارف کے موبائل ڈیوائس سے تمام تبدیلیاں ڈیٹا بیس میں بھیج دی جائیں گی۔

source: All changes from the user's mobile device will be made available to all other participants in the same project.
ur: صارف کے موبائل ڈیوائس سے تمام تبدیلیاں اسی پروجیکٹ کے دیگر تمام شرکاء کے لیے دستیاب کر دی جائیں گی۔

source: If other project participants have synced their data, it will be downloaded to the user's mobile device.
ur: اگر پروجیکٹ کے دیگر شرکت کنندگان اپنا ڈیٹا سنک کر لیتے ہیں، تو یہ صارف کی موبائل ڈیوائس پر ڈاؤن لوڈ ہو جائے گا۔

source: If resources have been changed in this database since the project was first activated, these changes are <strong>not</strong> downloaded to the user's mobile device.
ur: اگر پروجیکٹ کے پہلی مرتبہ فعال ہونے کے بعد اس ڈیٹا بیس کی ریسورسز تبدیل ہوتی ہیں، تو یہ تبدیلیاں صارف کی موبائل ڈیوائس میں ڈاؤن لوڈ <strong>نہیں</strong> ہوتیں۔

source: Project Parameters
ur: پروجیکٹ پیرامیٹرز

source: Settings
ur: سیٹنگز

source: Name
ur: نام

source: This name will be used in Arches Collector when users connect to this Arches instance.
ur: جب صارفین اس آرچز انسٹینس سے مربوط ہوتے ہیں تو یہ نام آرچز کلیکٹر میں استعمال ہو گا۔

source: Start Date/End Date
ur: شروع کی تاریخ / اختتامی تاریخ

source: The project's start and end dates are used to limit when people can add or edit data to your project. Use these dates to enforce the beginning and end of your field data collection effort. When a project has expired, users will not be able to collect new data, but they can still sync.
ur: جب لوگ آپ کے پروجیکٹ کے ڈیٹا میں کچھ شامل یا ترمیم کرتے ہیں تو پروجیکٹ کی تاریخ آغاز اور تاریخ اختتام کو حد نافذ کرنے کے لیے استعمال کیا جاتا ہے۔ ان تواریخ کو اپنے فیلڈ ڈیٹا کو اکٹھا کرنے کی کوشش کو شروع اور ختم کرنے کو نافذ العمل کرنے کے لیے استعمال کریں۔ جب پروجیکٹ زائد المیعاد ہوتا ہے، تو صارفین نیا ڈیٹا اکٹھا کرنے کے قابل نہیں ہوں گے، لیکن تب بھی وہ سنک کر سکتے ہیں۔

source: Description
ur: تفصیل

source: Optionally add a description for your project. This description will be included when users download the project using Arches Collector.
ur: اختیاری طور پر اپنے پروجیکٹ کے لیے وضاحت شامل کریں۔ جب صارفین آرچز کلیکٹر استعمال کرتے ہوئے پروجیکٹ کو ڈاؤن لوڈ کریں گے تو یہ وضاحت شامل کی جائے گی۔

source: Map Extent
ur: نقشے کی حد

source: The map extent for this project will default to the extent set in System Settings, but can be changed however you like. If you allow users to download data in this project, only resources within this boundary will be used.
ur: اس پروجیکٹ کے لیے نقشے کی حد سسٹم کی ترتیبات میں سیٹ ہوئی حد پر ڈیفالٹ ہو گی، لیکن آپ کی پسند کے مطابق تبدیل کی جا سکتی ہے۔ اگر آپ صارفین کو اس پروجیکٹ میں ڈیٹا ڈاؤن لوڈ کرنے کی اجازت دیتے ہیں، تو صرف اس حدود کے اندر موجود ریسورسز استعمال کی جائیں گی۔

source: Map Sources
ur: نقشے کے ذرائع

source: Define the basemap layer(s) that will be available to users while they collect data with Arches Collector.
ur: بیس میپ لیئر(ز) کو واضح کریں جو صارفین کو آرچز کلیکٹر سے ڈیٹا اکٹھا کرتے وقت دستیاب ہو گی۔

source: If you expect data collection to happen in areas that do not have reliable cellular/wifi data connections, use this parameter to link to an MBTiles file that users will download when they download this project. You can learn more about creating this file in our external <a href="https://arches.readthedocs.io/en/stable/arches-collector-manager/" target="_blank">Arches Collector Manager</a> documentation.
ur: اگر آپ ایسے علاقوں میں ڈیٹا کلیکشن کے رونما ہونے کی توقع کرتے ہیں جہاں قابلِ بھروسہ سیلولر/وائی فائی ڈیٹا کنکشنز موجود نہیں ہیں، تو MBTiles فائل سے مربوط کرنے کے لیے اس پیرامیٹر کو استعمال کریں جو صارفین اس پروجیکٹ کو ڈاؤن لوڈ کرتے وقت ڈاؤن لوڈ کریں گے۔ آپ ہماری بیرونی <a href="https://arches.readthedocs.io/en/stable/arches-collector-manager/" target="_blank">آرچز کلیکٹر مینیجر</a>دستاویز سے اس فائل کو تخلیق کرنے کے بارے میں مزید جان سکتے ہیں۔

source: Models
ur: ماڈلز

source: You must select one or more resources models to include in the project. When a user downloads the project and begins editing data, only these resource models will be available to them.
ur: آپ کو اس پروجیکٹ میں شامل کرنے کے لیے لازماً ایک یا زائد ریسورسز ماڈلز منتخب کرنے ہوں گے۔ جب ایک صارف پروجیکٹ کو ڈاؤن لوڈ کرتا ہے اور ڈیٹا میں ترمیم کاری کا آغاز کرتا ہے، تو اسے محض یہی ریسورس ماڈلز دستیاب ہوں گے۔

source: Once you have selected a model, you must further decide which cards from that model to include.
ur: ماڈل کو منتخب کرنے کے بعد، آپ کو لازماً یہ فیصلہ کرنا ہو گا کہ اس ماڈل سے کون سے کارڈز شامل کرنے ہیں۔

source: By only including certain cards, you can keep the Arches Collector users focused on the specific information you want them to gather.
ur: محض مخصوص کارڈز کو شامل کرنے کے ذریعے، آپ آرچز کلیکٹر کے صارفین کی توجہ اس مخصوص معلومات پر مرکوز کر سکتے ہیں جو آپ ان سے جمع کروانا چاہتے ہیں۔

source: All existing card-level permissions in a resource model will be honored during data collection.
ur: ڈیٹا کلیکشن کے دوران ریسورسز ماڈل میں موجود تمام شامل کردہ کارڈ لیول کی اجازتوں کو تسلیم کیا جائے گا۔

source: Data
ur: ڈیٹا
