Repository: junaidabduljabbar/arches7-internationalization
Catalog: translated_out.po
Languages: ur

source: If you want users to edit existing resources in your database, you must include these resources in the Data Download section. You can limit the number of resources that get downloaded, with the default maximum limit being 2000. If the resource model you want to download includes geometry, only resources from within your Map Extent will be downloaded.
ur: اگر آپ چاہتے ہیں کہ صارفین آپ کی ڈیٹا بیس میں موجود ریسورسز میں ترمیم کریں، تو آپ کو لازماً ان ریسورسز کو ڈیٹا ڈاؤن لوڈ سیکشن میں شامل کرنا چاہیئے۔ آپ ان ریسورسز کی تعداد کو محدود کر سکتے ہیں جو ڈاؤن لوڈ ہوتی ہیں، جس کی ڈیفالٹ زیادہ سے زیادہ حد دو ہزار ہے۔ اگر آپ کے مطلوبہ ریسورس ماڈل میں جیومیٹری شامل ہو، تو محض آپ کی نقشے کی حد کے اندر موجود ریسورسز ڈاؤن لوڈ ہوں گی۔

source: You can also choose a custom download of resources. Simply go to the search page, construct a search query, and copy and paste the URL in the Custom Download URL box. All of the search results from that query will be included when users download this project.
ur: آپ ریسورسز کی کسٹم ڈاؤن لوڈ بھی منتخب کر سکتے ہیں۔ بس تلاش کے صفحے پر جائیں، ایک تلاش کا استفسار بنائیں، اور کسٹم ڈاؤن لوڈ یو آر ایل باکس میں یو آر ایل کو کاپی اور پیسٹ کریں۔ جب صارفین اس پروجیکٹ کو ڈاؤن لوڈ کریں گے تو اس استفسار کے تلاش کے تمام نتائج شامل ہو جائیں گے۔

source: People
ur: لوگ

source: When someone connects to this Arches instance from their mobile device using Arches Collector, they will only be able to access this project if they have been approved to do so.
ur: جب کوئی آرچز کلیکٹر استعمال کرتے ہوئے اپنی موبائل ڈیوائس سے اس آرچز انسٹینس سے مربوط ہوتا ہے، تو وہ صرف اسی صورت میں اس پروجیکٹ تک رسائی کر سکتا ہے کہ اگر اسے ایسا کرنے کی منظوری دی گئی ہو۔

source: When modifying group and user approvals, bear in mind the following:
ur: گروپ اور صارف کی منظوریوں میں ترمیم کرتے وقت، درج ذیل کو ذہن میں رکھیں:

source: By approving a group, all members will be approved.
ur: ایک گروپ کو منظور کرنے سے، تمام ممبران کو منظور کیا جائے گا.

source: By disapproving a group, all members will be disapproved unless they are approved as a member of a different group.
ur: کسی گروپ کو نامنظور کرنے سے، تمام ممبران اس وقت تک نامنظور ہو جائیں گے جب تک کہ وہ کسی دوسرے گروپ کے ممبر کے طور پر منظور نہ ہوں۔

source: You may approve or disapprove a user regardless of the approval status of any group to which that user belongs.
ur: آپ کسی صارف کو منظور یا نامنظور کر سکتے ہیں قطع نظر اس کے کہ وہ کسی بھی گروپ کی منظوری کی حیثیت سے تعلق رکھتا ہو۔

source: This page is where you manage all of your <strong>Resource Models</strong> and <strong>Branches</strong>.
ur: یہ صفحہ وہ ہے جہاں آپ اپنے تمام <strong>وسائل ماڈلز</strong> اور <strong>برانچز</strong> کا نظم کرتے ہیں۔

source: If you don't see any listed here, you may want to consider <a href="https://arches.readthedocs.io/en/stable/projects-and-packages" target="_blank">loading a package</a>. Alternatively, you can directly import individual Resource Model files through <strong>Add ...</strong> (close this panel to find the button). Finally, to start from scratch just <strong>Add ... > New Resource Model</strong>.
ur: اگر آپ کو یہاں کوئی فہرست نظر نہیں آتی ہے، تو آپ <a href="https://arches.readthedocs.io/en/stable/projects-and-packages" target="_blank">پیکیج لوڈ کرنے پر غور کر سکتے ہیں< /a> متبادل طور پر، آپ براہ راست انفرادی ریسورس ماڈل فائلوں کو <strong>شامل کریں ...</strong> کے ذریعے درآمد کر سکتے ہیں (بٹن تلاش کرنے کے لیے اس پینل کو بند کریں)۔ آخر میں، شروع سے شروع کرنے کے لیے صرف <strong>شامل کریں ... > نیا ریسورس ماڈل</strong>۔

source: Once you have some graphs loaded, there are a few management operations which are only accessible through this page. Use <strong>Manage ...</strong> on a graph to perform the following actions:
ur: ایک بار جب آپ کچھ گراف لوڈ کر لیتے ہیں، تو کچھ انتظامی آپریشن ہوتے ہیں جو صرف اس صفحہ کے ذریعے قابل رسائی ہوتے ہیں۔ درج ذیل اعمال انجام دینے کے لیے گراف پر <strong>منظم کریں ...</strong> کا استعمال کریں:

source: Manage Graph
ur: مینیج گراف

source: Enter the Graph Designer. This is where the magic happens!
ur: گراف ڈیزائنر درج کریں۔ یہ وہ جگہ ہے جہاں جادو ہوتا ہے!

source: Manage Functions
ur: مینیج فنکشنز

source: Resource Models only
ur: صرف ریسورس ماڈلز

source: Enter the Function Manager. <strong>You must use the Function Manager to configure the display names of your resources!</strong> Otherwise, all your resources will just be labeled "Untitled" in the search results and on the map.
ur: فنکشن مینیجر درج کریں۔ <strong>آپ کو اپنے وسائل کے ڈسپلے ناموں کو ترتیب دینے کے لیے فنکشن مینیجر کا استعمال کرنا چاہیے!</strong> بصورت دیگر، آپ کے تمام وسائل کو تلاش کے نتائج اور نقشے پر صرف "بلا عنوان" کا لیبل لگا دیا جائے گا۔

source: Create Mapping File
ur: میپنگ فائل بنائیں

source: You will need a Mapping File if you plan to <a href="https://arches.readthedocs.io/en/stable/import-export" target="_blank">bulk import resources</a> from a CSV file.
ur: اگر آپ CSV فائل سے <a href="https://arches.readthedocs.io/en/stable/import-export" target="_blank">بلک امپورٹ وسائل</a> کا ارادہ رکھتے ہیں تو آپ کو میپنگ فائل کی ضرورت ہوگی۔ .

source: Delete Instances
ur: انسٹانسس

source: Delete all resource instances that have been made with this Resource Model. <strong>This operation is not reversible!</strong> It's likely this operation would never be used outside of initial installation and testing.
ur: تمام وسائل کی مثالیں حذف کریں جو اس ریسورس ماڈل کے ساتھ بنائے گئے ہیں۔ <strong>یہ آپریشن الٹنے والا نہیں ہے!</strong> یہ ممکن ہے کہ یہ آپریشن کبھی بھی ابتدائی تنصیب اور جانچ کے باہر استعمال نہیں کیا جائے گا۔

source: Export
ur: ایکسپورٹ

source: Export this graph to a .json file. It can then be imported into a different Arches installation, or copied into a package.
ur: اس گراف کو .json فائل میں ایکسپورٹ کریں۔ اس کے بعد اسے مختلف آرچز کی تنصیب میں درآمد کیا جا سکتا ہے، یا پیکیج میں کاپی کیا جا سکتا ہے۔

source: Clone
ur: کلون

source: Create a duplicate of this graph. Useful during development if you want to alter a Resource Model that already has resource instances saved.
ur: اس گراف کا ڈپلیکیٹ بنائیں۔ ترقی کے دوران مفید ہے اگر آپ ریسورس ماڈل کو تبدیل کرنا چاہتے ہیں جس میں وسائل کی مثالیں پہلے سے محفوظ ہیں۔

source: Delete
ur: ڈیلیٹ

source: Delete this graph. If this is a Resource Model, all resource instances that have been made with it will also be deleted (as with <strong>Delete Instances</strong> operation above).
ur: اس گراف کو حذف کریں۔ اگر یہ ایک ریسورس ماڈل ہے، تو اس کے ساتھ بنائے گئے تمام وسائل کی مثالوں کو بھی حذف کر دیا جائے گا (جیسا کہ اوپر <strong>ڈیلیٹ انسٹینسز</strong> آپریشن کے ساتھ ہے)۔

source: What are Resource Models and Branches?
ur: ریسورس ماڈلز اور برانچز کیا ہیں؟

source: At the core of an Arches database are a series of structures called "graphs", of which there are two types:
ur: آرچز ڈیٹا بیس کے مرکز میں ڈھانچے کا ایک سلسلہ ہے جسے "گراف" کہا جاتا ہے، جن میں سے دو قسمیں ہیں:

source: <strong>Resource Models</strong> - When creating new Resources, a data entry user must decide which Resource Model to use, determining what information is collected for the Resource. Think of different Resource Models as categories of records in your database&mdash;"Buildings" vs. "Archaeological Sites" vs. "Cemeteries", for example. Every Arches database must have at least one Resource Model.
ur: <strong>وسائل کے ماڈلز</strong> - نئے وسائل بناتے وقت، ڈیٹا انٹری استعمال کرنے والے کو یہ فیصلہ کرنا چاہیے کہ کون سا ریسورس ماڈل استعمال کرنا ہے، اس بات کا تعین کرتے ہوئے کہ وسائل کے لیے کون سی معلومات اکٹھی کی جاتی ہے۔ اپنے ڈیٹا بیس میں ریکارڈز کے زمرے کے طور پر مختلف وسائل کے ماڈلز کے بارے میں سوچیں&mdash;"عمارتیں" بمقابلہ "آثار قدیمہ کی سائٹس" بمقابلہ "قبرستان"، مثال کے طور پر۔ ہر آرچ ڈیٹا بیس میں کم از کم ایک ریسورس ماڈل ہونا ضروری ہے۔

source: <strong>Branches</strong> - You can think of Branches as "partial" graphs that can be aggregated to form the "full" graph of a Resource Model. They function as resuable building blocks, allowing you to avoid having to manually recreate complex structures in multiple Resource Models.
ur: <strong>شاخیں</strong> - آپ برانچز کو "جزوی" گراف کے طور پر سوچ سکتے ہیں جنہیں ریسورس ماڈل کا "مکمل" گراف بنانے کے لیے جمع کیا جا سکتا ہے۔ وہ دوبارہ قابل تعمیر عمارت کے بلاکس کے طور پر کام کرتے ہیں، جس سے آپ کو متعدد ریسورس ماڈلز میں پیچیدہ ڈھانچے کو دستی طور پر دوبارہ بنانے سے بچنے کی اجازت ملتی ہے۔

source: Cards Tab
ur: کارڈز ٹیب

source: In this tab you will configure the user-facing aspects of your graph. There are multiple levels to doing so, which are reflected in the levels of the graph tree. <strong>Report Configuration</strong> where you choose the template for the resource report, <strong>Card Configuration</strong> where you'll specify card-related settings, and the <strong>Widget Manager</strong> where you will choose and configure the data entry widget for each node in the graph.
ur: اس ٹیب میں آپ اپنے گراف کے صارف کا سامنا کرنے والے پہلوؤں کو ترتیب دیں گے۔ ایسا کرنے کے لیے متعدد سطحیں ہیں، جو گراف ٹری کی سطحوں میں جھلکتی ہیں۔ <strong>رپورٹ کنفیگریشن</strong> جہاں آپ وسائل کی رپورٹ کے لیے ٹیمپلیٹ کا انتخاب کرتے ہیں، <strong>کارڈ کنفیگریشن</strong> جہاں آپ کارڈ سے متعلق ترتیبات کی وضاحت کریں گے، اور <strong>ویجیٹ مینیجر</strong> جہاں آپ گراف میں ہر نوڈ کے لیے ڈیٹا انٹری ویجیٹ کو منتخب اور ترتیب دیں گے۔

source: Report Configuration
ur: رپورٹ کنفیگریشن

source: Each Resource Model must be configured with a report template. Reports show data for all nodes in a resource instance for which the user has Read permissions.
ur: ہر ریسورس ماڈل کو رپورٹ ٹیمپلیٹ کے ساتھ کنفیگر کیا جانا چاہیے۔ رپورٹس وسائل کی مثال میں تمام نوڈس کا ڈیٹا دکھاتی ہیں جس کے لیے صارف کو پڑھنے کی اجازت ہوتی ہے۔

source: No Header Template
ur: ہیڈر ٹیمپلیٹ نہیں ہے

source: Lists all node data, no special header at the top of the page.
ur: تمام نوڈ ڈیٹا کی فہرست، صفحہ کے اوپری حصے میں کوئی خاص ہیڈر نہیں۔

source: Image Header Template
ur: تصویر ہیڈر ٹیمپلیٹ

source: Use this template for Resource Models that will be be primarily used to record images.
ur: اس ٹیمپلیٹ کو ایسے ریسورس ماڈلز کے لیے استعمال کریں جو بنیادی طور پر تصاویر کو ریکارڈ کرنے کے لیے استعمال کیے جائیں گے۔

source: Included Image Nodes
ur: تصویر نوڈز شامل ہیں

source: Choose one or more nodes that hold images in this Resource Model. These images will be presented as a slideshow in the report header.
ur: اس ریسورس ماڈل میں تصاویر رکھنے والے ایک یا زیادہ نوڈس کا انتخاب کریں۔ یہ تصاویر رپورٹ کے ہیڈر میں سلائیڈ شو کے طور پر پیش کی جائیں گی۔

source: Map Header Template
ur: نقشہ ہیڈر ٹیمپلیٹ

source: Use this template for Resource Models that will be be primarily used to record resources that have a geo-location. There are number of settings you should fill out to control the appearance of the map in the header.
ur: اس ٹیمپلیٹ کو ریسورس ماڈلز کے لیے استعمال کریں جو بنیادی طور پر ان وسائل کو ریکارڈ کرنے کے لیے استعمال کیے جائیں گے جن کا جغرافیائی محل وقوع ہے۔ ہیڈر میں نقشے کی ظاہری شکل کو کنٹرول کرنے کے لیے آپ کو کئی سیٹنگز کو پُر کرنا چاہیے۔

source: Map Controls
ur: نقشہ کنٹرولز

source: Choose whether or not the user has access to the Map Tools.
ur: منتخب کریں کہ آیا صارف کو میپ ٹولز تک رسائی حاصل ہے یا نہیں۔

source: Position
ur: پوزیشن

source: You can set the position by panning the map. On report load, the map will automatically pan and zoom to the resource geo-location if there is one (also see <strong>Default Value</strong> below). Pitch values are 0-60 (higher = more oblique), <strong>Bearing</strong> values can be positive or negative (270 faces west; -180 faces south). Use <code>ctrl + click</code> then pan the map to change Pitch and Bearing.
ur: آپ نقشے کو پین کرکے پوزیشن سیٹ کرسکتے ہیں۔ رپورٹ لوڈ ہونے پر، نقشہ خود بخود پین ہو جائے گا اور وسائل کے جغرافیائی محل وقوع پر زوم ہو جائے گا اگر کوئی ہے (نیچے <strong>ڈیفالٹ ویلیو</strong> بھی دیکھیں)۔ پچ کی قدریں 0-60 ہیں (اعلی = زیادہ ترچھی)، <strong>بیئرنگ</strong> کی قدریں مثبت یا منفی ہو سکتی ہیں (270 چہرے مغرب؛ -180 جنوب کی طرف)۔ <code>ctrl + click</code> استعمال کریں پھر پچ اور بیئرنگ کو تبدیل کرنے کے لیے نقشہ کو پین کریں۔

source: Zoom
ur: زوم

source: Zoom levels go from 0 (zoomed out) to 20 (zoomed in). On report load, the map will automatically pan and zoom to the resource geo-location if there is one.
ur: زوم کی سطح 0 (زوم آؤٹ) سے 20 (زوم ان) تک جاتی ہے۔ رپورٹ لوڈ ہونے پر، نقشہ خود بخود پین ہو جائے گا اور وسائل کے جیو لوکیشن پر زوم ہو جائے گا۔

source: Geocoder
ur: جیو کوڈر

source: Configure which geocoding service the address search bar will use, and whether or not to show the bar at all.
ur: کنفیگر کریں کہ ایڈریس سرچ بار کون سی جیو کوڈنگ سروس استعمال کرے گا، اور بار کو ظاہر کرنا ہے یا نہیں۔

source: Resource Properties
ur: ریسورس پراپرٹیز

source: Configure some styling options for how the resource appears on the map.
ur: نقشے پر وسائل کیسے ظاہر ہوتے ہیں اس کے لیے اسٹائل کے کچھ اختیارات ترتیب دیں۔

source: Default Value
ur: ڈیفالٹ ویلیو

source: Choose whether the map should zoom to the resource geo-location if available or the geo-location of the user.
ur: منتخب کریں کہ آیا نقشہ کو وسائل کے جیو لوکیشن پر زوم کرنا چاہیے اگر دستیاب ہو یا صارف کے جیو لوکیشن۔

source: Card Configuration
ur: کارڈ کی ترتیب

source: The settings for Cards are mostly related yo how you want a user to see the card, but some have a more direct bearing on data structure as well. The preview shows what the card will look like to users.
ur: کارڈز کی سیٹنگز زیادہ تر اس بات سے متعلق ہیں کہ آپ کس طرح صارف کارڈ کو دیکھنا چاہتے ہیں، لیکن کچھ کا ڈیٹا اسٹرکچر پر بھی زیادہ براہ راست اثر ہوتا ہے۔ پیش نظارہ دکھاتا ہے کہ کارڈ صارفین کو کیسا نظر آئے گا۔

source: Card Type
ur: کارڈ کی قسم

source: Choose the Card Component to use. Only the Default Card is available initially, but custom Card Components are a way for developers to enhance the user experience.
ur: استعمال کرنے کے لیے کارڈ کے اجزاء کا انتخاب کریں۔ ابتدائی طور پر صرف ڈیفالٹ کارڈ دستیاب ہے، لیکن حسب ضرورت کارڈ کے اجزاء ڈویلپرز کے لیے صارف کے تجربے کو بڑھانے کا ایک طریقہ ہیں۔

source: Card Title
ur: کارڈ ٹائٹل

source: Users will see this title when performing data entry.
ur: ڈیٹا انٹری کرتے وقت صارفین کو یہ عنوان نظر آئے گا۔

source: Subtitle
ur: ذیلی عنوان

source: Users will see this subtitle when performing data entry.
ur: ڈیٹا انٹری کرتے وقت صارفین کو یہ سب ٹائٹل نظر آئے گا۔

source: CSS Classes
ur: سی ایس ایس کلاسز

source: You can add your own CSS classes to this Card to customize its look and feel. Define these classes in your project's "package.css" file.
ur: آپ اس کارڈ کی شکل و صورت کو اپنی مرضی کے مطابق بنانے کے لیے اس میں اپنی سی ایس ایس کلاسز شامل کر سکتے ہیں۔ اپنے پروجیکٹ کی "package.css" فائل میں ان کلاسز کی وضاحت کریں۔

source: Make Card Visible
ur: کارڈ کو مرئی بنائیں

source: Show this Card by default. Developers could hide a card initially, and show it based other variables.
ur: یہ کارڈ بطور ڈیفالٹ دکھائیں۔ ڈویلپر ابتدائی طور پر کارڈ چھپا سکتے ہیں، اور اسے دوسرے متغیرات کی بنیاد پر دکھا سکتے ہیں۔

source: Allow Multiple Values
ur: متعدد ویلیوز کی اجازت دیں

source: While certain node data types allow the storage of multiple values in a single node, "concept-list" for example, this setting is how you control cardinality at a higher level. When determining whether or not to use this setting, we recommend testing out the resource editor interface directly.
ur: جب کہ بعض نوڈ ڈیٹا کی قسمیں ایک نوڈ میں متعدد قدروں کو ذخیرہ کرنے کی اجازت دیتی ہیں، مثال کے طور پر "تصور کی فہرست"، یہ ترتیب یہ ہے کہ آپ اعلی سطح پر کارڈینیلیٹی کو کیسے کنٹرول کرتے ہیں۔ اس ترتیب کو استعمال کرنے یا نہ کرنے کا تعین کرتے وقت، ہم ریسورس ایڈیٹر انٹرفیس کو براہ راست جانچنے کی تجویز کرتے ہیں۔

source: Enable Card-level Help
ur: کارڈ کی سطح کی مدد کو فعال کریں۔

source: To aid data entry users when using this Card, you may want to add some extra guidance. Enable setting to do so, and design the content of this guidance with the Card-Level Help menu.
ur: اس کارڈ کا استعمال کرتے وقت ڈیٹا انٹری استعمال کرنے والوں کی مدد کے لیے، آپ کچھ اضافی رہنمائی شامل کرنا چاہیں گے۔ ایسا کرنے کے لیے ترتیب کو فعال کریں، اور کارڈ لیول ہیلپ مینو کے ساتھ اس رہنمائی کے مواد کو ڈیزائن کریں۔

source: Widget Management
ur: ویجیٹ مینجمنٹ

source: Widgets are data entry helpers for each node that collects information; it's often easier to pick a date from a calendar than to type it in, for example. Generally, the data type of the node will determine which Widget template is used. However, in some cases you will have a choice: For example, in the case of a <code>concept</code> node, you can choose a dropdown menu or a set of radio buttons. Similarly, for a <code>string</code> node you can choose a basic text box or a rich text editor.
ur: وجیٹس ہر ایک نوڈ کے لیے ڈیٹا انٹری مددگار ہیں جو معلومات جمع کرتے ہیں۔ مثال کے طور پر، کیلنڈر سے تاریخ کا انتخاب کرنا اسے ٹائپ کرنے کے بجائے اکثر آسان ہوتا ہے۔ عام طور پر، نوڈ کی ڈیٹا کی قسم اس بات کا تعین کرے گی کہ کون سا ویجیٹ ٹیمپلیٹ استعمال کیا گیا ہے۔ تاہم، کچھ معاملات میں آپ کے پاس انتخاب ہوگا: مثال کے طور پر، <code>تصور</code> نوڈ کی صورت میں، آپ ڈراپ ڈاؤن مینو یا ریڈیو بٹنوں کا ایک سیٹ منتخب کر سکتے ہیں۔ اسی طرح، <code>string</code> نوڈ کے لیے آپ بنیادی ٹیکسٹ باکس یا ایک بھرپور ٹیکسٹ ایڈیٹر کا انتخاب کرسکتے ہیں۔

source: Depending on the Widget, there are more settings you can configure, most of which are optional and all come with acceptable defaults.
ur: ویجیٹ پر انحصار کرتے ہوئے، مزید ترتیبات ہیں جنہیں آپ ترتیب دے سکتے ہیں، جن میں سے زیادہ تر اختیاری ہیں اور سبھی قابل قبول ڈیفالٹس کے ساتھ آتی ہیں۔

source: Common Settings
ur: کامن سیٹنگز

source: Widget Label
ur: ویجیٹ لیبل

source: This will be used in the user interface. The default label comes from the node name.
ur: یہ یوزر انٹرفیس میں استعمال ہوگا۔ پہلے سے طے شدہ لیبل نوڈ کے نام سے آتا ہے۔

source: Template
ur: ٹیمپلیٹ

source: The list of available Widgets is determined by the node's data type, though developers can <a href="https://arches.readthedocs.io/en/stable/functions-widgets-datatypes/#widgets" target="_blank">create new Widgets</a>.
ur: دستیاب وجیٹس کی فہرست کا تعین نوڈ کے ڈیٹا کی قسم سے کیا جاتا ہے، حالانکہ ڈویلپرز یہ کر سکتے ہیں <a href="https://arches.readthedocs.io/en/stable/functions-widgets-datatypes/#widgets" target="_blank"> نئے وجیٹس بنائیں</a>۔

source: Placeholder
ur: پلیس ہولڈر

source: Shown in the input area before the user has entered anything.
ur: صارف کے کچھ داخل کرنے سے پہلے ان پٹ ایریا میں دکھایا جاتا ہے۔

source: If desired, you can define a default value.
ur: اگر آپ چاہیں تو، آپ ڈیفالٹ قدر کی وضاحت کر سکتے ہیں۔

source: Other Settings by Widget
ur: ویجیٹ کے ذریعہ دیگر ترتیبات

source: map-widget
ur: نقشہ-ویجیٹ

source: The map widget allows for a good deal of customization, from the default center and zoom level to default layers.
ur: نقشہ ویجیٹ ڈیفالٹ سینٹر اور زوم لیول سے لے کر ڈیفالٹ لیئرز تک کافی حد تک حسب ضرورت کی اجازت دیتا ہے۔

source: datepicker-widget
ur: تاریخ چننے والا-ویجیٹ

source: This widget is used for the normal date data type, not the extended date/time format data type. You can set minumum or maximum dates, change how specific the calendar is when user first opens it, or set the display of the date. However, note that real YYYY-MM-DD dates are stored in the database whether no matter what display format you have chosed for this widget. So if you have set YYYY for the <strong>Date Format</strong> and a user enters "2005", then "2005-01-01" will be saved in the database.
ur: یہ ویجیٹ عام تاریخ ڈیٹا کی قسم کے لیے استعمال ہوتا ہے، توسیع شدہ تاریخ/وقت کی شکل کے ڈیٹا کی قسم کے لیے نہیں۔ آپ کم سے کم یا زیادہ سے زیادہ تاریخیں سیٹ کر سکتے ہیں، تبدیل کر سکتے ہیں کہ کیلنڈر کتنا مخصوص ہے جب صارف اسے پہلی بار کھولتا ہے، یا تاریخ کا ڈسپلے سیٹ کر سکتے ہیں۔ تاہم، نوٹ کریں کہ حقیقی YYYY-MM-DD تاریخیں ڈیٹا بیس میں محفوظ کی جاتی ہیں چاہے آپ نے اس ویجیٹ کے لیے ڈسپلے فارمیٹ کا انتخاب کیا ہو۔ لہذا اگر آپ نے <strong>تاریخ کی شکل</strong> کے لیے YYYY سیٹ کیا ہے اور کوئی صارف "2005" داخل کرتا ہے، تو ڈیٹا بیس میں "2005-01-01" محفوظ ہو جائے گا۔

source: <p>Functions are discrete operations that can be associated with a Resource Model and are run on specific nodes or cards whenever a user clicks creates or modify's a Resource. Here in the Function Manager you will associate Functions with this Resource Model and configure them appropriately.</p> <p>To add a Function to this Resource Model, click on it in Function Library, and notice that it is added to the list of Selected Functions. To delete a Function, use the <i class="ion-ios-trash add-tooltip" style="color:lightcoral;"></i> symbol in the upper right corner.
ur: <p>فنکشنز مجرد آپریشنز ہیں جو کسی ریسورس ماڈل کے ساتھ منسلک ہوسکتے ہیں اور جب بھی صارف کلک کرتا ہے تو اسے مخصوص نوڈس یا کارڈز پر چلایا جاتا ہے۔ یہاں فنکشن مینیجر میں آپ فنکشنز کو اس ریسورس ماڈل کے ساتھ منسلک کریں گے اور انہیں مناسب طریقے سے ترتیب دیں گے۔</p> <p>اس ریسورس ماڈل میں فنکشن شامل کرنے کے لیے، فنکشن لائبریری میں اس پر کلک کریں، اور دیکھیں کہ اسے منتخب کردہ فنکشنز کی فہرست میں شامل کیا گیا ہے۔ کسی فنکشن کو حذف کرنے کے لیے، اوپری دائیں کونے میں <i class="ion-ios-trash add-tooltip" style="color:lightcoral;"></i> علامت استعمال کریں۔

source: adding a function - click to view
ur: ایک فنکشن شامل کر رہے ہیں - دیکھنے کے لیے کلک کریں

source: <p>Arches comes with three default functions (see below). However, functions are envisioned as the hook through which developers can easily customize Arches capabilities, because new Functions can be added to your individual Arches installation. Learn more <a href="https://github.com/archesproject/arches/wiki/Creating-New-Functions%%2C-DataTypes%%2C-and-Widgets" target="_blank">here</a>.</p>
ur: <p>محراب تین ڈیفالٹ فنکشنز کے ساتھ آتی ہیں (نیچے دیکھیں)۔ تاہم، فنکشنز کا تصور ایک ہک کے طور پر کیا گیا ہے جس کے ذریعے ڈویلپر آرچز کی صلاحیتوں کو آسانی سے اپنی مرضی کے مطابق بنا سکتے ہیں، کیونکہ آپ کی انفرادی آرچز کی تنصیب میں نئے فنکشنز شامل کیے جا سکتے ہیں۔ مزید جانیں <a href="https://github.com/archesproject/arches/wiki/Creating-New-Functions%%2C-DataTypes%%2C-and-Widgets" target="_blank">یہاں</a> .</p>

source: Define Resource Descriptors
ur: وسائل کی وضاحت کرنے والوں کی وضاحت کریں۔

source: This function will generate one or more descriptors for Resources that are created with this Resource Model. These descriptors are used throughout the database interface, but are not saved as part of the resource. This gives you control over the way Resources are identified and described in search results and elsewhere.
ur: یہ فنکشن ان وسائل کے لیے ایک یا زیادہ ڈسکرپٹرز تیار کرے گا جو اس ریسورس ماڈل کے ساتھ بنائے گئے ہیں۔ یہ ڈسکرپٹرز پورے ڈیٹا بیس انٹرفیس میں استعمال ہوتے ہیں، لیکن وسائل کے حصے کے طور پر محفوظ نہیں ہوتے ہیں۔ یہ آپ کو تلاش کے نتائج اور دیگر جگہوں پر وسائل کی شناخت اور بیان کرنے کے طریقے پر کنٹرول فراہم کرتا ہے۔

source: Once added to the Resource Model, use the appropriate tab to configure a descriptor template. Choose a card, and variables corresponding to each node in that card will be added to the template, demarcated with <code>&lt; &gt;</code>. You can rearrange these variables and add text to customize the descriptor. When you have set the descriptors, click <strong>Re-Index</strong> to update any existing resources in your database.
ur: ریسورس ماڈل میں شامل ہونے کے بعد، ڈسکریپٹر ٹیمپلیٹ کو ترتیب دینے کے لیے مناسب ٹیب کا استعمال کریں۔ ایک کارڈ کا انتخاب کریں، اور اس کارڈ میں ہر نوڈ کے مطابق متغیرات کو ٹیمپلیٹ میں شامل کیا جائے گا، جس کی حد بندی <code>&lt; &gt;</code>۔ آپ ان متغیرات کو دوبارہ ترتیب دے سکتے ہیں اور وضاحت کنندہ کو حسب ضرورت بنانے کے لیے متن شامل کر سکتے ہیں۔ جب آپ ڈسکرپٹرز سیٹ کر لیں تو اپنے ڈیٹا بیس میں موجود کسی بھی وسائل کو اپ ڈیٹ کرنے کے لیے <strong>ری-انڈیکس</strong> پر کلک کریں۔
