Repository: junaidabduljabbar/arches7-internationalization
Catalog: translated_out.po
Languages: ur

source: Release mouse to finish drawing.
ur: ڈرائنگ ختم کرنے کے لیے ماؤس چھوڑیں۔

source: Apply changes.
ur: تبدیلیاں لاگو کریں۔

source: Apply
ur: درخواست دیں

source: Undo edits, discards all changes.
ur: ترامیم کو کالعدم کریں، تمام تبدیلیوں کو رد کر دیں۔

source: Undo
ur: کالعدم

source: Edit drawings.
ur: ڈرائنگ میں ترمیم کریں۔

source: No drawings to edit.
ur: ترمیم کرنے کے لیے کوئی ڈرائنگ نہیں ہے۔

source: Delete drawings.
ur: ڈرائنگ کو ڈیلیٹ کریں

source: No drawings to delete.
ur: ڈیلیٹ کرنے کے لیے کوئی ڈرائنگ نہیں ہے۔

source: Drag handles, or marker to edit feature.
ur: خصوصیت میں ترمیم کرنے کے لیے ہینڈلز، یا مارکر کو گھسیٹیں۔

source: Click undo to cancel changes.
ur: تبدیلیاں منسوخ کرنے کے لیے کالعدم پر کلک کریں۔

source: Click on a feature to remove
ur: ہٹانے کے لیے فیچر پر کلک کریں۔

source: Sign In
ur: سائن ان

source: Sign in to Arches to access your data modeling, editing, and discovery tools.
ur: اپنے ڈیٹا ماڈلنگ، ایڈیٹنگ، اور دریافت ٹولز تک رسائی کے لیے آرچز میں سائن ان کریں۔

source: Login failed
ur: لاگ ان ناکام

source: Invalid username and/or password.
ur: غلط صارف نام اور/یا پاس ورڈ۔

source: Forgot password ?
ur: پاسورڈ بھول گے ؟

source: Forgot password?
ur: پاسورڈ بھول گے ؟

source: Create a new account
ur: نیا اکاؤنٹ بنائیں

source: Learn more about <a href='http://www.archesproject.org'>Arches</a>
ur: <a href='http://www.archesproject.org'>Arches</a> کے بارے میں مزید جانیں۔

source: Select a graph...
ur: ایک گراف منتخب کریں...

source: Graphs/Semantics
ur: گرافس/Semantics

source: Define graph
ur: گراف کی وضاحت کریں۔

source: Return to Arches Designer
ur: آرچز ڈیزائنر پر واپس جائیں۔

source: Create Arches Resource Models and Branches
ur: آرچز ریسورس ماڈلز اور برانچز بنائیں

source: footer
ur: فوٹر

source: New Model
ur: نیا ماڈل

source: Create new Resource Model
ur: نیا ریسورس ماڈل بنائیں

source: New Branch
ur: نئی برانچ

source: Create new Branch
ur: نئی برانچ بنائیں

source: Import Model
ur: ماڈل درآمد کریں

source: Import Model by uploading a json file
ur: json فائل اپ لوڈ کرکے ماڈل درآمد کریں۔

source: Clone Model
ur: کلون ماڈل

source: Clone Branch
ur: کلون برانچ

source: Clone the existing Resource Model
ur: موجودہ ریسورس ماڈل کو کلون کریں

source: Clone the existing Branch
ur: موجودہ برانچ کو کلون کریں

source: Export Model
ur: ماڈل برآمد کریں

source: Export Branch
ur: برانچ برآمد کریں

source: Export the existing Resource Model
ur: موجودہ ریسورس ماڈل برآمد کریں

source: Export the existing Branch
ur: موجودہ برانچ کو برآمد کریں

source: Functions
ur: فنکشنز

source: Configure functions attached to this Resource Model
ur: اس ریسورس ماڈل سے منسلک فنکشنز کو ترتیب دیں۔

source: Export Mapping File
ur: میپنگ فائل برآمد کریں

source: Use a mapping file with import/export of business data
ur: بزنس ڈیٹا کی درآمد/برآمد کے ساتھ میپنگ فائل کا استعمال کریں

source: Delete Associated Instances
ur: وابستہ مثالیں حذف کریں۔

source: Delete All Associated Instances with this Model
ur: اس ماڈل کے ساتھ تمام وابستہ مثالیں حذف کریں۔

source: Delete Model
ur: ماڈل کو ڈیلیٹ کریں

source: Delete Branch
ur: برانچ کو ڈیلیٹ کریں

source: Delete the existing Resource Model
ur: موجودہ ریسورس ماڈل کو ڈیلیٹ کریں

source: Delete the existing Branch
ur: موجودہ برانچ کو ڈیلیٹ کریں

source: Exit Project
ur: پروجیکٹ سے باہر نکلیں

source: Return to the list of available projects
ur: دستیاب منصوبوں کی فہرست پر واپس جائیں۔

source: Delete Project
ur: پروجیکٹ کو ڈیلیٹ کریں

source: Delete the current project
ur: موجودہ پروجیکٹ کو ڈیلیٹ کریں

source: You cannot delete an active project
ur: آپ ایک فعال پروجیکٹ کو ڈیلیٹ نہیں کرسکتے ہیں

source: Copy Resource
ur: ریسورس کاپی کریں

source: Make a copy and start editing
ur: ایک کاپی بنائیں اور ترمیم شروع کریں۔

source: Delete Resource
ur: ریسورس کو ڈیلیٹ کریں

source: Permanently delete this resource
ur: اس ریسورس کو مستقل طور پر ڈیلیٹ کریں

source: Review Edit History
ur: ترمیم کی تاریخ کا جائزہ لیں۔

source: View changes to this resource record
ur: اس ریسورس کے ریکارڈ میں تبدیلیاں دیکھیں

source: Jump to Report
ur: رپورٹ پر جائیں

source: View the full resource report
ur: ریسورس کی مکمل رپورٹ دیکھیں

source: Print Report
ur: رپورٹ پرنٹ کریں

source: Print the full resource report
ur: ریسورس کی مکمل رپورٹ پرنٹ کریں

source: Toggle Dropdown
ur: ڈراپ ڈاؤن کو ٹوگل کریں

source: Add Thesauri
ur: تھیسوری شامل کریں۔

source: Import Thesauri
ur: تھیسوری درآمد کریں۔

source: Export Thesauri
ur: تھیسوری برآمد کریں۔

source: Delete Thesauri
ur: تھیسوری کو حذف کریں۔

source: Add Collection
ur: کلیکشن شامل کریں

source: Delete Collection
ur: کلیکشن ڈیلیٹ کریں

source: Export All Collections
ur: تمام مجموعے برآمد کریں۔

source: Loading...
ur: لوڈ ہو رہا ہے...

source: Create Account
ur: اکاؤنٹ بنائیں

source: Register to access data modeling, editing, and discovery tools.
ur: ڈیٹا ماڈلنگ، ایڈیٹنگ، اور دریافت ٹولز تک رسائی کے لیے رجسٹر ہوں۔

source: Please correct the error below.
ur: براہ کرم ذیل کی غلطی کو درست کریں۔

source: Please correct the errors below.
ur: برائے مہربانی مندرجہ ذیل غلطیوں کو درست کریں.

source: Signup
ur: سائن اپ

source: Add Buffer Feature
ur: بفر فیچر شامل کریں۔

source: Distance:
ur: فاصلے:

source: Units:
ur: یونٹس:

source: meters
ur: میٹرز

source: feet
ur: فیٹ

source: Add as new
ur: نئے کے طور پر شامل کریں

source: Add Feature
ur: فیچر شامل کریں

source: These data are provisional and pending review
ur: یہ ڈیٹا عارضی اور زیر التواء جائزہ ہیں۔

source: Sorry, you don't have access to this information
ur: معذرت، آپ کو اس معلومات تک رسائی حاصل نہیں ہے۔

source: No data added yet for
ur: کے لیے ابھی تک کوئی ڈیٹا شامل نہیں کیا گیا

source: Add Gnu
ur: Gnu شامل کریں۔

source: Showing edits by
ur: کی طرف سے ترامیم دکھا رہا ہے

source: Return to approved edits
ur: منظور شدہ ترامیم پر واپس جائیں۔

source: This is a new contribution by a provisional editor.
ur: یہ ایک عارضی ایڈیٹر کی طرف سے ایک نئی شراکت ہے۔

source: Currently showing the most recent approved edits
ur: فی الحال حالیہ منظور شدہ ترامیم دکھا رہا ہے۔

source: Provisional Edits
ur: عارضی ترامیم

source: Delete all edits
ur: تمام ترامیم کو ڈیلیٹ کریں

source: Delete this record
ur: اس ریکارڈ کو ڈیلیٹ کریں

source: Cancel edit
ur: ترمیم منسوخ کریں۔

source: Save edit
ur: ترمیم کو محفوظ کریں۔

source: Add
ur: شامل کریں

source: New
ur: نیا

source: Add New
ur: نیا شامل کریں

source: Choose a sibling card...
ur: ایک بہن بھائی کارڈ منتخب کریں...

source: Default Image Service URL
ur: ڈیفالٹ امیج سروس URL

source: Enter manifest URL
ur: مینی فیسٹ URL درج کریں۔

source: Select drawings map source (optional)
ur: ڈرائنگ میپ کا ماخذ منتخب کریں (اختیاری)

source: Select drawings map source layer (optional)
ur: ڈرائنگ میپ سورس پرت کو منتخب کریں (اختیاری)

source: Select drawings text (optional)
ur: ڈرائنگ کا متن منتخب کریں (اختیاری)

source: Map Center Longitude
ur: نقشہ کا مرکز طول البلد

source: Longitude (x coordinate)
ur: طول البلد (x کوآرڈینیٹ)

source: Map Center Latitude
ur: نقشہ مرکز عرض البلد

source: Latitude (y coordinate)
ur: عرض بلد (y کوآرڈینیٹ)

source: Default Zoom
ur: ڈیفالٹ زوم

source: Zoom Level
ur: زوم لیول

source: Related instance map sources
ur: متعلقہ مثال کے نقشے کے ذرائع

source: Related instance map source layers (optional)
ur: متعلقہ مثال کے نقشے کے ماخذ پرتیں (اختیاری)

source: Intersection layer configuration
ur: انٹرسیکشن پرت کی ترتیب

source: Default Color
ur: پہلے سے طے شدہ رنگ

source: Selected Feature Color
ur: منتخب کردہ فیچر کا رنگ

source: Hovered Feature Color
ur: ہوورڈ فیچر کا رنگ

source: Layer Color Palette
ur: پرت کا رنگ پیلیٹ

source: Fill Opacity
ur: دھندلاپن کو بھریں۔

source: Overview Zoom
ur: جائزہ زوم

source: Min Zoom
ur: کم از کم زوم

source: Point Radius
ur: نقطہ رداس

source: Line Width
ur: لکیر کی چوڑائی

source: Stroke Color
ur: اسٹروک کا رنگ

source: Stroke Width
ur: اسٹروک چوڑائی

source: Point Stroke Width
ur: پوائنٹ اسٹروک چوڑائی

source: Point Stroke Opacity
ur: پوائنٹ اسٹروک اوپیسٹی

source: Edit Coordinates
ur: نقاط میں ترمیم کریں۔

source: Show Feature
ur: خصوصیت دکھائیں۔

source: Done
ur: ہو گیا

source: Select an Option
ur: ایک آپشن منتخب کریں۔

source: Has no value
ur: کوئی ویلیو نہیں ہے

source: Has any value
ur: کوئی بھی ویلیو ہے

source: Label 'True'
ur: لیبل 'سچ'

source: Label 'False'
ur: لیبل 'جھوٹا'

source: Concept Collection
ur: کانسپٹ کلیکشن

source: Select a concept collection
ur: کانسپٹ کلیکشن منتخب کریں

source: Equals
ur: برابر ہے۔

source: Not
ur: نہیں

source: Date
ur: تاریخ

source: Date Format
ur: تاریخ کی شکل

source: Date Format
ur: تاریخ کی شکل

source: Domain options
ur: ڈومین کے اختیارات

source: Add new option...
ur: نیا آپشن شامل کریں...

source: Value
ur: ویلیو

source: overlaps
ur: اوورلیپ

source: Fuzzy Year Padding
ur: فجی ایئر پیڈنگ

source: Fuzzy Month Padding
ur: فزی مہینے کی پیڈنگ

source: Fuzzy Day Padding
ur: فزی ڈے پیڈنگ

source: Fuzzy Season Padding (weeks)
ur: فجی سیزن پیڈنگ (ہفتے)

source: Fuzzy Season Padding
ur: فجی سیزن پیڈنگ

source: Multiplier if Date is Uncertain (?)
ur: اگر تاریخ غیر یقینی ہے تو ضرب (؟)

source: Multiplier if Uncertain
ur: اگر غیر یقینی ہو تو ضرب

source: Multiplier if Date is Approximate (~)
ur: ضرب اگر تاریخ تخمینی ہے (~)

source: Multiplier if Approximate
ur: ضرب اگر تخمینی ہو۔

source: Multiplier if Both (? and ~)
ur: ضرب اگر دونوں (؟ اور ~)

source: Multiplier if Both
ur: ضرب اگر دونوں

source: Maximum Number of Files
ur: فائلوں کی زیادہ سے زیادہ تعداد

source: Save Edits
ur: ترامیم کو محفوظ کریں۔

source: Discard Edits
ur: ترامیم کو مسترد کریں۔

source: Layer Preview
ur: پرت کا پیش نظارہ

source: Activated:
ur: چالو:

source: Layer Name:
ur: پرت کا نام:

source: Add to search map by default:
ur: بطور ڈیفالٹ تلاش کے نقشے میں شامل کریں:

source: Layer icon:
ur: پرت کا آئیکن:

source: Find an icon
ur: ایک آئیکن تلاش کریں۔

source: Legend content:
ur: افسانوی مواد:

source: Advanced:
ur: اعلی درجے کی:

source: Layer has no data - data on map is for preview purposes. This layer will not show up in map overlays until data is added.
ur: پرت میں کوئی ڈیٹا نہیں ہے - نقشے پر موجود ڈیٹا پیش نظارہ کے مقاصد کے لیے ہے۔ یہ پرت نقشہ کے اوورلیز میں اس وقت تک نظر نہیں آئے گی جب تک ڈیٹا شامل نہیں کیا جاتا ہے۔

source: Point Style
ur: پوائنٹ اسٹائل

source: Color
ur: رنگ

source: Halo color
ur: ہیلو کا رنگ

source: Halo Color
ur: ہیلو کلر

source: Halo radius
ur: ہالو رداس

source: Line Style
ur: لائن اسٹائل

source: Weight
ur: وزن

source: Halo weight
ur: ہیلو وزن

source: Polygon Style
ur: کثیر الاضلاع انداز

source: Fill Color
ur: رنگ بھریں

source: Outline color
ur: آؤٹ لائن کا رنگ

source: Outline weight
ur: خاکہ کا وزن

source: Cluster Distance:
ur: کلسٹر فاصلہ:

source: Cluster Max Zoom:
ur: کلسٹر میکس زوم:

source: Cluster Min Points:
ur: کلسٹر من پوائنٹس:

source: Vector Simplification:
ur: ویکٹر کی آسانیاں:

source: Changes to cluster settings will only be reflected after saving.
ur: کلسٹر کی ترتیبات میں تبدیلیاں صرف محفوظ کرنے کے بعد ظاہر ہوں گی۔

source: Preview map data do not use clustering algorithm. Add data for this resource model to see real clustered data.
ur: پیش نظارہ نقشہ ڈیٹا کلسٹرنگ الگورتھم استعمال نہیں کرتا ہے۔ اصلی کلسٹرڈ ڈیٹا دیکھنے کے لیے اس ریسورس ماڈل کے لیے ڈیٹا شامل کریں۔

source: The following users and groups can view this layer. If you wish to change who can access this layer, please update the permissions on the layer node.
ur: درج ذیل صارفین اور گروپ اس پرت کو دیکھ سکتے ہیں۔ اگر آپ یہ تبدیل کرنا چاہتے ہیں کہ کون اس پرت تک رسائی حاصل کرسکتا ہے، تو براہ کرم لیئر نوڈ پر اجازتوں کو اپ ڈیٹ کریں۔

source: Users
ur: صارفین

source: Groups
ur: گروپس

source: Related Node
ur: متعلقہ نوڈ

source: Select a node
ur: ایک نوڈ منتخب کریں۔

source: Relationship to Node
ur: نوڈ سے تعلق

source: Select a property
ur: ایک پراپرٹی منتخب کریں۔

source: Value
ur: ویلیو

source: Resource Model
ur: ریسورس ماڈل

source: Default relationship to
ur: سے طے شدہ رشتہ

source: Select an Ontology Property
ur: آنٹولوجی پراپرٹی منتخب کریں۔

source: Default inverse relationship to
ur: سے پہلے سے طے شدہ الٹا تعلق

source: Search String - use to filter resources displayed
ur: سرچ سٹرنگ - دکھائے گئے وسائل کو فلٹر کرنے کے لیے استعمال کریں۔

source: View search string...
ur: تلاش کی تار دیکھیں...

source: Enter Search String here...
ur: یہاں سرچ سٹرنگ درج کریں...

source: References
ur: حوالہ جات

source: Does not reference
ur: حوالہ نہیں دیتا

source: Select a resource
ur: ریسورس منتخب کریں

source: Like
ur: پسند

source: Not like
ur: پسند نہیں

source: Is Not
ur: نہیں ہے

source: Edit
ur: ترمیم

source: Unable to display the selected file
ur: منتخب فائل کو ظاہر کرنے سے قاصر

source: This file can't be displayed.
ur: اس فائل کو ڈسپلے نہیں کیا جا سکتا۔

source: It may be a proprietary format or there isn't a loader available yet
ur: یہ ایک ملکیتی فارمیٹ ہو سکتا ہے یا ابھی تک کوئی لوڈر دستیاب نہیں ہے۔

source: to present it in this webpage.
ur: اس ویب پیج میں شامل کرنے کے لیے۔

source: Unable to parse your file with the
ur: آپ کی فائل کو کے ساتھ پارس کرنے سے قاصر ہے۔

source: loader
ur: لوڈر

source: Select File Loader
ur: فائل لوڈر کو منتخب کریں۔

source: Select the loader best suited for processing and visualizing the selected file
ur: منتخب فائل کو پروسیسنگ اور ویژولائز کرنے کے لیے سب سے موزوں لوڈر منتخب کریں۔

source: Select
ur: منتخب کریں۔

source: Apply the same loader to all selected files in the dataset
ur: ڈیٹاسیٹ میں تمام منتخب فائلوں پر ایک ہی لوڈر کا اطلاق کریں۔

source: Upload Files
ur: فائلیں اپ لوڈ کرو

source: Drag & Drop your files onto this panel to upload
ur: اپ لوڈ کرنے کے لیے اپنی فائلوں کو اس پینل پر گھسیٹیں اور چھوڑیں۔

source: Select Files
ur: فائلیں منتخب کریں۔

source: Adding files to this record is
ur: اس ریکارڈ میں فائلوں کو شامل کرنا ہے۔

source: optional.
ur: اختیاری.

source: You may upload as many files as you wish; check with the site admin on the maximum file size.
ur: آپ جتنی فائلیں چاہیں اپ لوڈ کر سکتے ہیں۔ زیادہ سے زیادہ فائل سائز پر سائٹ کے منتظم سے چیک کریں۔

source: Images formatted as .jpg, .png files may be uploaded. Other formats may require a loader to view.
ur: .jpg، .png فائلوں کے بطور فارمیٹ کردہ تصاویر اپ لوڈ کی جا سکتی ہیں۔ دیگر فارمیٹس کو دیکھنے کے لیے لوڈر کی ضرورت پڑ سکتی ہے۔

source: File Filter
ur: فائل فلٹر

source: e.g.: .txt
ur: مثال کے طور پر: txt

source: files uploaded
ur: فائلیں اپ لوڈ کیں۔

source: files selected
ur: فائلوں کو منتخب کیا

source: add files
ur: فائلیں شامل کریں

source: Select All
ur: تمام منتخب کریں

source: Clear All
ur: تمام کو صاف کریں

source: Delete Selected
ur: منتخب کردہ کو ڈیلیٹ کریں

source: Download Selected
ur: ڈاؤن لوڈ سلیکٹڈ

source: Loader
ur: لوڈر

source: 'File Renderer'
ur: 'فائل رینڈرر'

source: Apply to Selected Files
ur: منتخب فائلوں پر اپلائی کریں۔

source: Currently showing edits by
ur: فی الحال ترمیمات دکھا رہا ہے۔

source: Save
ur: محفوظ کریں۔

source: Display Name
ur: ڈسپلے کا نام

source: Display Description
ur: ڈسپلے کی تفصیل

source: Map Popup
ur: نقشہ پاپ اپ

source: Re-Index
ur: دوبارہ انڈیکس

source: Card Name
ur: کارڈ کا نام

source: Select a card from which to choose nodes to power your primary name identifier.
ur: ایک کارڈ منتخب کریں جس سے آپ کے بنیادی نام کے شناخت کنندہ کو طاقت دینے کے لیے نوڈس کا انتخاب کرنا ہے۔

source: Primary Name Template
ur: بنیادی نام کا سانچہ

source: Use bracketed node names like this: <node name>
ur: بریکٹڈ نوڈ کے نام اس طرح استعمال کریں: <node name>

source: Select a card from which to choose nodes to power your primary description identifier.
ur: ایک کارڈ منتخب کریں جس سے آپ کے بنیادی وضاحتی شناخت کنندہ کو طاقت دینے کے لیے نوڈس کا انتخاب کرنا ہے۔

source: Primary Description Template
ur: بنیادی تفصیل کا سانچہ

source: Map Popup Template
ur: نقشہ پاپ اپ ٹیمپلیٹ

source: If you've made any changes to this function and there are resources already in the system, then you will need to reindex the resources to reflect your changes. This process can take some time (potentially several minuetes or more). Please be patient.
ur: اگر آپ نے اس فنکشن میں کوئی تبدیلی کی ہے اور سسٹم میں پہلے سے وسائل موجود ہیں، تو آپ کو اپنی تبدیلیوں کی عکاسی کرنے کے لیے وسائل کو دوبارہ ترتیب دینے کی ضرورت ہوگی۔ اس عمل میں کچھ وقت لگ سکتا ہے (ممکنہ طور پر کئی منٹ یا اس سے زیادہ)۔ برائے مہربانی صبر کریں۔

source: Re-Index Resources Now
ur: اب وسائل کو دوبارہ انڈیکس کریں۔

source: Re-Indexing...
ur: دوبارہ انڈیکس کرنا...

source: searching....
ur: تلاش کر رہا ہے....

source: Hide Style Tools
ur: اسٹائل ٹولز چھپائیں۔

source: Show Style Tools
ur: اسٹائل ٹولز دکھائیں۔

source: Line Color
ur: لائن کا رنگ

source: Line Color
ur: لائن کا رنگ

source: Fill color
ur: رنگ بھریں

source: Fill Color
ur: رنگ بھریں

source: Line Opacity
ur: لائن کی دھندلاپن

source: Add a new feature...
ur: ایک نئی خصوصیت شامل کریں...

source: Resource Model:
ur: ریسورس ماڈل:

source: Report
ur: رپورٹ

source: Image
ur: تصویر

source: Image Tools
ur: تصویری ٹولز

source: Brightness
ur: چمک

source: Contrast
ur: کنٹراسٹ

source: Saturation
ur: سیچوریشن

source: Greyscale
ur: گرے اسکیل

source: Display as greyscale
ur: گرے اسکیل کے بطور ڈسپلے کریں

source: Reset to defaults
ur: ڈیفالٹس پر ری سیٹ کریں

source: Annotation Overlays
ur: تشریح اوورلیز

source: Gallery
ur: گیلری

source: hide
ur: چھپائیں

source: show
ur: دکھائیں

source: Select a manifest:
ur: ایک مینی فیسٹ منتخب کریں:

source: Load manifest
ur: لوڈ مینی فیسٹ

source: Loading manifest...
ur: مینی فیسٹ لوڈ ہو رہا ہے...

source: Error loading manifest...
ur: مینی فیسٹ لوڈ کرنے میں خرابی...

source: No manifest selected...
ur: کوئی مینی فیسٹ منتخب نہیں کیا گیا...

source: Filter
ur: فلٹر

source: Filter images...
ur: تصاویر کو فلٹر کریں...

source: Switch Image Service
ur: تصویری سروس سوئچ کریں۔

source: Annotation(s)
ur: تشریح

source: Update Features
ur: خصوصیات کو اپ ڈیٹ کریں۔

source: GeoJSON has the following errors that must be resolved:
ur: GeoJSON میں درج ذیل خرابیاں ہیں جنہیں حل کرنا ضروری ہے:

source: Drag GeoJSON or KML files here to add...
ur: GeoJSON یا KML فائلوں کو شامل کرنے کے لیے یہاں گھسیٹیں...

source: The following errors occurred:
ur: درج ذیل خرابیاں پیش آئیں:

source: Edit GeoJSON
ur: GeoJSON میں ترمیم کریں۔

source: Add Buffer
ur: بفر شامل کریں۔

source: Zoom to all
ur: سب کو زوم کریں۔

source: Basemap
ur: بیس نقشہ

source: Legend
ur: لیجنڈ

source: Triggering Nodegroups
ur: نوڈ گروپس کو متحرک کرنا

source: Select a nodegroup
ur: نوڈ گروپ منتخب کریں۔

source: Download File
ur: ڈاؤن لوڈ فائل

source: Dismiss
ur: برطرف کرنا

source: View Gallery
ur: گیلری دیکھیں

source: Upload Photographs
ur: تصاویر اپ لوڈ کریں۔

source: Drag & Dop your photos onto this panel to upload
ur: اپ لوڈ کرنے کے لیے اپنی تصاویر کو اس پینل پر گھسیٹیں اور ڈوپ کریں۔

source: Select Photographs
ur: تصاویر منتخب کریں۔

source: Adding photos to this record is <span><strong>optional.</strong></span>
ur: اس ریکارڈ میں تصاویر شامل کرنا <span><strong>اختیاری ہے۔</strong></span>

source: You may upload as many photos as you wish, but the maximum size of any single file is <span>8MB</span>
ur: آپ جتنی تصاویر چاہیں اپ لوڈ کر سکتے ہیں، لیکن کسی ایک فائل کا زیادہ سے زیادہ سائز <span>8MB</span> ہے۔

source: Images formatted as .jpg, .png, .tiff files may be uploaded. Other formats will be ignored.
ur: .jpg، .png، .tiff فائلوں کے بطور فارمیٹ کردہ تصاویر اپ لوڈ کی جا سکتی ہیں۔ دیگر فارمیٹس کو نظر انداز کر دیا جائے گا۔

source: Drag & Dop your photos onto this panel
ur: اپنی تصاویر کو اس پینل پر گھسیٹیں اور ڈوپ کریں۔

source: Accepted formats: .jpg, .png, .tiff
ur: قبول شدہ فارمیٹس: .jpg, .png, .tiff

source: Image List
ur: تصویری فہرست

source: Service
ur: سروس

source: Canvas
ur: کینوس

source: Manage Image Service
ur: امیج سروس کا نظم کریں۔

source: Title
ur: عنوان

source: Attribution
ur: انتساب

source: Attribution Logo
ur: انتساب کا لوگو

source: Metadata
ur: میٹا ڈیٹا

source: Manage Image Canvases
ur: تصویری کینوس کا نظم کریں۔

source: Images
ur: تصاویر

source: Select image to delete from the image service
ur: تصویر کی خدمت سے حذف کرنے کے لیے تصویر منتخب کریں۔

source: Drag or
ur: گھسیٹیں یا

source: click here
ur: یہاں کلک کریں

source: to upload photos
ur: تصاویر اپ لوڈ کرنے کے لیے

source: Selected Image Name
ur: منتخب کردہ تصویری نام

source: Create New Service
ur: نئی سروس بنائیں

source: Edit a service
ur: سروس میں ترمیم کریں۔

source: Drag & Drop Your Images Here
ur: اپنی تصاویر کو یہاں گھسیٹیں اور چھوڑیں۔

source: Import digital images and create a new image service
ur: ڈیجیٹل تصاویر درآمد کریں اور ایک نئی امیج سروس بنائیں

source: Select Images
ur: تصاویر منتخب کریں

source: Create a new service by uploading one or more images. Images will be uploaded and processes so that you can view, annotate, and share them with others
ur: ایک یا زیادہ تصاویر اپ لوڈ کرکے ایک نئی سروس بنائیں۔ امیجز کو اپ لوڈ کیا جائے گا اور عمل کیا جائے گا تاکہ آپ انہیں دیکھ سکیں، تشریح کر سکیں اور دوسروں کے ساتھ ان کا اشتراک کر سکیں

source: Edit an existing Image Service
ur: موجودہ امیج سروس میں ترمیم کریں۔

source: Update the information and images related to an existing Image Service. Or copy and paste in the URL of a IIIF Manifest to add a service from an external service
ur: موجودہ امیج سروس سے متعلق معلومات اور تصاویر کو اپ ڈیٹ کریں۔ یا کسی بیرونی سروس سے سروس شامل کرنے کے لیے IIIF مینی فیسٹ کے URL میں کاپی اور پیسٹ کریں۔

source: Create Image Service
ur: امیج سروس بنائیں

source: dismiss
ur: برطرف

source: Insert Workflow Name
ur: ورک فلو کا نام داخل کریں۔

source: Save and Complete Workflow
ur: محفوظ کریں اور ورک فلو کو مکمل کریں۔

source: Delete Workflow
ur: ورک فلو کو ڈیلیٹ کریں

source: Detailed Step Information
ur: تفصیلی مرحلہ کی معلومات

source: Previous Step
ur: پچھلا قدم

source: Save and Continue
ur: محفوظ کریں اور جاری رکھیں

source: Next Step
ur: اگلا قدم

source: Data Themes
ur: ڈیٹا تھیمز

source: Info
ur: معلومات

source: Resource Information
ur: ریسورس کی معلومات

source: Has relationship
ur: تعلق ہے۔

source: with
ur: ساتھ

source: Relationships
ur: رشتے

source: relationships shown
ur: تعلقات دکھائے گئے

source: Load more
ur: مزید لوڈ کریں

source: Search Network
ur: سرچ نیٹ ورک

source: Filter...
ur: فلٹر...

source: Analyze Network
ur: نیٹ ورک کا تجزیہ کریں۔

source: Click a node/edge for info
ur: معلومات کے لیے نوڈ/کنارے پر کلک کریں۔

source: Click a node to show more relationships
ur: مزید رشتے دکھانے کے لیے نوڈ پر کلک کریں۔

source: Click a node refocus
ur: نوڈ ری فوکس پر کلک کریں۔

source: Click a node/edge to remove
ur: ہٹانے کے لیے نوڈ/کنارے پر کلک کریں۔

source: Participating Layers
ur: حصہ لینے والی پرتیں۔

source: Buffer Intersecting Feature
ur: بفر انٹرسیکٹنگ فیچر

source: buffer
ur: بفر

source: Add buffer to features
ur: خصوصیات میں بفر شامل کریں۔

source: Select a feature to perform intersection
ur: تقطیع انجام دینے کے لیے ایک خصوصیت منتخب کریں۔

source: Intersect
ur: ایک دوسرے کو کاٹنا

source: Find
ur: مل

source: Search Facets
ur: تلاش کے پہلو

source: Find ...
ur: مل ...

source: Advanced Search
ur: اعلی درجے کی تلاش

source: With Advanced Search you can build more sophisticated search queries.
ur: اعلی درجے کی تلاش کے ساتھ آپ مزید نفیس تلاش کے سوالات بنا سکتے ہیں۔

source: Select the search facets you wish to query from the list on the right. Then enter your
ur: دائیں طرف کی فہرست سے تلاش کے وہ پہلو منتخب کریں جن سے آپ استفسار کرنا چاہتے ہیں۔ پھر اپنا درج کریں۔

source: criteria to customize your search filters
ur: آپ کے تلاش کے فلٹرز کو اپنی مرضی کے مطابق کرنے کا معیار

source: And
ur: اور

source: Or
ur: یا

source: Remove
ur: دور

source: Map Search
ur: نقشہ تلاش کریں۔

source: Buffer
ur: بفر

source: Distance
ur: فاصلے

source: Select a filter
ur: ایک فلٹر منتخب کریں۔

source: Draw a...
ur: ایک ڈرا...

source: Accept GeoJSON
ur: GeoJSON کو قبول کریں۔

source: Zoom to all features
ur: تمام خصوصیات کو زوم کریں۔

source: Clear spatial filter
ur: مقامی فلٹر صاف کریں۔

source: QA Type
ur: QA کی قسم

source: All edits
ur: تمام ترامیم

source: Resource Type
ur: ریسورس کی قسم

source: All resources
ur: تمام وسائل

source: Saved Search
ur: محفوظ کردہ تلاش
