Repository: junaidabduljabbar/arches7-internationalization
Catalog: translated_out.po
Languages: ur

source: Arches uses the mbtiles that you specific to ensure that your field crew has a basemap, even when they do not have access to a cell network or WiFi connection. You can create an mbtile file using your own geospatial data and GIS tools. Or you can obtain high quality and inexpensive mbtiles from sites such as <strong><a href="https://openmaptiles.com" class="" target="_blank">https://openmaptiles.com</a></strong>. Note that large files will require longer downloads and more storage space on mobile devices.
ur: آرچز ان ایم بی ٹائلز کا استعمال کرتے ہیں جو آپ نے اس بات کو یقینی بنانے کے لیے مخصوص کیے ہیں کہ آپ کے فیلڈ کے عملے کے پاس بیس میپ ہے، یہاں تک کہ جب ان کے پاس سیل نیٹ ورک یا وائی فائی کنکشن تک رسائی نہ ہو۔ آپ اپنے جیو اسپیشل ڈیٹا اور GIS ٹولز کا استعمال کرتے ہوئے ایک mbtile فائل بنا سکتے ہیں۔ یا آپ <strong><a href="https://openmaptiles.com" class="" target="_blank">https://openmaptiles.com</a> جیسی سائٹس سے اعلیٰ معیار اور سستے ایم بی ٹائل حاصل کر سکتے ہیں۔ </strong> نوٹ کریں کہ بڑی فائلوں کو موبائل آلات پر زیادہ ڈاؤن لوڈ اور زیادہ اسٹوریج کی جگہ درکار ہوگی۔

source: Online Basemap URL
ur: آن لائن بیس میپ URL

source: Arches uses the Online Basemap URL that you specify as the default basemap for your field team when a cell network or WiFi connection is available. You may use your own map service, or any online basemap service (such as those created with ESRI, GeoServer, or other mapping servers). You will need to reference or create and host a MapBox style json file (see <strong><a href="https://docs.mapbox.com/mapbox-gl-js/style-spec" class="" target="_blank">https://docs.mapbox.com/mapbox-gl-js/style-spec</a></strong>)
ur: آرچز آن لائن بیس میپ یو آر ایل کا استعمال کرتا ہے جسے آپ سیل نیٹ ورک یا وائی فائی کنکشن دستیاب ہونے پر اپنی فیلڈ ٹیم کے لیے ڈیفالٹ بیس میپ کے طور پر بیان کرتے ہیں۔ آپ اپنی خود کی نقشہ خدمت، یا کوئی بھی آن لائن بیس میپ سروس (جیسے ESRI، GeoServer، یا دیگر میپنگ سرورز کے ساتھ تخلیق کردہ) استعمال کر سکتے ہیں۔ آپ کو MapBox طرز کی json فائل کا حوالہ دینے یا تخلیق کرنے اور میزبانی کرنے کی ضرورت ہوگی (دیکھیں <strong><a href="https://docs.mapbox.com/mapbox-gl-js/style-spec" class="" target= "_blank">https://docs.mapbox.com/mapbox-gl-js/style-spec</a></strong>)

source: These options cannot be modified because users have already synced with this project.
ur: ان اختیارات میں ترمیم نہیں کی جا سکتی کیونکہ صارفین پہلے ہی اس پروجیکٹ کے ساتھ ہم آہنگ ہو چکے ہیں۔

source: Data entry cards selected for this project:
ur: اس پروجیکٹ کے لیے منتخب کردہ ڈیٹا انٹری کارڈز:

source: Model Data Collection
ur: ماڈل ڈیٹا کلیکشن

source: Arches allows you to create and edit data in the field using mobile devices. Select those resources that should participate <br>in the project. Once you have selected the models, click on a model in the tree to <br> select which data entry forms to include in your project.
ur: محراب آپ کو موبائل آلات کا استعمال کرتے ہوئے فیلڈ میں ڈیٹا بنانے اور اس میں ترمیم کرنے کی اجازت دیتا ہے۔ ان وسائل کو منتخب کریں جو پروجیکٹ میں حصہ لیں ایک بار جب آپ ماڈلز کو منتخب کر لیتے ہیں، تو درخت میں موجود ماڈل پر کلک کریں <br> منتخب کریں کہ آپ کے پروجیکٹ میں کون سے ڈیٹا انٹری فارم شامل کیے جائیں۔

source: Allow users to download data
ur: صارفین کو ڈیٹا ڈاؤن لوڈ کرنے کی اجازت دیں۔

source: Downloading data allows users to access and edit existing Arches information in the field. You can decide which models your field team can access, and the number of resources to download.
ur: ڈیٹا ڈاؤن لوڈ کرنا صارفین کو فیلڈ میں موجود آرچز کی معلومات تک رسائی اور ترمیم کرنے کی اجازت دیتا ہے۔ آپ فیصلہ کر سکتے ہیں کہ آپ کی فیلڈ ٹیم کن ماڈلز تک رسائی حاصل کر سکتی ہے، اور ڈاؤن لوڈ کرنے کے لیے وسائل کی تعداد۔

source: Download Details
ur: تفصیلات ڈاؤن لوڈ کریں

source: Limit
ur: حد

source: Total number of instances to download for the resource models you've associated with this project.
ur: آپ نے اس پروجیکٹ سے منسلک وسائل کے ماڈلز کے لیے ڈاؤن لوڈ کرنے کے لیے مثالوں کی کل تعداد۔

source: Download Records
ur: ریکارڈ ڈاؤن لوڈ کریں

source: Custom Download
ur: کسٹم ڈاؤن لوڈ

source: To define records for download
ur: ڈاؤن لوڈ کے لیے ریکارڈ کی وضاحت کرنے کے لیے

source: copy and paste the URL from Arches search page
ur: آرچز سرچ پیج سے یو آر ایل کاپی اور پیسٹ کریں۔

source: Project Participants
ur: پروجیکٹ کے شرکاء

source: Arches allows you to select the user groups you want to include in a field data collection effort. <br> Select the groups that should participate in the project. Once you have selected the groups, click on a group in <br> the tree to select specific users who should join your survery.
ur: محراب آپ کو ان صارف گروپوں کو منتخب کرنے کی اجازت دیتا ہے جنہیں آپ فیلڈ ڈیٹا اکٹھا کرنے کی کوشش میں شامل کرنا چاہتے ہیں۔ <br> ان گروپس کو منتخب کریں جنہیں پروجیکٹ میں حصہ لینا چاہیے۔ ایک بار جب آپ گروپس کو منتخب کر لیتے ہیں، تو <br> درخت میں ایک گروپ پر کلک کریں تاکہ مخصوص صارفین کو منتخب کیا جا سکے جنہیں آپ کے سروے میں شامل ہونا چاہیے۔

source: Accounts in this group
ur: اس گروپ میں اکاؤنٹس

source: Find a user...
ur: ایک صارف تلاش کریں...

source: Select all
ur: تمام منتخب کریں

source: Clear all
ur: تمام کو صاف کریں

source: Account Summary
ur: اکاؤنٹ کا خلاصہ

source: User identification and data editing statistics
ur: صارف کی شناخت اور ڈیٹا میں ترمیم کے اعدادوشمار

source: Not set
ur: سیٹ نہیں ہے

source: User Name
ur: صارف کا نام

source: User Email
ur: صارف کا ای میل

source: Assigned Groups
ur: تفویض کردہ گروپس

source: Not yet synced
ur: ابھی تک مطابقت پذیر نہیں ہے۔

source: Last Synch
ur: آخری مطابقت پذیری

source: 'Name'
ur: 'نام'

source: 'Manage users that participate in this project'
ur: 'اس پروجیکٹ میں حصہ لینے والے صارفین کا نظم کریں'

source: 'Model Details'
ur: 'ماڈل کی تفصیلات'

source: 'Summary of how this model participates in the project'
ur: 'اس ماڈل کے منصوبے میں حصہ لینے کے طریقہ کا خلاصہ'

source: 'Summary'
ur: 'خلاصہ'

source: 'Project summary and status'
ur: 'پروجیکٹ کا خلاصہ اور حیثیت'

source: 'Settings'
ur: 'سیٹنگز'

source: 'Project Settings'
ur: 'پروجیکٹ سیٹنگز'

source: 'Define data collection parameters for your project'
ur: 'اپنے پروجیکٹ کے لیے ڈیٹا اکٹھا کرنے کے پیرامیٹرز کی وضاحت کریں'

source: 'Map Extent'
ur: 'نقشہ کی حد'

source: 'Draw a polygon to define the area over which you want to collect data in this survery'
ur: 'اس علاقے کی وضاحت کرنے کے لیے ایک کثیرالاضلاع کھینچیں جس پر آپ اس سروے میں ڈیٹا اکٹھا کرنا چاہتے ہیں'

source: 'Map Sources'
ur: 'نقشہ کے ذرائع'

source: 'Basemap Source'
ur: 'بیس میپ ماخذ'

source: 'Provide a basemap source url. Use an offline source for users without access to cell/wi-fi service'
ur: 'بیس میپ سورس یو آر ایل فراہم کریں۔ سیل/وائی فائی سروس تک رسائی کے بغیر صارفین کے لیے آف لائن ذریعہ استعمال کریں'

source: 'Models'
ur: 'ماڈلز'

source: 'Summary of models in this project'
ur: 'اس پروجیکٹ میں ماڈلز کا خلاصہ'

source: 'Data'
ur: 'ڈیٹا'

source: 'Data Download'
ur: 'ڈیٹا ڈاؤن لوڈ'

source: 'Define the data you will allow users to download'
ur: 'اس ڈیٹا کی وضاحت کریں جسے آپ صارفین کو ڈاؤن لوڈ کرنے کی اجازت دیں گے'

source: 'People'
ur: 'لوگ'

source: 'Summary of people invited to participate in this project'
ur: 'اس پروجیکٹ میں شرکت کے لیے مدعو افراد کا خلاصہ'

source: 'Select one or more groups...'
ur: 'ایک یا زیادہ گروپس کو منتخب کریں...'

source: 'Select one or more resource models...'
ur: 'ایک یا زیادہ ریسورس ماڈل منتخب کریں...'

source: 'Preparing project - this may take a few minutes'
ur: 'پروجیکٹ کی تیاری - اس میں چند منٹ لگ سکتے ہیں'

source: Mobile Data Collection
ur: موبائل ڈیٹا کلیکشن

source: Create a Project
ur: ایک پروجیکٹ بنائیں

source: Arches allows you to create and edit data in the field using mobile devices such as
ur: محراب آپ کو موبائل آلات کا استعمال کرتے ہوئے فیلڈ میں ڈیٹا بنانے اور اس میں ترمیم کرنے کی اجازت دیتا ہے جیسے

source: Android and iOS phones or tablets. Projects are a way to define the time, location, content, and
ur: اینڈرائیڈ اور آئی او ایس فونز یا ٹیبلٹس۔ پروجیکٹس وقت، مقام، مواد، اور کی وضاحت کرنے کا ایک طریقہ ہیں۔

source: participants of a field data collection effort
ur: فیلڈ ڈیٹا اکٹھا کرنے کی کوشش کے شرکاء

source: New Project
ur: نیا پروجیکٹ

source: Find a project...
ur: پروجیکٹ تلاش کریں...

source: Unnamed Project
ur: بے نام پروجیکٹ

source: to
ur: کو

source: (expired)
ur: (میعاد ختم)

source: Date range unspecified
ur: تاریخ کی حد غیر متعین ہے۔

source: delete
ur: ڈیلیٹ

source: Dismiss All
ur: سب ختم کرو، سب بر خاست کرو

source: You're up-to-date and do not have any notifications. When you trigger a notification (for example, when you request a large download) it will display here.
ur: آپ اپ ٹو ڈیٹ ہیں اور آپ کے پاس کوئی اطلاع نہیں ہے۔ جب آپ کسی اطلاع کو متحرک کرتے ہیں (مثال کے طور پر، جب آپ بڑے ڈاؤن لوڈ کی درخواست کرتے ہیں) تو یہ یہاں ظاہر ہوگا۔

source: Youngest to oldest
ur: سب سے کم عمر سے بوڑھے تک

source: You have not yet edited any data within the specified time period. Once you edit a resource, your edit history will display here.
ur: آپ نے ابھی تک مخصوص مدت کے اندر کسی بھی ڈیٹا میں ترمیم نہیں کی ہے۔ ایک بار جب آپ کسی وسائل میں ترمیم کرتے ہیں، تو آپ کی ترمیم کی سرگزشت یہاں ظاہر ہوگی۔

source: Resource has been deleted
ur: ریسورس کو ڈیلیٹ کر دیا گیا ہے

source: Card:
ur: کارڈ:

source: Edited:
ur: ترمیم شدہ:

source: pending review
ur: زیر التواء جائزہ

source: declined
ur: انکار کر دیا

source: accepted
ur: قبول کر لیا

source: Add Top Concept
ur: اوپر کا تصور شامل کریں۔

source: Import Top Concept from SPARQL
ur: SPARQL سے ٹاپ تصور درآمد کریں۔

source: Add Child
ur: بچے کو شامل کریں۔

source: Import Child from SPARQL
ur: SPARQL سے بچہ درآمد کریں۔

source: Manage Parents
ur: والدین کا انتظام کریں۔

source: Make Collection
ur: کلیکشن بنائیں

source: Import Child from AAT
ur: AAT سے بچہ درآمد کریں۔

source: Labels
ur: لیبلز

source: Add label
ur: لیبل شامل کریں

source: Delete this label?
ur: اس لیبل کو ڈیلیٹ کریں؟

source: preferred
ur: ترجیحی

source: alternate
ur: متبادل

source: hidden
ur: چھپا ہوا

source: Notes
ur: نوٹس

source: Add note
ur: نوٹ شامل

source: Delete this note?
ur: اس نوٹ کو ڈیلیٹ کریں؟

source: Broader/Narrower Concepts
ur: وسیع تر/تنگ تصورات

source: Delete this concept?
ur: اس کانسپٹ کو ڈیلیٹ کریں؟

source: By deleting this concept, you will also be deleting the following concepts as well. This operation cannot be undone.
ur: اس تصور کو حذف کرنے سے، آپ درج ذیل تصورات کو بھی حذف کر رہے ہوں گے۔ اس آپریشن کو کالعدم نہیں کیا جا سکتا۔

source: Related Concepts
ur: متعلقہ تصورات

source: Add related concept
ur: متعلقہ تصور شامل کریں۔

source: Remove the relationship to this concept?
ur: اس تصور سے تعلق کو ہٹا دیں؟

source: Values
ur: ویلیوز

source: Add value
ur: ویلیو شامل کریں

source: Delete this value?
ur: اس ویلیو کو ڈیلیٹ کریں؟

source: Edit this value
ur: اس قدر میں ترمیم کریں۔

source: Add images
ur: تصاویر شامل کریں

source: Delete Image
ur: تصویر کو ڈیلیٹ کریں

source: Arches ID:
ur: محراب کی شناخت:

source: Are you ready to delete this item?
ur: کیا آپ اس آئٹم کو ڈیلیٹ کرنے کے لیے تیار ہیں؟

source: No
ur: نہیں

source: Yes
ur: جی ہاں

source: Arches Reference Data Manager
ur: محرابوں کا حوالہ ڈیٹا مینیجر

source: Schemes
ur: سکیمیں

source: Entity Types
ur: ہستی کی اقسام

source: Member Hierarchy
ur: رکن کا درجہ بندی

source: Add dropdown entry
ur: ڈراپ ڈاؤن اندراج شامل کریں۔

source: Expand this entry
ur: اس اندراج کو وسعت دیں۔

source: Remove this entry from the dropdown
ur: اس اندراج کو ڈراپ ڈاؤن سے ہٹا دیں۔

source: Edit this label
ur: اس لیبل میں ترمیم کریں۔

source: Edit this note
ur: اس نوٹ میں ترمیم کریں۔

source: Add Concept
ur: تصور شامل کریں۔

source: Label
ur: لیبل

source: Note
ur: نوٹ

source: Relation from Parent
ur: والدین سے رشتہ

source: Save changes
ur: تبدیلیاں محفوظ کریں

source: ConceptScheme Name
ur: تصور اسکیم کا نام

source: Import Images
ur: امپورٹ امیجز

source: (Click on panel or drag and drop files onto panel to upload)
ur: (پینل پر کلک کریں یا اپ لوڈ کرنے کے لیے فائلوں کو پینل پر گھسیٹیں اور چھوڑیں)

source: Add Concept Scheme
ur: تصور اسکیم شامل کریں۔

source: Scope Note
ur: اسکوپ نوٹ

source: Select collection to delete
ur: حذف کرنے کے لیے بنائیں منتخب کریں۔

source: You won't be able to undo this operation!&nbsp; Are you sure you want to permanently delete this entire collection from Arches?
ur: آپ اس کارروائی کو کالعدم نہیں کر سکیں گے!&nbsp; کیا آپ واقعی آرچز سے اس پورے مجموعہ کو مستقل طور پر حذف کرنا چاہتے ہیں؟

source: Delete Scheme
ur: اسکیم کو ڈیلیٹ کریں

source: Select scheme to delete
ur: ڈیلیٹ کرنے کے لیے اسکیم منتخب کریں

source: You won't be able to undo this operation!&nbsp; Are you sure you want to permanently delete this entire scheme from Arches?
ur: آپ اس کارروائی کو کالعدم نہیں کر سکیں گے!&nbsp; کیا آپ واقعی آرچز سے اس پوری اسکیم کو مستقل طور پر حذف کرنا چاہتے ہیں؟

source: Export Scheme
ur: ایکسپورٹ سکیم

source: Select scheme to export
ur: برآمد کرنے کے لیے اسکیم منتخب کریں۔

source: Import Concept
ur: تصور درآمد کریں۔

source: Organization
ur: تنظیم

source: Concept Indentifiers
ur: تصور کی نشاندہی کرنے والے

source: Error
ur: ایرر

source: Import
ur: درآمد کریں۔

source: Import New Concept Scheme
ur: نئی تصور اسکیم درآمد کریں۔

source: SKOS File
ur: SKOS فائل

source: When concept ids match
ur: جب تصور کی شناختیں ملتی ہیں۔

source: overwrite system concept
ur: نظام کے تصور کو اوور رائٹ کریں۔

source: use system concept
ur: سسٹم کا تصور استعمال کریں۔

source: When inserting new concepts
ur: نئے تصورات داخل کرتے وقت

source: keep within scheme
ur: سکیم کے اندر رکھیں

source: stage in candidates
ur: امیدواروں میں مرحلہ

source: Upload File
ur: اپ لوڈ فائل

source: New Parent Concept
ur: والدین کا نیا تصور

source: Relation to Parent
ur: والدین سے تعلق

source: Current Parents
ur: موجودہ والدین

source: Remove the relationship to this parent concept
ur: اس والدین کے تصور سے تعلق کو ہٹا دیں۔

source: Remove the relationship to this parent concept.
ur: اس والدین کے تصور سے تعلق کو ہٹا دیں۔

source: Deleting reference to parent:
ur: والدین کا حوالہ حذف کرنا:

source: Manage Related Concepts
ur: متعلقہ تصورات کا نظم کریں۔

source: Select a concept
ur: ایک تصور منتخب کریں۔

source: Relation type
ur: رشتے کی قسم

source: Relation to Concept
ur: تصور سے تعلق

source: Use the search tool to select the concept that you want to relate.
ur: اس تصور کو منتخب کرنے کے لیے سرچ ٹول کا استعمال کریں جس سے آپ تعلق رکھنا چاہتے ہیں۔

source: Select Concept Values for Dropdowns
ur: ڈراپ ڈاؤن کے لیے کانسپٹ ویلیوز منتخب کریں۔

source: Selecting a concept will select that concept and all it's children.
ur: کسی تصور کو منتخب کرنے سے وہ تصور اور اس کے تمام بچے منتخب ہوں گے۔

source: Edit Concept Label
ur: تصور لیبل میں ترمیم کریں۔

source: Add Concept Label
ur: تصور کا لیبل شامل کریں۔

source: Manage Concept Label
ur: تصور لیبل کا نظم کریں۔

source: Label Information
ur: لیبل کی معلومات

source: Label type
ur: لیبل کی قسم

source: Only one preferred label may exist for each language.
ur: ہر زبان کے لیے صرف ایک ترجیحی لیبل موجود ہو سکتا ہے۔

source: Add Concept Note
ur: تصور نوٹ شامل کریں۔

source: Manage Concept Note
ur: تصوراتی نوٹ کا نظم کریں۔

source: Note Editor
ur: نوٹ ایڈیٹر

source: Only one note of each type may exist for each language.
ur: ہر زبان کے لیے ہر قسم کا صرف ایک نوٹ موجود ہو سکتا ہے۔

source: Add Concept Value
ur: کانسپٹ ویلیو شامل کریں

source: Manage Concept Values
ur: تصوراتی اقدار کا نظم کریں۔

source: Define a value
ur: قدر کی وضاحت کریں۔

source: Value type
ur: ویلیو کی قسم

source: Only one sort order value can be assigned to a concept.
ur: کسی تصور کو صرف ایک ترتیب کی قیمت تفویض کی جا سکتی ہے۔

source: Report Date:
ur: رپورٹ کی تاریخ:

source: Hide Null Values
ur: خالی ویلیوز کو چھپائیں

source: This resource has provisional edits (not displayed in this report) that are pending review
ur: اس وسیلے میں عارضی ترامیم ہیں (اس رپورٹ میں ظاہر نہیں کی گئی ہیں) جو زیر التواء جائزہ ہیں۔

source: This resource has provisional edits that are pending review
ur: اس وسیلہ میں عارضی ترامیم ہیں جن کا جائزہ زیر التواء ہے۔

source: Load More
ur: مزید لوڈ کریں

source: Load All
ur: تمام لوڈ کریں۔

source: No relationships added
ur: کوئی رشتہ شامل نہیں کیا گیا۔

source: Select image nodes to include...
ur: شامل کرنے کے لیے تصویری نوڈس منتخب کریں...

source: (Resource Instance Name)
ur: (وسائل مثال کا نام)

source: Add Tab
ur: ٹیب شامل کریں۔

source: Tab Name
ur: ٹیب کا نام

source: Select tab icon
ur: ٹیب آئیکن کو منتخب کریں۔

source: Select cards in this tab
ur: اس ٹیب میں کارڈز منتخب کریں۔

source: Resource Manager
ur: ریسورس مینیجر

source: Select a resource...
ur: ایک وسیلہ منتخب کریں...

source: Resources
ur: حوالہ جات

source: Create Resource
ur: وسائل بنائیں

source: Resource History
ur: وسائل کی تاریخ

source: Now
ur: ابھی

source: Most recent
ur: سب سے حالیہ

source: Oldest
ur: سب سے پرانا

source: By editor
ur: بذریعہ ایڈیٹر

source: By edit type
ur: ترمیم کی قسم کے مطابق

source: Record created by Arches with unique identifer
ur: منفرد شناخت کنندہ کے ساتھ آرچز کے ذریعہ تخلیق کردہ ریکارڈ

source: Created
ur: بن گیا

source: Tile Data
ur: ٹائل ڈیٹا

source: Provisional Tile Data
ur: عارضی ٹائل ڈیٹا

source: New Tile Data
ur: نیا ٹائل ڈیٹا

source: Previous Tile Data
ur: پچھلا ٹائل ڈیٹا

source: Previous Provisional Tile Data
ur: پچھلا عارضی ٹائل ڈیٹا

source: Deleted
ur: ڈیلیٹڈ

source: edited by
ur: کی طرف سے ترمیم

source: Resource Editor
ur: ریسورس ایڈیٹر

source: Manage Permissions
ur: اجازتوں کا نظم کریں۔

source: Update
ur: اپ ڈیٹ

source: You are about assign normal user access to this instance
ur: آپ اس مثال کے لیے عام صارف کی رسائی تفویض کرنے والے ہیں۔

source: Would you like to proceed?
ur: کیا آپ آگے بڑھنا چاہیں گے؟

source: Welcome to Arches' Resource Editor
ur: آرچز کے ریسورس ایڈیٹر میں خوش آمدید

source: You are about to create a new resource record. Select any data card from the list on the left and start entering information.
ur: آپ ایک نیا ریسورس ریکارڈ بنانے والے ہیں۔ بائیں طرف کی فہرست میں سے کوئی بھی ڈیٹا کارڈ منتخب کریں اور معلومات درج کرنا شروع کریں۔

source: Don't worry if you decide not to enter any data just yet.
ur: پریشان نہ ہوں اگر آپ ابھی کوئی ڈیٹا داخل نہ کرنے کا فیصلہ کرتے ہیں۔

source: Arches will create your new resource record once you've saved a data entry card.
ur: آپ کے ڈیٹا انٹری کارڈ کو محفوظ کرنے کے بعد آرچز آپ کا نیا ریسورس ریکارڈ بنائے گا۔

source: No cards are available for this model.
ur: اس ماڈل کے لیے کوئی کارڈ دستیاب نہیں ہے۔

source: Add new
ur: نیا شامل کریں

source: You do not have permission to edit this card.
ur: آپ کو اس کارڈ میں ترمیم کرنے کی اجازت نہیں ہے۔

source: Decline all unaccepted edits
ur: تمام ناقابل قبول ترامیم کو مسترد کریں۔

source: User:
ur: صارف:

source: Created:
ur: بن گیا :

source: Accept
ur: قبول کریں

source: Decline
ur: رد کرنا

source: Resource Instance Permissions
ur: وسائل کی مثال کی اجازت

source: Configure Access to this Instance
ur: اس مثال تک رسائی کو ترتیب دیں۔

source: Define access privileges for this instance. You may limit access to yourself, or select which user accounts and groups have permission to this resource.
ur: اس مثال کے لیے رسائی کے مراعات کی وضاحت کریں۔ آپ خود تک رسائی کو محدود کر سکتے ہیں، یا منتخب کر سکتے ہیں کہ کن صارف اکاؤنٹس اور گروپس کو اس وسیلہ کی اجازت ہے۔

source: Set Permissions for this instance
ur: اس مثال کے لیے اجازتیں سیٹ کریں۔

source: By default only you have access to this record. You can set permissions for specific people or groups by selecting to whom you will grant access
ur: پہلے سے طے شدہ طور پر صرف آپ کو اس ریکارڈ تک رسائی حاصل ہے۔ آپ مخصوص لوگوں یا گروپس کے لیے اجازتیں سیٹ کر سکتے ہیں یہ منتخب کر کے کہ آپ کس کو رسائی دیں گے۔

source: Person/Group
ur: شخص/گروپ

source: Allow Normal Access
ur: عام رسائی کی اجازت دیں۔

source: Related Resources Editor
ur: متعلقہ وسائل ایڈیٹر

source: Add Related Resources
ur: متعلقہ وسائل شامل کریں۔

source: Arches allows you to define relationships between resources so you can better understand the context and interplay
ur: محراب آپ کو وسائل کے درمیان تعلقات کی وضاحت کرنے کی اجازت دیتا ہے تاکہ آپ سیاق و سباق کو بہتر طور پر سمجھ سکیں

source: between physical objects, events, activities, people and documents.
ur: جسمانی اشیاء، واقعات، سرگرمیوں، لوگوں اور دستاویزات کے درمیان۔

source: Relating resources lets you build a network of relationships for your data objects.
ur: وسائل سے متعلق آپ کو اپنے ڈیٹا آبجیکٹ کے لیے تعلقات کا ایک نیٹ ورک بنانے دیتا ہے۔

source: Show Me How
ur: مجھے دکھاؤ کیسے

source: Table
ur: ٹیبل

source: Visualization
ur: تصور

source: Select resources and relate it to this one
ur: وسائل کا انتخاب کریں اور اسے اس سے جوڑیں۔

source: resource relations
ur: وسائل کے تعلقات

source: This is a Node to Resource Instance relationship
ur: یہ ایک نوڈ ٹو ریسورس انسٹینس رشتہ ہے۔

source: 's relationship to
ur: سے تعلق ہے

source: 's relationship to
ur: سے تعلق ہے

source: Inverse Relationship to
ur: سے الٹا رشتہ

source: Delete this entry
ur: اس اندراج کو ڈیلیٹ کریں۔

source: Cancel Edit
ur: ترمیم منسوخ کریں۔

source: This is a Resource Instance to Resource Instance relationship
ur: یہ ریسورس انسٹینس سے ریسورس انسٹینس رشتہ ہے۔

source: Relationship
ur: رشتہ

source: From Date
ur: اس تاریخ سے

source: To Date
ur: آج تک

source: This resource is not related to any other resources
ur: یہ وسیلہ کسی دوسرے وسائل سے متعلق نہیں ہے۔

source: Arches keeps track of how resources are related. Click the "related resources" link
ur: محراب اس بات پر نظر رکھتا ہے کہ وسائل کیسے متعلق ہیں۔ "متعلقہ وسائل" کے لنک پر کلک کریں۔

source: on a search result from the list on the left
ur: بائیں طرف کی فہرست سے تلاش کے نتائج پر

source: to see its relatives displayed in an interactive graph
ur: اس کے رشتہ داروں کو ایک انٹرایکٹو گراف میں دکھائے جانے کے لیے

source: Resource Report
ur: وسائل کی رپورٹ

source: Results:
ur: نتائج:

source: Clear Filters
ur: فلٹرز صاف کریں۔

source: Account Settings
ur: اکاؤنٹ سیٹنگز

source: User name:
ur: صارف کا نام:

source: Account
ur: کھاتہ

source: User name
ur: صارف کا نام

source: Change password
ur: پاس ورڈ تبدیل کریں

source: Contact email
ur: ای میل سے رابطہ کریں۔

source: Phone
ur: فون

source: Arches user name
ur: محراب صارف کا نام

source: This is the unique email or name that you use to log on to Arches.
ur: یہ وہ منفرد ای میل یا نام ہے جسے آپ آرچز پر لاگ ان کرنے کے لیے استعمال کرتے ہیں۔

source: First name
ur: پہلا نام

source: Arches uses your name and phone number to make it easier for other users to find and work with you.
ur: آرچز آپ کا نام اور فون نمبر استعمال کرتا ہے تاکہ دوسرے صارفین کے لیے آپ کو تلاش کرنا اور آپ کے ساتھ کام کرنا آسان ہو جائے۔

source: Last name
ur: آخری نام

source: Phone Number (optional)
ur: فون نمبر (اختیاری)

source: Contact Email
ur: ای میل سے رابطہ کریں۔

source: Arches uses your e-maill to alert you to projects and tasks assigned to you.
ur: آرچز آپ کے ای میل کا استعمال آپ کو تفویض کردہ منصوبوں اور کاموں سے آگاہ کرنے کے لیے کرتا ہے۔

source: Notification Settings
ur: نوٹیفکیشن سیٹنگز

source: Trigger
ur: محرک

source: Email Notification
ur: ای میل اطلاع

source: Web Notification
ur: ویب نوٹیفیکیشن

source: Enable
ur: فعال کریں

source: Exporting Search Results
ur: سرچ کے نتائج برآمدکیے جا رہے ہیں

source: Arches Collector Projects
ur: آرچز کلیکٹر پراجیکٹ

source: Sorry, but you haven't been invited to a project yet...
ur: معذرت، لیکن آپ کو ابھی تک کسی پروجیکٹ میں مدعو نہیں کیا گیا ہے۔۔۔

source: to
ur: ٹو

source: Unnamed Survey
ur: بے نام سروے

source: View Details
ur: تفصیلات دیکھیں

source: Project Summary
ur: پروجیکٹ کا خلاصہ

source: Number of edits:
ur: ترامیم کی تعداد:

source: Contributors:
ur: شراکت دار:

source: Offline Basemap:
ur: آف لائن بیس میپ

source: Streets-Grey
ur: سٹریٹ-گرے

source: No datatype detected for {0}
ur: {0} کے لیے کوئی ڈیٹا ٹائپ نہیں ملا

source: Total resources saved: {save_count}
ur: کل محفوظ کردہ وسائل: {save_count}

source: {0} of {1} resources saved
ur: {1} میں سے {0} وسائل محفوظ

source: {0} of {1} relations saved
ur: {1} میں سے {0} ریلیشنز محفوظ

source: No import errors
ur: کوئی امپورٹ ایرر نہیں
