Repository: junaidabduljabbar/arches7-internationalization
Catalog: translated_out.po
Languages: ur

source: <strong>Cluster Max Zoom</strong> - zoom level after which clustering will <em>stop</em> being used
ur: <strong>کلسٹر میکس زوم</strong> - زوم لیول جس کے بعد کلسٹرنگ کا استعمال <em>رک جائے گا</em>

source: <strong>Cluster Min Points</strong> - minimum number of points needed to create a cluster
ur: <strong>کلسٹر من پوائنٹس</strong> - کلسٹر بنانے کے لیے ضروری پوائنٹس کی کم از کم تعداد

source: Permissions
ur: اجازتیں

source: This tab shows the permissions for the nodegroup whose geometry is displayed in this Resource Layer. Permissions are defined in the Graph Designer.
ur: یہ ٹیب نوڈ گروپ کے لیے اجازتیں دکھاتا ہے جس کی جیومیٹری اس ریسورس لیئر میں ظاہر ہوتی ہے۔ اجازتوں کی تعریف گراف ڈیزائنر میں کی گئی ہے۔

source: A Basemap will always be present in your map. Arches comes with a few default basemaps, but advanced users are able to add more. Once added, there are few ways to configure each basemap.
ur: آپ کے نقشے میں ایک بیس میپ ہمیشہ موجود رہے گا۔ محرابیں چند ڈیفالٹ بیس میپس کے ساتھ آتی ہیں، لیکن اعلی درجے کے صارفین مزید اضافہ کرنے کے قابل ہیں۔ ایک بار شامل کرنے کے بعد، ہر ایک بیس میپ کو ترتیب دینے کے چند طریقے ہیں۔

source: Define a style for this basemap. Note that depending on the type of layer, there are different styling options. For styling reference, checkout the <a href='https://www.mapbox.com/mapbox-gl-js/style-spec/#layers' target='_blank'>MapBox Style Specification</a>.
ur: اس بیس میپ کے لیے ایک انداز کی وضاحت کریں۔ نوٹ کریں کہ پرت کی قسم پر منحصر ہے، مختلف اسٹائل کے اختیارات ہیں۔ اسٹائل کے حوالے کے لیے، <a href='https://www.mapbox.com/mapbox-gl-js/style-spec/#layers' target='_blank'>MapBox طرز کی تفصیلات</a> کو چیک کریں۔

source: <strong>Layer name</strong> - enter a name to identify this basemap
ur: <strong>پرت کا نام</strong> - اس بیس میپ کی شناخت کے لیے ایک نام درج کریں۔

source: <strong>Default search map</strong> - choose this layer to be the default basemap
ur: <strong>پہلے سے طے شدہ تلاش کا نقشہ</strong> - اس تہہ کو ڈیفالٹ بیس میپ بننے کے لیے منتخب کریں۔

source: <strong>Layer icon</strong> - associate an icon with this layer
ur: <strong>پرت کا آئیکن</strong> - اس پرت کے ساتھ ایک آئیکن منسلک کریں۔

source: Overlays allow you to incorporate map layers from external sources. Note that Search Results and Search Markets are treated as overlays, and can be customize separately. New overlays can be added with a little behind-the-scenes work. Once added, there are few ways to configure each overlay.
ur: اوورلیز آپ کو بیرونی ذرائع سے نقشہ کی تہوں کو شامل کرنے کی اجازت دیتے ہیں۔ نوٹ کریں کہ تلاش کے نتائج اور تلاش کے بازاروں کو اوورلیز کے طور پر سمجھا جاتا ہے، اور انہیں الگ سے اپنی مرضی کے مطابق بنایا جا سکتا ہے۔ پردے کے پیچھے کے کام کے ساتھ نئے اوورلیز کو شامل کیا جا سکتا ہے۔ ایک بار شامل کرنے کے بعد، ہر اوورلے کو ترتیب دینے کے چند طریقے ہیں۔

source: Define a style for this overlay. Note that depending on the type of layer, there are different styling options. For styling reference, checkout the <a href='https://www.mapbox.com/mapbox-gl-js/style-spec/#layers' target='_blank'>MapBox Style Specification</a>.
ur: اس اوورلے کے لیے ایک انداز کی وضاحت کریں۔ نوٹ کریں کہ پرت کی قسم پر منحصر ہے، مختلف اسٹائل کے اختیارات ہیں۔ اسٹائل کے حوالے کے لیے، <a href='https://www.mapbox.com/mapbox-gl-js/style-spec/#layers' target='_blank'>MapBox طرز کی تفصیلات</a> کو چیک کریں۔

source: <strong>Layer name</strong> - enter a name to identify this overlay
ur: <strong>پرت کا نام</strong> - اس اوورلے کی شناخت کے لیے ایک نام درج کریں۔

source: <strong>Default search map</strong> - choose whether this overlay should be shown in the search map by default. Note that in the search map itself you can change the order of the layers.
ur: <strong>پہلے سے طے شدہ تلاش کا نقشہ</strong> - منتخب کریں کہ آیا یہ اوورلے بطور ڈیفالٹ تلاش کے نقشے میں دکھایا جانا چاہیے۔ نوٹ کریں کہ تلاش کے نقشے میں ہی آپ تہوں کی ترتیب کو تبدیل کر سکتے ہیں۔

source: Permissions Tab
ur: اجازتوں کا ٹیب

source: Arches allows you to define user and user group permissions on a per-nodegroup basis. For example, you may want to hide the coordinates of a Resource from the public, or allow a certain group of users to only update the condition assessment section of a Resource Model. Rules like these are all enforced using permissions.
ur: آرچز آپ کو فی نوڈ گروپ کی بنیاد پر صارف اور صارف گروپ کی اجازتوں کی وضاحت کرنے کی اجازت دیتا ہے۔ مثال کے طور پر، ہو سکتا ہے کہ آپ کسی وسائل کے نقاط کو عوام سے چھپانا چاہیں، یا صارفین کے ایک مخصوص گروپ کو صرف ریسورس ماڈل کے کنڈیشن اسیسمنٹ سیکشن کو اپ ڈیٹ کرنے کی اجازت دیں۔ ان جیسے قوانین تمام اجازتوں کا استعمال کرتے ہوئے نافذ کیے جاتے ہیں۔

source: Permissions Levels
ur: اجازت کی سطحیں۔

source: Allows users to delete instances of this nodegroup. Note, this is not the same as being allowed to delete an entire resource, permissions for which are not handled here.
ur: صارفین کو اس نوڈ گروپ کی مثالوں کو حذف کرنے کی اجازت دیتا ہے۔ نوٹ، یہ ایک مکمل وسیلہ کو حذف کرنے کی اجازت کے مترادف نہیں ہے، جس کے لیے یہاں پر اجازت نہیں دی گئی ہے۔

source: Disallows users from seeing or editing instances of this nodegroup. Use this permission level to hide sensitive data from non-authenticated users (the public).
ur: صارفین کو اس نوڈ گروپ کی مثالیں دیکھنے یا اس میں ترمیم کرنے سے منع کرتا ہے۔ غیر مستند صارفین (عوام) سے حساس ڈیٹا چھپانے کے لیے اجازت کی اس سطح کا استعمال کریں۔

source: Read
ur: پڑھو

source: Allows users to see this nodegroup's card. If disallowed, the card/nodegroup will be hidden from the map and resource reports.
ur: صارفین کو اس نوڈ گروپ کا کارڈ دیکھنے کی اجازت دیتا ہے۔ اگر اجازت نہیں دی جاتی ہے تو، کارڈ/نوڈ گروپ کو نقشے اور وسائل کی رپورٹس سے چھپا دیا جائے گا۔

source: Create/Update
ur: بنائیں/اپ ڈیٹ کریں۔

source: Allows users to create or edit instances of this nodegroup. This provides the ability to let users edit some information about a resource, while be restricted from editing other information.
ur: صارفین کو اس نوڈ گروپ کی مثالیں بنانے یا ترمیم کرنے کی اجازت دیتا ہے۔ یہ صارفین کو وسائل کے بارے میں کچھ معلومات میں ترمیم کرنے کی اہلیت فراہم کرتا ہے، جبکہ دوسری معلومات میں ترمیم کرنے سے منع کیا جاتا ہے۔

source: Non-Authenticated Users
ur: غیر مستند صارفین

source: You may notice that by default Arches comes with a "Guest" group, as well as user named "anonymous" who is a member of that group. <strong>Any non-authenticated user is treated as the "anonymous" user.</strong> This means that all permissions applied to the Guest group will be given to anyone who views the website without logging in.
ur: آپ دیکھ سکتے ہیں کہ ڈیفالٹ آرچز ایک "گیسٹ" گروپ کے ساتھ آتا ہے، ساتھ ہی "گمنام" نامی صارف جو اس گروپ کا ممبر ہے۔ <strong>کسی بھی غیر مستند صارف کو "گمنام" صارف سمجھا جاتا ہے۔</strong> اس کا مطلب ہے کہ مہمان گروپ پر لاگو تمام اجازتیں ہر اس شخص کو دی جائیں گی جو لاگ ان کیے بغیر ویب سائٹ کو دیکھتا ہے۔

source: The profile manager allows you to update your account information, such as your password, at any time. It also gives you a summary of your participation in data collection efforts that are in progress via <a href="https://arches.readthedocs.io/en/stable/using-arches-collector.html" target="_blank">Arches Collector</a>.
ur: پروفائل مینیجر آپ کو اپنے اکاؤنٹ کی معلومات، جیسے کہ آپ کا پاس ورڈ، کسی بھی وقت اپ ڈیٹ کرنے کی اجازت دیتا ہے۔ یہ آپ کو ڈیٹا اکٹھا کرنے کی کوششوں میں آپ کی شرکت کا خلاصہ بھی دیتا ہے جو <a href="https://arches.readthedocs.io/en/stable/using-arches-collector.html" target="_blank" کے ذریعے جاری ہیں۔ >محراب کلیکٹر</a>۔

source: The Reference Data Management (RDM) enables the creation and maintenance of controlled vocabularies that are used throughout your database. In Arches, controlled vocabularies consist of Concepts, and these Concepts are managed in Thesauri and Collections. In the RDM you can create new Thesauri, create new Concepts, import Concepts from external an endpoint (like the Getty AAT), and -- the ultimate goal -- create Collections, which will be used in your database as data input dropdown lists.
ur: حوالہ ڈیٹا مینجمنٹ (RDM) کنٹرول شدہ الفاظ کی تخلیق اور دیکھ بھال کے قابل بناتا ہے جو آپ کے پورے ڈیٹا بیس میں استعمال ہوتے ہیں۔ محراب میں، کنٹرول شدہ الفاظ تصورات پر مشتمل ہوتے ہیں، اور ان تصورات کا نظم تھیسوری اور کلیکشنز میں کیا جاتا ہے۔ RDM میں آپ نئی تھیسوری بنا سکتے ہیں، نئے تصورات تخلیق کر سکتے ہیں، بیرونی اینڈ پوائنٹ (جیسے گیٹی اے اے ٹی) سے تصورات درآمد کر سکتے ہیں، اور -- حتمی مقصد -- کلیکشنز بنا سکتے ہیں، جو آپ کے ڈیٹا بیس میں ڈیٹا ان پٹ ڈراپ ڈاؤن فہرستوں کے طور پر استعمال ہوں گے۔

source: Concepts
ur: کانسپٹس

source: A Concept is a qualitative property that can be attached to a resource, something like "Stone" (which may describe a building material) or "House" (which may describe a past use for a structure). The advantage of storing these properties as Concepts is that a Concept may have attributes of its own. In the case of "House", we could add an alternate label, "Dwelling" to that Concept. Then, if a user searches for "dwelling", any resource with the "House" Concept attached to it will be found.
ur: ایک تصور ایک قابلیت کی خاصیت ہے جو کسی وسائل کے ساتھ منسلک کی جا سکتی ہے، جیسا کہ "پتھر" (جو کسی تعمیراتی مواد کی وضاحت کر سکتا ہے) یا "مکان" (جو کسی ڈھانچے کے ماضی کے استعمال کو بیان کر سکتا ہے)۔ ان خصوصیات کو تصورات کے طور پر ذخیرہ کرنے کا فائدہ یہ ہے کہ تصور کی اپنی خصوصیات ہوسکتی ہیں۔ "House" کے معاملے میں، ہم اس تصور میں ایک متبادل لیبل، "Dwelling" شامل کر سکتے ہیں۔ پھر، اگر کوئی صارف "رہائش" تلاش کرتا ہے تو اس کے ساتھ منسلک "مکان" تصور کے ساتھ کوئی بھی وسیلہ مل جائے گا۔

source: Concepts can also be nested, to allow more complex and meaningful relationships between them. For example, "House" may appear next to "School" within a parent Concept called "Building Use".
ur: ان کے درمیان زیادہ پیچیدہ اور بامعنی تعلقات کی اجازت دینے کے لیے تصورات کو بھی گھونسلا بنایا جا سکتا ہے۔ مثال کے طور پر، "House" "School" کے ساتھ ایک والدین کے تصور میں ظاہر ہو سکتا ہے جسے "Building Use" کہا جاتا ہے۔

source: Thesauri
ur: تھیسوری

source: A Thesaurus is an entire set of Concepts which can be imported and exported as a whole. You can create as many new Thesauri as you need, or just add new Concepts to the default "Arches" Thesaurus. The organization of your Thesauri has no impact on the way Concepts will be exposed to the public or used throughout the app.
ur: تھیسورس تصورات کا ایک مکمل مجموعہ ہے جسے مجموعی طور پر درآمد اور برآمد کیا جاسکتا ہے۔ آپ اپنی ضرورت کے مطابق نئے تھیسوری بنا سکتے ہیں، یا پہلے سے طے شدہ "آرچز" تھیسورس میں نئے تصورات شامل کر سکتے ہیں۔ آپ کے تھیسوری کی تنظیم کا تصورات کو عوام کے سامنے لانے یا پوری ایپ میں استعمال کیے جانے کے طریقے پر کوئی اثر نہیں پڑتا ہے۔

source: Collections
ur: مجموعے

source: Collections, or Concept Collections as they are sometimes called, are custom aggregations of Concepts that will be used in your app as dropdown lists during the data entry process. Collections allow you to reorganize your Concepts for the specific purpose of data entry, so your dropdown lists do not have to look anything like your Thesaurus. You can create as many Collections as you want, or add new Concepts to existing Collections.
ur: مجموعے، یا تصوراتی مجموعے جیسا کہ انہیں کبھی کبھی کہا جاتا ہے، تصورات کے حسب ضرورت مجموعے ہیں جو ڈیٹا انٹری کے عمل کے دوران ڈراپ ڈاؤن فہرستوں کے طور پر آپ کی ایپ میں استعمال ہوں گے۔ مجموعے آپ کو ڈیٹا انٹری کے مخصوص مقصد کے لیے اپنے تصورات کو از سر نو ترتیب دینے کی اجازت دیتے ہیں، اس لیے آپ کی ڈراپ ڈاؤن فہرستوں کو آپ کے تھیسورس جیسا نظر نہیں آتا۔ آپ جتنے چاہیں مجموعے بنا سکتے ہیں، یا موجودہ مجموعوں میں نئے تصورات شامل کر سکتے ہیں۔

source: Example - Create a New Thesaurus
ur: مثال - ایک نیا تھیسورس بنائیں

source: In the video below, a new Thesaurus is created. Once you have made a Thesaurus, you can begin creating a hierarchy of Concepts within it. Remember, the final step will be to make a new Collection and add Concepts to it (from <em>any</em> of your Thesauri).
ur: نیچے دی گئی ویڈیو میں، ایک نیا تھیسورس بنایا گیا ہے۔ ایک بار جب آپ تھیسورس بنا لیتے ہیں، تو آپ اس کے اندر تصورات کا درجہ بندی بنانا شروع کر سکتے ہیں۔ یاد رکھیں، آخری مرحلہ ایک نیا مجموعہ بنانا اور اس میں تصورات شامل کرنا ہوگا (آپ کے تھیسوری کے <em>کسی بھی</em> سے)۔

source: click to view demonstration
ur: مظاہرہ دیکھنے کے لیے کلک کریں۔

source: Example - Create a Top Concept
ur: مثال - ایک اعلی تصور تخلیق کریں۔

source: The first level of organization within a Thesaurus is a set of Top Concepts. A Top Concept may be something like "Architectural Styles" and its children Concepts will be the actual styles themselves. Below, a new, empty Top Concept is added to an empty Thesaurus.
ur: تھیسورس کے اندر تنظیم کی پہلی سطح سرفہرست تصورات کا ایک مجموعہ ہے۔ ایک سرفہرست تصور "آرکیٹیکچرل اسٹائلز" جیسا کچھ ہوسکتا ہے اور اس کے بچوں کے تصورات خود ہی اصل اسٹائل ہوں گے۔ ذیل میں، خالی تھیسورس میں ایک نیا، خالی اوپر کا تصور شامل کیا گیا ہے۔

source: Example - Create New Concepts
ur: مثال - نئے تصورات تخلیق کریں۔

source: To create a new Concept, begin by selecting the Top Concept under which it should be placed. This will bring the details about the Top Concept into the main panel. Use the Manage dropdown to "Add Child", type in a label, and select the correct language for the label.
ur: ایک نیا تصور بنانے کے لیے، سب سے اوپر والے تصور کو منتخب کرکے شروع کریں جس کے تحت اسے رکھا جانا چاہیے۔ یہ سب سے اوپر تصور کے بارے میں تفصیلات کو مرکزی پینل میں لے آئے گا۔ مینیج ڈراپ ڈاؤن کو "Add Child" کے لیے استعمال کریں، ایک لیبل ٹائپ کریں، اور لیبل کے لیے صحیح زبان منتخب کریں۔

source: Example - Add an Alternate Label to a Concept
ur: مثال - ایک تصور میں ایک متبادل لیبل شامل کریں۔

source: To improve the searchability of your Concepts, you can add as many alternate labels to each one as you want Below, the label "Dwelling" is added to the Concept "House". The result is that anyone using "Dwelling" as a search term will be shown Resources that have the "House" Concept.
ur: اپنے تصورات کی تلاش کی اہلیت کو بہتر بنانے کے لیے، آپ ہر ایک میں جتنے متبادل لیبل شامل کرنا چاہتے ہیں شامل کر سکتے ہیں، ذیل میں تصور "گھر" میں "Dwelling" کا لیبل شامل کیا گیا ہے۔ نتیجہ یہ ہے کہ جو کوئی بھی "Dwelling" کو تلاش کی اصطلاح کے طور پر استعمال کرے گا اسے وہ وسائل دکھائے جائیں گے جن میں "House" کا تصور ہے۔

source: Example - Create a Collection
ur: مثال - ایک مجموعہ بنائیں

source: Creating a Collection is very similar to creating a Thesaurus. However, you will be adding existing Concepts to a Collection (potentially from more than one Thesaurus) instead of creating new ones. Below, a new Collection is created. To go further, select the Collection, and use the "Add dropdown entry" link to add existing Concepts to this Collection. When configuring the Graph for a Branch or Resource Model, you will now be able to add this Concept Collection to a node.
ur: ایک مجموعہ بنانا تھیسورس بنانے کے مترادف ہے۔ تاہم، آپ نئے بنانے کے بجائے موجودہ تصورات کو ایک مجموعہ میں شامل کریں گے (ممکنہ طور پر ایک سے زیادہ تھیسورس سے)۔ ذیل میں، ایک نیا مجموعہ بنایا گیا ہے۔ مزید جانے کے لیے، مجموعہ کو منتخب کریں، اور اس مجموعہ میں موجودہ تصورات کو شامل کرنے کے لیے "ڈراپ ڈاؤن اندراج شامل کریں" کا لنک استعمال کریں۔ کسی برانچ یا ریسورس ماڈل کے لیے گراف کو ترتیب دیتے وقت، اب آپ اس تصوراتی مجموعہ کو نوڈ میں شامل کر سکیں گے۔

source: Creating Resource Data
ur: وسائل کا ڈیٹا بنانا

source: The Resource Editor is used to create new or edit existing Resources. What you see on the left-hand side of the page is this Resource's "card tree", which shows all of the data entry cards that you can edit. Think of "creating data" as "adding cards".
ur: ریسورس ایڈیٹر کو نئے بنانے یا موجودہ وسائل میں ترمیم کرنے کے لیے استعمال کیا جاتا ہے۔ آپ جو صفحہ کے بائیں جانب دیکھتے ہیں وہ اس ریسورس کا "کارڈ ٹری" ہے، جو تمام ڈیٹا انٹری کارڈز کو دکھاتا ہے جن میں آپ ترمیم کر سکتے ہیں۔ "ڈیٹا بنانے" کو "کارڈز شامل کرنے" کے بارے میں سوچیں۔

source: To begin, select a card, enter data, and click <strong>Add</strong>. Some cards may allow multiple instances, in which case you will be able to add as many of the same type as you want.
ur: شروع کرنے کے لیے، ایک کارڈ منتخب کریں، ڈیٹا درج کریں، اور <strong>شامل کریں</strong> پر کلک کریں۔ کچھ کارڈز ایک سے زیادہ مثالوں کی اجازت دے سکتے ہیں، ایسی صورت میں آپ اپنی مرضی کے مطابق ایک ہی قسم میں سے زیادہ کو شامل کر سکیں گے۔

source: Note that in the demonstration below, the "Define Resource Descriptors" function has already been configured to set the Name card value as the resource display name.
ur: نوٹ کریں کہ نیچے دیے گئے مظاہرے میں، "ریسورس ڈسکرپٹرز کی وضاحت کریں" فنکشن پہلے ہی نام کارڈ کی قدر کو ریسورس ڈسپلے نام کے طور پر سیٹ کرنے کے لیے ترتیب دیا گیا ہے۔

source: basic card data enty - click to view
ur: بنیادی کارڈ ڈیٹا enty - دیکھنے کے لیے کلک کریں۔

source: Once you have saved data for a resource, you can see a full summary by selecting the top card. This is the resource report.
ur: ایک بار جب آپ وسائل کے لیے ڈیٹا محفوظ کر لیتے ہیں، تو آپ ٹاپ کارڈ کو منتخب کر کے مکمل خلاصہ دیکھ سکتے ہیں۔ یہ وسائل کی رپورٹ ہے۔

source: In some cases, cards will be nested within other cards, as in the example of adding a geo-location below.
ur: کچھ معاملات میں، کارڈ دوسرے کارڈز کے اندر اندر بنائے جائیں گے، جیسا کہ ذیل میں جیو لوکیشن شامل کرنے کی مثال میں ہے۔

source: nested card data enty - click to view
ur: nested card data enty - دیکھنے کے لیے کلک کریں۔

source: Creating Resources Relations
ur: وسائل کے تعلقات بنانا

source: In the Resource Editor you can also access the <strong>Related Resources Editor</strong> . To create a relationship between this resource and another in your database, open the editor, find the resource, and click <strong>Add</strong>.
ur: ریسورس ایڈیٹر میں آپ <strong>متعلقہ ریسورسز ایڈیٹر</strong> تک بھی رسائی حاصل کر سکتے ہیں۔ اپنے ڈیٹا بیس میں اس وسیلہ اور دوسرے کے درمیان تعلق پیدا کرنے کے لیے، ایڈیٹر کھولیں، وسیلہ تلاش کریں، اور <strong>شامل کریں</strong> پر کلک کریں۔

source: Your Resource Model will need to be configured to allow relations with the target Resource Model. If relations are not allowed, resources in the dropdown menu will not be selectable.
ur: آپ کے ریسورس ماڈل کو ٹارگٹ ریسورس ماڈل کے ساتھ تعلقات کی اجازت دینے کے لیے ترتیب دینے کی ضرورت ہوگی۔ اگر تعلقات کی اجازت نہیں ہے تو، ڈراپ ڈاؤن مینو میں وسائل منتخب نہیں ہوں گے۔

source: create resource relation - click to view
ur: وسائل کا رشتہ بنائیں - دیکھنے کے لیے کلک کریں۔

source: Choose a Resource Model to begin creating a new Resource in your database.
ur: اپنے ڈیٹا بیس میں ایک نیا وسیلہ بنانا شروع کرنے کے لیے ریسورس ماڈل کا انتخاب کریں۔

source: Introduction to Search
ur: تلاش کا تعارف

source: <strong>Search Bar</strong> The quickest way to search the database is to begin typing in the search bar. You'll be presented with database terminology which you can use to create one or more simple filters. The search bar also acts as an aggregator of <em>all</em> currently enabled filters.
ur: <strong>سرچ بار</strong> ڈیٹا بیس کو تلاش کرنے کا تیز ترین طریقہ سرچ بار میں ٹائپ کرنا شروع کرنا ہے۔ آپ کو ڈیٹا بیس کی اصطلاحات پیش کی جائیں گی جسے آپ ایک یا زیادہ آسان فلٹرز بنانے کے لیے استعمال کر سکتے ہیں۔ سرچ بار <em>تمام</em> فی الحال فعال فلٹرز کے ایک مجموعی کے طور پر بھی کام کرتا ہے۔

source: <strong>Search Tools</strong> There are a number tools you can use to explore the database, which are described in detail below.
ur: <strong>سرچ ٹولز</strong> ڈیٹا بیس کو دریافت کرنے کے لیے آپ بہت سے ٹولز استعمال کر سکتے ہیں، جن کی تفصیل ذیل میں بیان کی گئی ہے۔

source: <strong>Search Results</strong> Whenever you change any search filters, the updated search results will be listed here. You can link to a resource's report, zoom to it on the map, or view its related resources.
ur: <strong>تلاش کے نتائج</strong> جب بھی آپ تلاش کے کسی فلٹر کو تبدیل کرتے ہیں، اپ ڈیٹ کردہ تلاش کے نتائج یہاں درج ہوں گے۔ آپ کسی وسائل کی رپورٹ سے لنک کر سکتے ہیں، نقشے پر اسے زوم کر سکتے ہیں، یا اس کے متعلقہ وسائل دیکھ سکتے ہیں۔

source: <strong>Search Panel</strong> The contents of this panel will change depending on what search tool you are using. Typically, the map will be activated by default.
ur: <strong>تلاش پینل</strong> اس پینل کے مواد اس بات پر منحصر ہوں گے کہ آپ کون سا سرچ ٹول استعمال کر رہے ہیں۔ عام طور پر، نقشہ بطور ڈیفالٹ چالو ہو جائے گا۔

source: Search Tools
ur: سرچ ٹولز

source: Map
ur: نقشہ

source: Search results can be represented on the map in two ways: <strong>markers</strong> show the first set of resources in the search results, and <strong>cells</strong> are used to give a general spatial representation of <em>all</em> resources in the search results.
ur: تلاش کے نتائج کو نقشے پر دو طریقوں سے پیش کیا جا سکتا ہے: <strong>مارکرز</strong> تلاش کے نتائج میں وسائل کا پہلا سیٹ دکھاتے ہیں، اور <strong>خلیات</strong> کو عام مقامی نمائندگی دینے کے لیے استعمال کیا جاتا ہے۔ em>تمام</em> وسائل تلاش کے نتائج میں۔

source: In addition to displaying search results, the map can show resource layers (showing all resources), or custom overlays, if any have been added. You control the visibility of all layers and basemaps with the tool panel on the right.
ur: تلاش کے نتائج کو ظاہر کرنے کے علاوہ، نقشہ وسائل کی تہوں (تمام وسائل کو دکھا رہا ہے)، یا حسب ضرورت اوورلیز، اگر کوئی شامل کیا گیا ہو تو دکھا سکتا ہے۔ آپ دائیں طرف ٹول پینل کے ساتھ تمام پرتوں اور بیس میپس کی مرئیت کو کنٹرول کرتے ہیں۔

source: Finally, you can add a spatial filter to your query by using the map drawing tools to draw a shape and apply a buffer distance if desired.
ur: آخر میں، آپ نقشہ ڈرائنگ ٹولز کا استعمال کرتے ہوئے اپنی استفسار میں ایک مقامی فلٹر شامل کر سکتے ہیں اور اگر چاہیں تو بفر فاصلہ لگا سکتے ہیں۔

source: change basemap - click to view
ur: بیس میپ تبدیل کریں - دیکھنے کے لیے کلک کریں۔

source: toggle search results layer - click to view
ur: تلاش کے نتائج کی پرت کو ٹوگل کریں - دیکھنے کے لیے کلک کریں۔

source: search with spatial query - click to view
ur: مقامی استفسار کے ساتھ تلاش کریں - دیکھنے کے لیے کلک کریں۔

source: Time
ur: وقت

source: You can apply a temporal criterion to your query by using the Time Filter. You have the option of creating the filter by hand, or you can use the time wheel. The time wheel is a graphic representation of all the resources in the database, organized chronologically.
ur: آپ ٹائم فلٹر کا استعمال کر کے اپنے استفسار پر ایک وقتی معیار کا اطلاق کر سکتے ہیں۔ آپ کے پاس ہاتھ سے فلٹر بنانے کا اختیار ہے، یا آپ ٹائم وہیل استعمال کر سکتے ہیں۔ ٹائم وہیل ڈیٹا بیس میں موجود تمام وسائل کی ایک گرافک نمائندگی ہے، جو تاریخ کے مطابق ترتیب دی گئی ہے۔

source: apply time filter with time wheel - click to view
ur: ٹائم وہیل کے ساتھ ٹائم فلٹر لگائیں - دیکھنے کے لیے کلک کریں۔

source: Saved
ur: محفوظ کر لیا

source: Saved searches allow you to view pre-made queries. Saved searches are created by database administrators, so the number of saved searches shown here will vary from one database to the next.
ur: محفوظ شدہ تلاشیں آپ کو پہلے سے تیار کردہ سوالات دیکھنے کی اجازت دیتی ہیں۔ محفوظ شدہ تلاشیں ڈیٹا بیس کے منتظمین کے ذریعہ تخلیق کی جاتی ہیں، لہذا یہاں دکھائی گئی محفوظ کردہ تلاشوں کی تعداد ایک ڈیٹا بیس سے دوسرے ڈیٹا بیس میں مختلف ہوگی۔

source: Advanced
ur: اعلی درجے کی

source: You can use the advanced search to make more complex queries based on data attributes, or "facets". While the basic search filter allows you to combine multiple filters, advanced search is the only way to combine filters with an <strong>or</strong> operator, and also gives you access to more comparison operators.
ur: آپ ڈیٹا کے اوصاف یا "چہروں" کی بنیاد پر مزید پیچیدہ سوالات کرنے کے لیے جدید تلاش کا استعمال کر سکتے ہیں۔ اگرچہ بنیادی تلاش کا فلٹر آپ کو متعدد فلٹرز کو یکجا کرنے کی اجازت دیتا ہے، اعلیٰ درجے کی تلاش ایک <strong>یا</strong> آپریٹر کے ساتھ فلٹرز کو یکجا کرنے کا واحد طریقہ ہے، اور آپ کو مزید موازنہ آپریٹرز تک رسائی بھی فراہم کرتی ہے۔
