Repository: junaidabduljabbar/arches7-internationalization
Catalog: translated_out.po
Languages: ur

source: ***** Errors occured during import. Some data may not have been imported. For more information, check resource import error log:
ur: ***** درآمد کے دوران غلطیاں ہوئیں۔ ہو سکتا ہے کچھ ڈیٹا درآمد نہ کیا گیا ہو۔ مزید معلومات کے لیے، ریسورس امپورٹ ایرر لاگ کو چیک کریں:

source: Must supply either a graph id or a list of resource instance ids to export
ur: برآمد کرنے کے لیے گراف آئی ڈی یا ریسورس انسٹینس آئی ڈیز کی فہرست فراہم کریں

source: Getty AAT
ur: گیٹی AAT

source: <strong>Error in SPARQL query:</strong><br>Test this query directly by pasting the query below into the Getty's own SPARQL endpoint at <a href='http://vocab.getty.edu/sparql' target='_blank'>http://vocab.getty.edu/sparql</a> <i><pre>%s</pre></i>Query returned 0 results, please check the query for errors. You may need to add the appropriate languages into the database for this query to work<br><br>
ur: SPARQL کیوری میں خرابی: اس کیوری کو براہ راست ٹیسٹ کرنے کے لیے کیوری کو Getty کے SPARQL اینڈ پوائنٹ http://vocab.getty.edu/sparql میں پیسٹ کریں %sQuery نے 0 نتائج واپس کیے، براہ کرم غلطیوں کے لیے کیوری کو چیک کریں۔ اس کیوری کے کام کرنے کے لیے آپ کو ڈیٹا بیس میں مناسب زبانیں شامل کرنے کی ضرورت پڑسکتی ہے۔

source: This email address has already been registered with the system. If you forgot your password, click the 'exit' link below and go to the login page to reset your password.
ur: یہ ای میل پتہ پہلے سے سسٹم کے ساتھ رجسٹرڈ ہے۔ اگر آپ اپنا پاس ورڈ بھول گئے ہیں تو نیچے دیے گئے 'ایگزٹ' لنک پر کلک کریں اور اپنا پاس ورڈ ری سیٹ کرنے کے لیے لاگ ان پیج پر جائیں۔

source: Email
ur: ای میل

source: New password
ur: نیا پاس ورڈ

source: Re-enter new password
ur: نیا پاس ورڈ دوبارہ درج کریں

source: Be longer than {0} characters
ur: {0} حروف سے لمبا ہونا چاہیے

source: Have at least 1 letter
ur: کم از کم 1 حرف ہونا چاہیے

source: Your password must contain at least one special character
ur: آپ کے پاس ورڈ میں کم از کم ایک خاص حرف ہونا چاہیے

source: Have at least 1 special character
ur: کم از کم 1 خاص حرف ہونا چاہیے

source: Your password must contain at least one number
ur: آپ کے پاس ورڈ میں کم از کم ایک نمبر ہونا چاہیے

source: Have at least 1 number
ur: کم از کم 1 نمبر ہونا چاہیے

source: Your password must contain both upper and lower case letters
ur: آپ کے پاس ورڈ میں بڑے اور چھوٹے دونوں حروف شامل ہونے چاہئیں

source: Have least 1 upper and lower case character
ur: کم از کم 1 بڑا اور چھوٹا حرف شامل ہونے چاہئیں

source: Could not return JSON Response
ur: JSON جواب واپس نہیں کیا جا سکا

source: Celery worker connection failed. Reattempting
ur: سیلری ورکر کنکشن ناکام ہو گیا۔ دوبارہ کوشش کی جا رہی ہے

source: Failed to connect to celery due to a BrokenPipeError/ConnectionResetError
ur: بروکن پائپ ایرر/ کنکشن ریسیٹ ایرر کی وجہ سیلری سےرابطہ ناکام ہو گیا

source: A celery broker is running, but a celery worker is not available
ur: سیلری بروکر چل رہا ہے، لیکن سیلری ورکر موجود نہیں ہے

source: Unable to connect to a celery broker
ur: سیلری بروکر سے رابطہ کرنے سے قاصر

source: The survey you are attempting to sync is no longer available on the server
ur: آپ جس سروے کو سنک کرنے کی کوشش کر رہے ہیں وہ اب سرور پر دستیاب نہیں ہے

source: Sync Failed. User unauthorized to sync project
ur: سنک ناکام ہوگیا۔ صارف پروجیکٹ سنک کرنے کے لیے غیر مجاز ہے۔

source: Unable to determine user access to collector project
ur: کلکٹر پروجیکٹ تک صارف کی رسائی کا تعین کرنے سے قاصر

source: Failed to dispatch Couch proxy
ur: کاؤچ پراکسی بھیجنے میں ناکام

source: Sync failed
ur: سنک ناکام ہو گیا

source: Failed to dispatch Kibana proxy
ur: کبانا پراکسی بھیجنے میں ناکام

source: KibanaProxy failed
ur: کبانا پراکسی ناکام ہوگئی

source: Failed to create API request
ur: API درخواست بنانے میں ناکام

source: Sync Failed
ur: سنک ناکام ہوگیا

source: Unable to fetch collector projects
ur: کلیکٹر پراجیکٹ لانے سے قاصر

source: Unnamed Resource
ur: بے نام ریسورس

source: The specified resource '{0}' does not exist. JSON-LD export failed.
ur: مخصوص وسیلہ '{0}' موجود نہیں ہے۔ JSON-LD برآمد ناکام ہو گیا۔

source: New Resource
ur: نیا ریسورس

source: Tile not found.
ur: ٹائل نہیں ملی

source: No nodes matching query parameters found.
ur: کیوری کے پیرامیٹرز سے ملتے جلتےکوئی نوڈز نہیں ملے۔

source: No graph found for graphid %s
ur: گراف آئی ڈی %s کے لیے کوئی گراف نہیں ملا

source: User does not have permission to edit this node.
ur: صارف کو اس نوڈ میں ترمیم کرنے کی اجازت نہیں ہے۔

source: Signup for Arches
ur: آرچس کے لیے سائن اپ کریں

source: Thanks for your interest in Arches. Click on link below to confirm your email address! Use your email address to login.
ur: آرچز میں آپ کی دلچسپی کا شکریہ۔ اپنے ای میل ایڈریس کی تصدیق کے لیے نیچے دیے گئے لنک پر کلک کریں! لاگ ان کرنے کے لیے اپنا ای میل پتہ استعمال کریں۔

source: This link expires in 24 hours. If you can't get to it before then, don't worry, you can always try again with the same email address.
ur: یہ لنک 24 گھنٹے میں ختم ہو جائے گا۔ اگر آپ اس سے پہلے اس تک نہیں پہنچ سکتے تو پریشان نہ ہوں، آپ ہمیشہ اسی ای میل ایڈریس کے ساتھ دوبارہ کوشش کر سکتے ہیں۔

source: Welcome to Arches!
ur: آرچز میں خوش آمدید!

source: An email has been sent to <br><strong>%s</strong><br> with a link to activate your account
ur: آپ کے اکاؤنٹ کو ایکٹویٹ کرنے کے لیے ایک لنک کے ساتھ %s کو ایک ای میل بھیجی گئی ہے۔

source: The signup link has expired, please try signing up again. Thanks!
ur: سائن اپ لنک کی میعاد ختم ہو گئی ہے، براہ کرم دوبارہ سائن اپ کرنے کی کوشش کریں۔ شکریہ!

source: Invalid password
ur: غلط پاسورڈ

source: New password and confirmation must match
ur: نیا پاس ورڈ اور تصدیقی پاس ورڈ ایک جیسے ہونے چاہیے۔

source: Password successfully updated
ur: پاس ورڈ کامیابی کے ساتھ اپ ڈیٹ ہو گیا

source: Make sure to set your MOBILE_OAUTH_CLIENT_ID in settings.py
ur: settings.py میں اپنی MOBILE_OAUTH_CLIENT_ID سیٹ کرنا یقینی بنائیں

source: Using the RDM
ur: RDM کا استعمال کرتے ہوئے

source: Unable to Load SKOS File
ur: SKOS فائل لوڈ کرنے سے قاصر

source: There was an issue saving the contents of the file to Arches.
ur: فائل کے مواد کو آرچز میں محفوظ کرنے میں ایک مسئلہ آرہا تھا۔

source: Unable to Delete
ur: ڈیلیٹ کرنے سے قاصر

source: This concept or one of it's subconcepts is already in use by an existing resource.
ur: یہ کانسیپٹ یا اس کے ذیلی کانسیپٹ میں سے ایک پہلے سے موجود ریسورس کے زیر استعمال ہے۔

source: Success
ur: کامیابی

source: Collection successfully created from the selected concept
ur: منتخب کردہ کانسیپٹ سے کولیکشن کامیابی کے ساتھ بن گیا۔

source: Unable to Make Collection
ur: کولیکشن بنانے سے قاصر

source: Unable to make a collection from the selected concept.
ur: منتخب کردہ کانسیپٹ سے کولیکشن بنانے سے قاصر

source: Using the Arches Designer
ur: آرچز ڈیزائنر کا استعمال کرنا

source: No namespaces appear to be associated with {ontology.ontologyid} in the ontologies table. This is not a problem as long as all necessary namespaces are included in the ONTOLOGY_NAMESPACES setting.
ur: اونٹولوجی ٹیبل میں {ontology.ontologyid} کے ساتھ وابستہ کوئی namespace نہیں ہے۔ یہ کوئی مسئلہ نہیں ہے جب تک ONTOLOGY_NAMESPACES سیٹنگز میں تمام ضروری namespaces شامل ہیں۔

source: Branch Library
ur: برانچ لائبریری

source: Find a graph branch
ur: گراف برانچ تلاش کریں

source: Designing a Resource Model
ur: ریسورس ماڈل ڈیزائن کرنا

source: Designing a Branch
ur: برانچ ڈیزائن کرنا

source: Elasticsearch indexing error
ur: اِیلاسٹک سرچ ایرر

source: If you want to change the datatype of an existing node. Delete and then re-create the node, or export the branch then edit the datatype and re-import the branch.
ur: اگر آپ موجودہ نوڈ کا ڈیٹا ٹائپ تبدیل کرنا چاہتے ہیں۔ ڈیلیٹ کریں اور پھر نوڈ کو دوبارہ بنائیں، یا برانچ کو ایکسپورٹ کریں پھر ڈیٹا ٹائپ میں ترمیم کریں اور برانچ کو دوبارہ درآمد کریں۔

source: Managing Functions
ur: افعال کا انتظام

source: IIIF server proxy not configured
ur: IIIF سرور پراکسی کنفیگر نہیں ہے۔

source: Manifest Validation Error
ur: مینِفیسٹ ویلیڈیشن ایرر

source: Tileserver proxy not configured
ur: ٹائل سرور پراکسی کنفیگرڈ نہیں ہے۔

source: Unable to delete collector project
ur: کلیکٹر پروجیکٹ کو ڈیلیٹ کرنے سے قاصر

source: Unable to connect to CouchDB
ur: CouchDB سے رابطہ قائم کرنے سے قاصر

source: Unable to delete survey
ur: سروے ڈیلیٹ کرنے سے قاصر

source: Unable to connect to CouchDB. Please confirm that CouchDB is running
ur: CouchDB سے رابطہ قائم کرنے سے قاصر۔ براہ کرم تصدیق کریں کہ CouchDB چل رہا ہے۔

source: Unable to save collector project
ur: کلیکٹر پروجیکٹ کو محفوظ کرنے سے قاصر

source: Failed to connect to a CouchDB service
ur: CouchDB سروس سے رابطہ قائم کرنے میں ناکام

source: Logon to {app_name}
ur: {app_name} پر لاگ ان کریں

source: Welcome to Arches! You've just been added to a Mobile Survey. Please take a moment to review the mobile_survey description and mobile_survey start and end dates.
ur: آرچز میں خوش آمدید! آپ کو ابھی ایک موبائل سروے میں شامل کیا گیا ہے۔ براہ کرم mobile_survey کی تفصیل اور mobile_survey کے آغاز اور اختتامی تاریخوں کا جائزہ لینے کے لیے کچھ وقت نکالیں۔

source: If you have any qustions contact the site administrator at {admin_email}.
ur: اگر آپ کے پاس کوئی سوال ہے تو سائٹ ایڈمنسٹریٹر سے {admin_email} پر رابطہ کریں۔

source: You've been invited to an {app_name} Survey!
ur: آپ کو ایک {app_name} سروے میں مدعو کیا گیا ہے!

source: Hi! The Mobile Survey you were part of has ended or is temporarily suspended. Please permform a final sync of your local dataset as soon as possible.
ur: ہیلو ! آپ جس موبائل سروے کا حصہ تھے وہ ختم ہو گیا ہے یا عارضی طور پر معطل ہے۔ براہ کرم جلد از جلد اپنے لوکل ڈیٹاسیٹ کو حتمی سنک کریں۔

source: There's been a change to an {app_name} Survey that you're part of!
ur: ایک {app_name} سروےجس کا آپ حصہ ہیں اس میں تبدیلی ہوئی ہے!

source: Creating Resources
ur: ریسورسز بنانا

source: Managing System Settings
ur: سسٹم سیٹنگز کا انتظام

source: Using the Resource Editor
ur: ریسورس ایڈیٹر استعمال کیا جا رہا ہے

source: Unable to Delete Resource
ur: ریسورس کو ڈیلیٹ کرنے سے قاصر

source: User does not have permissions to delete this instance because the instance or its data is restricted
ur: صارف کے پاس اس انسٹینس کو ڈیلیٹ کرنے کی اجازت نہیں ہے کیونکہ انسٹینس یا اس کا ڈیٹا محدود ہے۔

source: Unable to delete. Please verify the model status is active
ur: ڈیلیٹ کرنے سے قاصر۔ تصدیق کریں کہ ماڈل کی حیثیت ایکٹیو ہے۔

source: Resource Created
ur: ریسورس بن گیا

source: Resource Deleted
ur: ریسورس ڈیلیٹڈ

source: Tile Deleted
ur: ٹائل ڈیلیٹڈ

source: Tile Created
ur: ٹائل بن گئی

source: Tile Updated
ur: ٹائل اپ ڈیٹ کردی گئی

source: Edit Deleted
ur: ایڈٹ ڈیلیٹ ہو گیا

source: Failed to fetch resource instance descriptors
ur: ریسورس انسٹینس ڈسکرپٹرز کو لا نے میں ناکام

source: No active report template is available for this resource.
ur: اس ریسورس کے لیے کوئی ایکٹیو رپورٹ ٹیمپلیٹ دستیاب نہیں ہے

source: Unable to delete. Relationship does not exist
ur: ڈیلیٹ کرنے سے قاصر۔ تعلق موجود نہیں

source: Unable to save. Please verify the model status is active
ur: محفوظ کرنے سے قاصر۔ تصدیق کریں کہ ماڈل کی حیثیت ایکٹیو ہے۔

source: Searching the Database
ur: ڈیٹا بیس میں سرچ کیا جا رہا ہے

source: {total} instances have been submitted for export. Click the Bell icon to check for a link to download your data
ur: برآمد کے لیے {total} انسٹینس جمع کر دی گئی ہیں۔ اپنا ڈیٹا ڈاؤن لوڈ لنک چیک کرنے کے لیے بیل آئیکن پر کلک کریں۔

source: Your search exceeds the {download_limit} instance download limit. Please refine your search
ur: آپ کی سرچ {download_limit} انسٹینس کی ڈاؤن لوڈ حد سے زیادہ ہے۔ براہ کرم اپنی سرچ کو بہتر کریں۔

source: Either no instances were identified for export or no resources have exportable geometry nodes Please confirm that the models of instances you would like to export have geometry nodes and that those nodes are set as exportable
ur: یا تو برآمد کے لیے کسی بھی انسٹینس کی نشاندہی نہیں کی گئی یا کسی ریسورس کے پاس قابل برآمد جیومیٹری نوڈز نہیں ہیں براہ کرم تصدیق کریں کہ انسٹینس کے ماڈلز جن کو آپ برآمد کرنا چاہتے ہیں ان میں جیومیٹری نوڈز ہیں اور یہ کہ وہ نوڈز قابل برآمد کے طور پر سیٹ ہیں۔

source: There was an error retrieving the search results
ur: سرچ کے نتائج کو حاصل کرنے میں ایک ایرر تھا۔

source: Downloading
ur: ڈاؤن لوڈنگ

source: The requested file is no longer available
ur: درخواست کردہ فائل اب دستیاب نہیں ہے۔

source: Saving tile failed
ur: ٹائل محفوظ کرنا ناکام ہو گیا

source: This tile is no longer available
ur: یہ ٹائل اب دستیاب نہیں ہے

source: It was likely deleted by another user
ur: ممکنہ طور پر اسے کسی دوسرے صارف نے ڈیلیٹ کر دیا ہے۔

source: Unable to save. Please verify your input is valid
ur: محفوظ کرنے سے قاصر۔ براہ کرم تصدیق کریں کہ آپ کا ان پٹ درست ہے۔

source: Request Failed
ur: درخواست ناکام

source: Unable to Save. Verify model status is active
ur: محفوظ کرنے سے قاصر۔ تصدیق کریں کہ ماڈل کی حیثیت ایکٹیو ہے۔

source: Permission Denied
ur: اجازت نہیں دی گئی

source: It was likely already deleted by another user
ur: ممکنہ طور پر اسے پہلے ہی کسی دوسرے صارف نے ڈیلیٹ کر دیا ہے۔

source: Unable to delete. Verify model status is active
ur: ڈیلیٹ کرنے سے قاصر۔ تصدیق کریں کہ ماڈل کی حیثیت ایکٹیو ہے۔

source: You do not have permissions to delete a tile with authoritative data.
ur: آپ کو مستند ڈیٹا کے ساتھ ٹائل کو ڈیلیٹ کرنے کی اجازت نہیں ہے۔

source: Not yet logged in
ur: ابھی لاگ ان نہیں ہوا

source: Profile Editing
ur: پروفائل ایڈیٹنگ

source: Your
ur: آپ کا

source: You must supply an ontology_config.json within your ontology source directory.
ur: آپ کو اپنی آنٹولوجی سورس ڈائرکٹری میں ایک ontology_config.json فراہم کرنی چاہیے۔

source: '{config_file}' was not found.
ur: '{config_file}' نہیں ملی۔

source: You must supply a version number using the -vn/--version argument.
ur: آپ کو -vn/--version آرگمنٹ کا استعمال کرتے ہوئے ایک ورژن نمبر ضرور فراہم کرنا ہوگا۔
