Repository: junaidabduljabbar/arches7-internationalization
Catalog: translated_out.po
Languages: ur

source: If there are multiple instances of a given card in a Resource, the first one added will be used to create these descriptors. To manually change this, edit the Resource in question and drag the desired tile to the top of the list.
ur: اگر کسی وسیلہ میں دیئے گئے کارڈ کی متعدد مثالیں ہیں، تو پہلے شامل کردہ کارڈ کو ان ڈسکرپٹرز بنانے کے لیے استعمال کیا جائے گا۔ اسے دستی طور پر تبدیل کرنے کے لیے زیربحث وسائل میں ترمیم کریں اور مطلوبہ ٹائل کو فہرست کے اوپری حصے پر گھسیٹیں۔

source: Any user with read access permission to a resource will be seeing these resource descriptors wherever it shows up in search results or on the map. <strong>If a card is intended to be hidden from any group of users, it should not be used in this function.</strong>
ur: وسائل تک رسائی کی پڑھنے کی اجازت کے ساتھ کوئی بھی صارف ان وسائل کی وضاحت کنندگان کو دیکھے گا جہاں بھی یہ تلاش کے نتائج یا نقشے پر نظر آئے گا۔ <strong>اگر کارڈ کو صارفین کے کسی گروپ سے چھپانے کا ارادہ ہے، تو اسے اس فنکشن میں استعمال نہیں کیا جانا چاہیے۔</strong>

source: <h5>Example</h5> <p>Consider a Resource where the <strong>Name</strong> node value is <em>Folsom School</em> and <strong>Name Type</strong> node value is <em>Primary</em>.</p> <p>Selecting the <strong>Name</strong> card will populate the template with <code>&lt;Name Type&gt;, &lt;Name&gt;</code>. The resulting descriptor would read <em>Primary, Folsom School</em>. Changing the template to <code>Building Name: &lt;Name&gt;</code> would yield <em>Building Name: Folsom School</em>.</p>
ur: <h5>مثال</h5> <p>ایک وسائل پر غور کریں جہاں <strong>نام</strong> نوڈ ویلیو <em>Folsom School</em> ہے اور <strong>نام کی قسم</strong> نوڈ ویلیو <em>پرائمری</em> ہے۔ </p> <p><strong>نام</strong> کارڈ کو منتخب کرنے سے ٹیمپلیٹ کو <code>&lt;Name Type&gt;, &lt;Name&gt;</code> کے ساتھ آباد کر دیا جائے گا۔ نتیجہ خیز وضاحت کنندہ <em>پرائمری، فولسم اسکول</em> پڑھے گا۔ ٹیمپلیٹ کو <code>Building Name: &lt;Name&gt;</code> میں تبدیل کرنے سے <em>عمارت کا نام: فولسم اسکول</em> حاصل ہوگا۔</p>

source: Graph Tab
ur: گراف ٹیب

source: In this tab you will design the graph&mdash;the core of a Resource Model or Branch. In fact, sometimes Resource Models and Branches are generically referred to as "graphs".
ur: اس ٹیب میں آپ کسی ریسورس ماڈل یا برانچ کا بنیادی گراف&mdash؛ ڈیزائن کریں گے۔ درحقیقت، بعض اوقات ریسورس ماڈلز اور برانچز کو عام طور پر "گراف" کہا جاتا ہے۔

source: For the first step in building a graph, you should fill out the <strong>top-level settings</strong>. Some of these may be changed later while others can't, so make sure to do a lot of testing while developing a graph. With the top-level settings in place, it's time to <strong>construct the graph</strong> by adding nodes (or full Branches) to the graph tree. Along the way, you'll need to set the <strong>node-level settings</strong> for each node you create.
ur: گراف بنانے کے پہلے مرحلے کے لیے، آپ کو <strong>اعلی سطحی ترتیبات</strong> کو پُر کرنا چاہیے۔ ان میں سے کچھ کو بعد میں تبدیل کیا جا سکتا ہے جبکہ دوسرے نہیں کر سکتے، اس لیے گراف تیار کرتے وقت بہت زیادہ جانچ کرنا یقینی بنائیں۔ اعلیٰ سطحی ترتیبات کے ساتھ، گراف ٹری میں نوڈس (یا مکمل شاخیں) شامل کرکے <strong>گراف کی تعمیر</strong> کا وقت آگیا ہے۔ راستے میں، آپ کو اپنے بنائے ہوئے ہر نوڈ کے لیے <strong>نوڈ لیول سیٹنگز</strong> سیٹ کرنے کی ضرورت ہوگی۔

source: Once you've finished creating this Resource Model or Branch make sure to set its status to "active".
ur: ایک بار جب آپ اس ریسورس ماڈل یا برانچ کو بنانا مکمل کر لیں تو یقینی بنائیں کہ اس کی حیثیت کو "فعال" پر سیٹ کریں۔

source: Top-Level Settings
ur: ٹاپ-لیول سیٹنگز

source: Identifiers
ur: شناخت کنندگان

source: Used to identify this Resource Model throughout the app interface. Default is New Resource Model.
ur: پورے ایپ انٹرفیس میں اس ریسورس ماڈل کی شناخت کے لیے استعمال کیا جاتا ہے۔ ڈیفالٹ نیا ریسورس ماڈل ہے۔

source: Optional subtitle, displayed on the Arches Designer home page.
ur: اختیاری سب ٹائٹل، آرچز ڈیزائنر ہوم پیج پر ظاہر ہوتا ہے۔

source: Ontology
ur: آنٹولوجی

source: Decide whether an ontology will be enforced in this graph. To learn more about what this means, read <a href="https://arches.readthedocs.io/en/stable/ontologies-in-arches" target="_blank">Ontologies in Arches</a>. By default, you are allowed to choose between using the CIDOC CRM v6.2, or using no ontology. Once a node or branch has been added to this graph the <strong>Ontology</strong> setting <em>cannot be modified</em>.
ur: فیصلہ کریں کہ آیا اس گراف میں آنٹولوجی نافذ کی جائے گی۔ اس کا کیا مطلب ہے اس کے بارے میں مزید جاننے کے لیے، <a href="https://arches.readthedocs.io/en/stable/ontologies-in-arches" target="_blank">Antologies in Arches</a> پڑھیں۔ پہلے سے طے شدہ طور پر، آپ کو CIDOC CRM v6.2 استعمال کرنے، یا بغیر آنٹولوجی کا استعمال کرنے کے درمیان انتخاب کرنے کی اجازت ہے۔ ایک بار جب کوئی نوڈ یا برانچ اس گراف میں شامل ہو جائے تو <strong>آنٹولوجی</strong> ترتیب <em>تبدیل نہیں کی جا سکتی</em>۔

source: Root Class
ur: روٹ کلاس

source: This setting is only necessary if an "Ontology" has been chosen. Define the ontology class of the root node for this graph.
ur: یہ ترتیب صرف اس صورت میں ضروری ہے جب "آنٹولوجی" کا انتخاب کیا گیا ہو۔ اس گراف کے لیے روٹ نوڈ کی آنٹولوجی کلاس کی وضاحت کریں۔

source: Configuration
ur: کنفیگریشن

source: Status
ur: سٹیٹس

source: Set to "inactive" to disallow use of this graph during development. Inactive Resource Models cannot be used to create new resources, and inactive Branches can not be added to a Resource Model.
ur: ترقی کے دوران اس گراف کے استعمال کی اجازت دینے کے لیے "غیر فعال" پر سیٹ کریں۔ غیر فعال ریسورس ماڈلز کو نئے وسائل بنانے کے لیے استعمال نہیں کیا جا سکتا، اور غیر فعال برانچوں کو ریسورس ماڈل میں شامل نہیں کیا جا سکتا۔

source: Resource models that may be related
ur: وسائل کے ماڈل جو متعلقہ ہوسکتے ہیں۔

source: Choose which Resource Models can be related to this one with resource-to-resource relationships.
ur: منتخب کریں کہ کون سے وسیلہ ماڈلز وسائل سے وسائل کے تعلقات کے ساتھ اس سے متعلق ہوسکتے ہیں۔

source: Root Node Data Type
ur: روٹ نوڈ ڈیٹا کی قسم

source: Choose what data type to use for the root node of this Branch.
ur: منتخب کریں کہ اس برانچ کے روٹ نوڈ کے لیے کس قسم کا ڈیٹا استعمال کرنا ہے۔

source: Author
ur: مصنف

source: You can optionally add an <strong>Author</strong> to this graph. Only administrators will see this information.
ur: آپ اختیاری طور پر ایک <strong>مصنف</strong> کو اس گراف میں شامل کر سکتے ہیں۔ صرف منتظمین ہی اس معلومات کو دیکھیں گے۔

source: Abstract
ur: ابسٹرکٹ

source: You can optionally add an <strong>Abstract</strong> to this graph.
ur: آپ اختیاری طور پر اس گراف میں ایک <strong>خلاصہ</strong> شامل کر سکتے ہیں۔

source: Users will see this abstract when they are presented with a choice of what Resource Model to use to create a new resource.
ur: صارفین کو یہ خلاصہ اس وقت نظر آئے گا جب انہیں یہ انتخاب پیش کیا جائے گا کہ نیا وسیلہ بنانے کے لیے کون سا ریسورس ماڈل استعمال کرنا ہے۔

source: This abstract will be shown in the Branch Library which is used during graph construction.
ur: یہ خلاصہ برانچ لائبریری میں دکھایا جائے گا جو گراف کی تعمیر کے دوران استعمال ہوتا ہے۔

source: JSON-LD Context
ur: JSON-LD سیاق و سباق

source: Add a <a href="https://www.w3.org/TR/json-ld/">JSON-LD Context</a> for this Resource Model. This allows you to namespace common URI endpoints that are used within a JSON-LD output of the resource. You can enter a plain URL (<code>"http://www.cidoc-crm.org/cidoc-crm/"</code>), or JSON that defines multiple keys (<code>{"crm":"http://www.cidoc-crm.org/cidoc-crm/","rdf":"http://www.w3.org/1999/02/22-rdf-syntax-ns#"}</code>).
ur: اس ریسورس ماڈل کے لیے ایک <a href="https://www.w3.org/TR/json-ld/">JSON-LD سیاق و سباق</a> شامل کریں۔ یہ آپ کو عام URI اینڈ پوائنٹس کو نام دینے کی اجازت دیتا ہے جو وسائل کے JSON-LD آؤٹ پٹ میں استعمال ہوتے ہیں۔ آپ ایک سادہ URL (<code>"http://www.cidoc-crm.org/cidoc-crm/"</code>)، یا JSON درج کر سکتے ہیں جو متعدد کلیدوں کی وضاحت کرتا ہے (<code>{"crm":" http://www.cidoc-crm.org/cidoc-crm/","rdf":"http://www.w3.org/1999/02/22-rdf-syntax-ns#"}</code >)۔

source: Appearance
ur: ظہور

source: Color
ur: رنگ

source: Choose a color for this Resource Model to be used in the related resources force directed graph.
ur: اس ریسورس ماڈل کے لیے ایک رنگ منتخب کریں جو متعلقہ ریسورسز فورس ڈائریکٹڈ گراف میں استعمال کیا جائے۔

source: Icon
ur: آئیکن

source: Choose an icon to identify this graph throughout the app interface. You can browse the icons to select one, or type in the search bar to filter them. Arches uses the <a href="http://fontawesome.io/" target="_blank">Font Awesome</a> icon library; custom icons are not supported.
ur: پورے ایپ انٹرفیس میں اس گراف کی شناخت کے لیے ایک آئیکن کا انتخاب کریں۔ آپ ایک کو منتخب کرنے کے لیے شبیہیں براؤز کر سکتے ہیں، یا انہیں فلٹر کرنے کے لیے سرچ بار میں ٹائپ کر سکتے ہیں۔ آرچز <a href="http://fontawesome.io/" target="_blank">Font Awesome</a> آئیکن لائبریری کا استعمال کرتا ہے؛ حسب ضرورت شبیہیں تعاون یافتہ نہیں ہیں۔

source: Construct the Graph
ur: گراف بنائیں

source: Use the graph tree on the left side of the page to construct the graph. Every new graph starts with a <strong>Top Node</strong>, which will take the name of the new Resource Model or Branch. From this node, you can either <strong>Add Child Node</strong> to add a single node, or <strong>Add Branch</strong> to add an entire existing Branch.
ur: گراف بنانے کے لیے صفحہ کے بائیں جانب گراف ٹری کا استعمال کریں۔ ہر نیا گراف ایک <strong>ٹاپ نوڈ</strong> سے شروع ہوتا ہے، جو نئے ریسورس ماڈل یا برانچ کا نام لے گا۔ اس نوڈ سے، آپ ایک نوڈ کو شامل کرنے کے لیے یا تو <strong>چائلڈ نوڈ شامل کریں</strong>، یا پوری موجودہ برانچ کو شامل کرنے کے لیے <strong>شاخ شامل کریں</strong> کرسکتے ہیں۔

source: At any point during construction you can switch from <strong>Design</strong> mode to <strong>Preview</strong> to see the full shape of your graph.
ur: تعمیر کے دوران کسی بھی وقت آپ اپنے گراف کی مکمل شکل دیکھنے کے لیے <strong>ڈیزائن</strong> موڈ سے <strong>پیش نظارہ</strong> میں تبدیل کر سکتے ہیں۔

source: If you have created a branch structure in a Resource Model that you would like to use in a different Resource Model, you can export it from the graph tree.
ur: اگر آپ نے ریسورس ماڈل میں برانچ کا ڈھانچہ بنایا ہے جسے آپ کسی مختلف ریسورس ماڈل میں استعمال کرنا چاہتے ہیں، تو آپ اسے گراف ٹری سے ایکسپورٹ کر سکتے ہیں۔

source: add a node and branch to new graph - click to view
ur: نئے گراف میں نوڈ اور برانچ شامل کریں - دیکھنے کے لیے کلک کریں۔

source: Node-Level Settings
ur: نوڈ-لیول سیٹنگز

source: Node Identifiers
ur: نوڈ شناخت کنندگان

source: Node Name
ur: نوڈ کا نام

source: Set the name for this node. This will be used by default in the user interface, but a different name for display can be configured at the widget level.
ur: اس نوڈ کا نام سیٹ کریں۔ یہ صارف انٹرفیس میں بطور ڈیفالٹ استعمال کیا جائے گا، لیکن ویجیٹ کی سطح پر ڈسپلے کے لیے ایک مختلف نام ترتیب دیا جا سکتا ہے۔

source: Ontology Class
ur: آنٹولوجی کلاس

source: only present if this graph uses an ontology
ur: صرف اس صورت میں موجود ہے جب یہ گراف ایک آنٹولوجی استعمال کرتا ہے۔

source: This setting assigns an ontological class to this node. To learn more, read <a href="https://arches.readthedocs.io/en/stable/managing-resources/#ontologies-in-arches" target="_blank">Ontologies in Arches</a>
ur: یہ ترتیب اس نوڈ کو ایک اونٹولوجیکل کلاس تفویض کرتی ہے۔ مزید جاننے کے لیے، <a href="https://arches.readthedocs.io/en/stable/managing-resources/#ontologies-in-arches" target="_blank">آرچز میں آنٹولوجیز</a> پڑھیں

source: Relationship to...
ur: سے رشتہ...

source: Define what relationship this node has with its parent node (the one directly above it in the graph tree). A verbalization of your choice is shown in the <strong>Semantics</strong> section below this setting.
ur: وضاحت کریں کہ اس نوڈ کا اس کے پیرنٹ نوڈ کے ساتھ کیا تعلق ہے (گراف ٹری میں براہ راست اس کے اوپر والا)۔ اس ترتیب کے نیچے <strong>Semantics</strong> سیکشن میں آپ کی پسند کا لفظی بیان دکھایا گیا ہے۔

source: Node Data Type and Settings
ur: نوڈ ڈیٹا کی قسم اور ترتیبات

source: Depending on which data type you choose, you may have many more settings to fill out. Those listed below will be present for every node no matter the data type.
ur: اس پر منحصر ہے کہ آپ کس ڈیٹا کی قسم کا انتخاب کرتے ہیں، آپ کے پاس پُر کرنے کے لیے اور بھی بہت سی ترتیبات ہو سکتی ہیں۔ ذیل میں درج ہر نوڈ کے لیے موجود ہوں گے چاہے ڈیٹا کی قسم ہی کیوں نہ ہو۔

source: Data type
ur: ڈیٹا کی قسم

source: Choose the data type for this node. Please see the <strong>Default Data Types</strong> section below. Once data is collected for this node, this setting cannot be changed.
ur: اس نوڈ کے لیے ڈیٹا کی قسم کا انتخاب کریں۔ براہ کرم ذیل میں <strong>ڈیفالٹ ڈیٹا کی اقسام</strong> سیکشن دیکھیں۔ اس نوڈ کے لیے ڈیٹا اکٹھا کرنے کے بعد، اس ترتیب کو تبدیل نہیں کیا جا سکتا۔

source: Expose to Advanced Search
ur: اعلی درجے کی تلاش کو بے نقاب کریں۔

source: If true users will be able to add this node to an Advanced Search query.
ur: اگر سچے صارف اس نوڈ کو ایڈوانسڈ سرچ استفسار میں شامل کر سکیں گے۔

source: Required
ur: درکار ہے۔

source: If true a value must be entered for this node in order to save it. Once data is collected for this node, this setting cannot be changed.
ur: اگر صحیح ہے تو اس نوڈ کو محفوظ کرنے کے لیے اس کے لیے ایک قدر درج کرنا ضروری ہے۔ اس نوڈ کے لیے ڈیٹا اکٹھا کرنے کے بعد، اس ترتیب کو تبدیل نہیں کیا جا سکتا۔

source: Place node(s) in a separate card
ur: نوڈز کو الگ کارڈ میں رکھیں

source: only present if this node is not already the top node for a card
ur: صرف اس صورت میں موجود ہے جب یہ نوڈ پہلے سے کسی کارڈ کے لیے ٹاپ نوڈ نہیں ہے۔

source: If true this node will be set in a different card from its parent. This affects data entry, and you are encouraged to test both states of this setting while building you graph. Once data is collected for this node, this setting cannot be changed.
ur: اگر صحیح ہے تو یہ نوڈ اس کے والدین سے مختلف کارڈ میں سیٹ کیا جائے گا۔ یہ ڈیٹا انٹری کو متاثر کرتا ہے، اور آپ کو گراف بناتے وقت اس ترتیب کی دونوں حالتوں کی جانچ کرنے کی ترغیب دی جاتی ہے۔ اس نوڈ کے لیے ڈیٹا اکٹھا کرنے کے بعد، اس ترتیب کو تبدیل نہیں کیا جا سکتا۔

source: Default Data Types
ur: ڈیفالٹ ڈیٹا کی اقسام

source: The data type of a node determines what kind of data that node will store. Once chosen, some data types will require further configuration.
ur: نوڈ کی ڈیٹا کی قسم اس بات کا تعین کرتی ہے کہ وہ نوڈ کس قسم کا ڈیٹا اسٹور کرے گا۔ ایک بار منتخب ہونے کے بعد، کچھ ڈیٹا کی اقسام کو مزید کنفیگریشن کی ضرورت ہوگی۔

source: Developers can <a href="https://arches.readthedocs.io/en/stable/functions-widgets-datatypes/#datatypes" target="_blank">create new datatypes</a>.
ur: ڈیولپرز <a href="https://arches.readthedocs.io/en/stable/functions-widgets-datatypes/#datatypes" target="_blank">نئی ڈیٹا ٹائپس بنا سکتے ہیں</a>۔

source: boolean
ur: بولین

source: Use this to store a "yes"/"no" or "true"/"false" value.
ur: اسے "ہاں"/"نہیں" یا "سچ"/"غلط" قدر ذخیرہ کرنے کے لیے استعمال کریں۔

source: concept
ur: کانسپٹ

source: Stores one of a series of concepts from the Reference Data Manager. Users will choose a concept in a dropdown list or set of radio buttons. You'll further be prompted to choose a <strong>Concept Collection</strong>&mdash;this controls which concepts the user is able to choose from.
ur: حوالہ ڈیٹا مینیجر سے تصورات کی ایک سیریز کو اسٹور کرتا ہے۔ صارفین ڈراپ ڈاؤن فہرست یا ریڈیو بٹنوں کے سیٹ میں ایک تصور کا انتخاب کریں گے۔ آپ کو مزید ایک <strong>تصوراتی مجموعہ</strong> کا انتخاب کرنے کا اشارہ کیا جائے گا&mdash;یہ کنٹرول کرتا ہے کہ صارف کن تصورات میں سے انتخاب کر سکتا ہے۔

source: concept-list
ur: تصور کی فہرست

source: Stores multiple concepts in a single node.
ur: ایک ہی نوڈ میں متعدد تصورات کو اسٹور کرتا ہے۔

source: date
ur: تاریخ

source: Stores a CE calendar date. See etdf for BCE and fuzzy date handling.
ur: CE کیلنڈر کی تاریخ محفوظ کرتا ہے۔ BCE اور فجی ڈیٹ ہینڈلنگ کے لیے etdf دیکھیں۔

source: Stores an <a href='https://www.loc.gov/standards/datetime/' target='_blank'>Extended Date/Time Format</a> value. Use this data type for BCE dates or dates with uncertainty. This datatype requires extra configuration to inform the database search methods how to interpret EDTF values. Data entry users can enter edtf dates using formats listed in the <a href='https://www.loc.gov/standards/datetime/pre-submission.html' target='_blank'>EDTF draft specification</a>.
ur: ایک <a href='https://www.loc.gov/standards/datetime/' target='_blank'>توسیع شدہ تاریخ/وقت فارمیٹ</a> قدر ذخیرہ کرتا ہے۔ اس ڈیٹا کی قسم کو BCE تاریخوں یا غیر یقینی صورتحال کے ساتھ تاریخوں کے لیے استعمال کریں۔ اس ڈیٹا ٹائپ کو ڈیٹا بیس کی تلاش کے طریقوں سے آگاہ کرنے کے لیے اضافی کنفیگریشن کی ضرورت ہوتی ہے کہ EDTF قدروں کی تشریح کیسے کی جائے۔ ڈیٹا انٹری کے صارفین <a href='https://www.loc.gov/standards/datetime/pre-submission.html' target='_blank'>EDTF ڈرافٹ تفصیلات</a> میں درج فارمیٹس کا استعمال کرتے ہوئے edtf تاریخیں درج کر سکتے ہیں۔ .

source: file-list
ur: فائل کی فہرست

source: Stores one or mores files. Use this to upload images, documents, etc.
ur: ایک یا زیادہ فائلوں کو اسٹور کرتا ہے۔ تصاویر، دستاویزات وغیرہ کو اپ لوڈ کرنے کے لیے اس کا استعمال کریں۔

source: Used to store an <a href='http://iiif.io/' target='_blank'>IIIF compliant</a> image.
ur: <a href='http://iiif.io/' target='_blank'>IIIF کے مطابق</a> تصویر کو ذخیرہ کرنے کے لیے استعمال کیا جاتا ہے۔

source: Stores geographic coordinates, and is used to show a resource on the map.
ur: جغرافیائی نقاط کو اسٹور کرتا ہے، اور نقشے پر وسائل دکھانے کے لیے استعمال ہوتا ہے۔

source: domain-value
ur: ڈومین-ویلیو

source: Similar to "concept", choose this to present the user with a dropdown list or set of radio buttons. Unlike "concept" this dropdown menu will not come from your system-wide controlled vocubulary, but from a list of values that you must define here.
ur: "تصور" کی طرح، صارف کو ڈراپ ڈاؤن فہرست یا ریڈیو بٹنوں کے سیٹ کے ساتھ پیش کرنے کے لیے اسے منتخب کریں۔ "تصور" کے برعکس یہ ڈراپ ڈاؤن مینو آپ کے پورے نظام میں کنٹرول شدہ ذخیرہ الفاظ سے نہیں آئے گا، بلکہ اقدار کی فہرست سے آئے گا جس کی وضاحت آپ کو یہاں کرنی چاہیے۔

source: domain-value-list
ur: ڈومین-ویلیو-لسٹ

source: Stores multiple domain-values in a single node.
ur: ایک ہی نوڈ میں متعدد ڈومین ویلیوز محفوظ کرتا ہے۔

source: Stores a csv chart formatted as JSON.
ur: JSON کے بطور فارمیٹ کردہ csv چارٹ اسٹور کرتا ہے۔

source: node-value
ur: نوڈ-ویلیو

source: Stores a reference to a different node in this graph. This would allow you to store duplicate data in more than one branch.
ur: اس گراف میں ایک مختلف نوڈ کا حوالہ محفوظ کرتا ہے۔ یہ آپ کو ایک سے زیادہ برانچوں میں ڈپلیکیٹ ڈیٹا کو ذخیرہ کرنے کی اجازت دے گا۔

source: number
ur: نمبر

source: Stores a number.
ur: نمبر اسٹور کرتا ہے۔

source: Embeds a separate resource instance into this node. For example, you could add a node called "Assessed By" to a condition assessment branch, and use this data type. This would allow you to associate an individual stored in your database as an Actor resource with a specific condition assessment. Note that this construction is different from making a "resource-to-resource relationship".
ur: اس نوڈ میں ایک الگ وسائل کی مثال کو سرایت کرتا ہے۔ مثال کے طور پر، آپ کنڈیشن اسسمنٹ برانچ میں "Asessed By" نام کا نوڈ شامل کر سکتے ہیں، اور اس ڈیٹا ٹائپ کو استعمال کر سکتے ہیں۔ یہ آپ کو اپنے ڈیٹا بیس میں ذخیرہ شدہ فرد کو بطور ایکٹر ریسورس کے ساتھ ایک مخصوص حالت کی تشخیص کے ساتھ منسلک کرنے کی اجازت دے گا۔ نوٹ کریں کہ یہ تعمیر "وسائل سے وسائل کا رشتہ" بنانے سے مختلف ہے۔

source: Stores a list of resource instances in a single node.
ur: ایک ہی نوڈ میں وسائل کی مثالوں کی فہرست اسٹور کرتا ہے۔

source: semantic
ur: سیمنٹک

source: <em>A semantic node does not store data.</em> Semantic nodes are used where necessary to make symbolic connections between other nodes, generally in order to follow ontological rules. The top node of every graph is a semantic node.
ur: <em>ایک سیمنٹک نوڈ ڈیٹا کو اسٹور نہیں کرتا ہے۔</em> سیمینٹک نوڈس کو دوسرے نوڈس کے درمیان علامتی کنکشن بنانے کے لیے استعمال کیا جاتا ہے، عام طور پر آنٹولوجیکل اصولوں پر عمل کرنے کے لیے۔ ہر گراف کا اوپری نوڈ ایک سیمنٹک نوڈ ہوتا ہے۔

source: string
ur: سٹرنگ

source: Stores a string of text. This could be something simple like a name, or more something elaborate like a descriptive paragraph with formatting and hyperlinks.
ur: متن کی ایک تار ذخیرہ کرتا ہے۔ یہ کچھ آسان ہو سکتا ہے جیسا کہ نام، یا مزید کچھ تفصیلی پیراگراف جیسے فارمیٹنگ اور ہائپر لنکس کے ساتھ۔

source: <p>Three categories of Map Layers will appear on your map: <strong>Resource Layers</strong> (the contents of your database), <strong>Basemaps</strong> (static background layers), and <strong>Overlays</strong> (custom data layers from outside your database). To configure a layer, first select its category in the top bar, and then choose it from the list at left.</p>
ur: <p>نقشہ کی تہوں کی تین قسمیں آپ کے نقشے پر ظاہر ہوں گی: <strong>وسائل کی تہیں</strong> (آپ کے ڈیٹا بیس کا مواد)، <strong>بیس میپس</strong> (جامد پس منظر کی تہیں)، اور <strong>اوورلیز </strong>(آپ کے ڈیٹا بیس کے باہر سے حسب ضرورت ڈیٹا لیئرز)۔ کسی پرت کو ترتیب دینے کے لیے، سب سے پہلے اوپر والے بار میں اس کا زمرہ منتخب کریں، اور پھر اسے بائیں طرف کی فہرست سے منتخب کریں۔</p>

source: Resource Layers display the resource layers in your database. One Resource Layer is created for each node with a geospatial datatype (for example, <code>geojson-feature-collection</code>). You are able to customize the appearance and visibility of each Resource Layer in the following ways.
ur: وسائل کی پرتیں آپ کے ڈیٹا بیس میں وسائل کی تہوں کو ظاہر کرتی ہیں۔ جغرافیائی ڈیٹا ٹائپ کے ساتھ ہر نوڈ کے لیے ایک ریسورس لیئر بنائی گئی ہے (مثال کے طور پر، <code>geojson-feature-collection</code>)۔ آپ مندرجہ ذیل طریقوں سے ہر ریسورس لیئر کی ظاہری شکل اور مرئیت کو اپنی مرضی کے مطابق بنا سکتے ہیں۔

source: Service Styling
ur: سروس سٹائلنگ

source: Define the way features will look on the map. The example map has demonstration features that give you a preview of the changes you make. You can choose to use <strong>Advanced Editing</strong> to create a more nuanced style. Note that changes made in Advanced Editing will not be reflected if you switch back to basic editing. For styling reference, checkout the <a href='https://www.mapbox.com/mapbox-gl-js/style-spec/' target='_blank'>MapBox Style Specification</a>.
ur: نقشے پر خصوصیات کے نظر آنے کے طریقے کی وضاحت کریں۔ مثال کے نقشے میں نمائشی خصوصیات ہیں جو آپ کو ان تبدیلیوں کا پیش نظارہ دیتی ہیں جو آپ کرتے ہیں۔ آپ <strong>اعلی ترمیم</strong> کو استعمال کرنے کا انتخاب کر سکتے ہیں تاکہ ایک مزید نفیس انداز تخلیق کیا جا سکے۔ نوٹ کریں کہ اگر آپ بنیادی ترمیم پر واپس جاتے ہیں تو ایڈوانسڈ ایڈیٹنگ میں کی گئی تبدیلیاں ظاہر نہیں ہوں گی۔ اسٹائل کے حوالے کے لیے، <a href='https://www.mapbox.com/mapbox-gl-js/style-spec/' target='_blank'>MapBox طرز کی تفصیلات</a> کو چیک کریں۔

source: You can change the name of this overlay if desired; by default it will use the name of its Resource Model. You make also set the layer to be added to the search map by default, or choose a custom icon for it.
ur: اگر آپ چاہیں تو اس اوورلے کا نام تبدیل کر سکتے ہیں۔ پہلے سے طے شدہ طور پر یہ اپنے ریسورس ماڈل کا نام استعمال کرے گا۔ آپ تلاش کے نقشے میں بطور ڈیفالٹ شامل کرنے کے لیے پرت بھی ترتیب دیتے ہیں، یا اس کے لیے ایک حسب ضرورت آئیکن منتخب کرتے ہیں۔

source: Clustering
ur: کلسٹرنگ

source: Arches uses 'clustering' to better display resources at low zoom levels (zoomed out). You are able to control the clustering settings for each layer individually.
ur: کم زوم لیول (زوم آؤٹ) پر وسائل کو بہتر طریقے سے ڈسپلے کرنے کے لیے آرچز 'کلسٹرنگ' کا استعمال کرتے ہیں۔ آپ انفرادی طور پر ہر پرت کے لیے کلسٹرنگ سیٹنگز کو کنٹرول کرنے کے قابل ہیں۔

source: <strong>Cluster Distance</strong> - distance (in pixels) within which resources will be clustered
ur: <strong>کلسٹر فاصلہ</strong> - فاصلہ (پکسلز میں) جس کے اندر وسائل کلسٹر کیے جائیں گے
